Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: {b_start}Eligible for credit:{b_end} Receive academic credit after successfully completing the course
kk_kz: {b_start}Засчитывается в вузах.{b_end} Получите зачётные баллы после успешного окончания курса.

source: {b_start}Unlimited Course Access: {b_end}Learn at your own pace, and access materials anytime to brush up on what you've learned.
kk_kz: {b_start}курсқа шексіз қол жетімділік: {b_end}өз қарқыныңызбен оқып, білгендеріңізді жаңарту үшін кез-келген уақытта материалдарға қол жеткізіңіз.

source: {b_start}Graded Assignments: {b_end}Build your skills through graded assignments and projects.
kk_kz: {b_start}бағаланатын тапсырмалар: {b_end}бағаланатын тапсырмалар мен жобалар арқылы өз дағдыларыңызды дамытыңыз.

source: Benefits of a Verified Certificate
kk_kz: Расталған сертификаттың артықшылықтары

source: {b_start}Official:{b_end} Receive an instructor-signed certificate with the institution's logo
kk_kz: {b_start}Официальный документ.{b_end} Получите подписанный преподавателем сертификат с логотипом учебного заведения.

source: {b_start}Easily shareable:{b_end} Add the certificate to your CV or resume, or post it directly on LinkedIn
kk_kz: {b_start}Легко поделиться.{b_end} Добавьте ссылку на сертификат в резюме или опубликуйте его прямо на LinkedIn.

source: Pursue a Verified Certificate
kk_kz: Расталған сертификат алыңыз

source: Pursue the Verified Track
kk_kz: Дәлелденген жолмен жүріңіз

source: Highlight your new knowledge and skills with a verified certificate. Use this valuable credential to improve your job prospects and advance your career, or highlight your certificate in school applications.
kk_kz: Айтыңыз өздерінің жаңа білімдері мен дағдылары көмегімен расталған сертификат. Осы құнды тіркелгі деректерін жұмысқа деген көзқарасыңызды жақсарту және мансаптық өсу үшін пайдаланыңыз немесе мектеп өтінімдерінде сертификатыңызды бөлектеңіз.

source: {b_start}Official: {b_end}Receive an instructor-signed certificate with the institution's logo
kk_kz: {b_start}Официальный документ.{b_end} Получите подписанный преподавателем сертификат с логотипом учебного заведения.

source: {b_start}Easily shareable: {b_end}Add the certificate to your CV or resume, or post it directly on LinkedIn
kk_kz: {b_start}Легко поделиться.{b_end} Добавьте ссылку на сертификат в резюме или опубликуйте его прямо на LinkedIn.

source: {b_start}Motivating: {b_end}Give yourself an additional incentive to complete the course
kk_kz: {b_start}Мотивация.{b_end} Создайте дополнительный стимул для успешного окончания курса.

source: Audit This Course
kk_kz: Осы курсты қарау

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums.
kk_kz: Пройдите этот курс бесплатно и получите полный доступ ко всем учебным материалам, тестам и форумам.

source: Audit This Course (No Certificate)
kk_kz: Осы Курстың Аудиті (Сертификатсыз)

source: Audit this course for free and have access to course materials and discussions forums. {b_start}This track does not include graded assignments, or unlimited course access.{b_end}
kk_kz: Осы курстың тегін аудитін өткізіп, курстық материалдар мен пікірталас форумдарына қол жеткізіңіз. {b_start}бұл жолда бағаланған тапсырмалар немесе курсқа шексіз қол жетімділік жоқ.{b_end}

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums. {b_start}Please note that this track does not offer a certificate for learners who earn a passing grade.{b_end}
kk_kz: Осы курстың тегін аудитін өткізіп, барлық курстық материалдарға, іс-шараларға, тесттер мен форумдарға толық қол жеткізіңіз. {b_start}назар аударыңыз, бұл жол өту балын алған студенттерге сертификат ұсынбайды.{b_end}

source: {chapter} current chapter
kk_kz: {chapter} қазіргі тарау

source: {span_start}current section{span_end}
kk_kz: {span_start}қазіргі бөлім {span_end}

source: due {date}
kk_kz: {date} дейін

source: {section_format} due {{date}}
kk_kz: {section_format} {{date}} дейін

source: This content is graded
kk_kz: Этот элемент курса проверен

source: An error occurred. Please try again later.
kk_kz: Қателік шықты. Кейінірек тағы бір рет талпыныңыз.

source: The currently logged-in user account does not have permission to enroll in this course. You may need to {start_logout_tag}log out{end_tag} then try the enroll button again. Please visit the {start_help_tag}help page{end_tag} for a possible solution.
kk_kz: У пользователя с текущей учётной записью недостаточно прав для записи на этот курс. Возможно, вам необходимо {start_logout_tag}выйти{end_tag} и ещё раз нажать на кнопку записи на курс. Для получения информации о возможных вариантах перейдите на {start_help_tag}страницу помощи{end_tag}.

source: You are enrolled in this course
kk_kz: Сіз осы курсқа жазылғансыз

source: View Course
kk_kz: Курсты қарау

source: This course is in your <a href="{cart_link}">cart</a>.
kk_kz: Этот курс в вашей <a href="{cart_link}">корзине</a>.

source: Course is full
kk_kz: Курсқа жиын аяқталды

source: Enrollment in this course is by invitation only
kk_kz: Бұл курсқа тіркелу тек шақыру бойынша жүзеге асырылады

source: Enrollment is Closed
kk_kz: Тіркеу жабық

source: Add {course_name} to Cart <span>({price} USD)</span>
kk_kz: Добавить курс {course_name} в корзину <span>({price} долларов США)</span>

source: Enroll in course
kk_kz: Записаться на курс

source: View About Page in studio
kk_kz: Studio Ақпараттық Бетті қарау

source: Classes Start
kk_kz: Оқу басталды

source: Classes End
kk_kz: Оқу аяқталды

source: Estimated Effort
kk_kz: Күрделілік бағасы

source: Prerequisites
kk_kz: Курсқа жазылу үшін қажетті шарттар

source: You must successfully complete {link_start}{prc_display}{link_end} before you begin this course.
kk_kz: Вы должны успешно окончить курс {link_start}{prc_display}{link_end} перед началом этого курса

source: Additional Resources
kk_kz: Қосымша ресурстар

# self
source: enroll
kk_kz: тіркел

source: Share with friends and family!
kk_kz: Отбасымен және достармен бөлісу!

source: I just enrolled in {number} {title} through {account}: {url}
kk_kz: Мен жай ғана {number} {title} {account}: {url} арқылы тіркелдім

source: Take a course with {platform} online
kk_kz: Онлайн {platform} курсын өту

source: I just enrolled in {number} {title} through {platform} {url}
kk_kz: Мен қазір ғана {number} {title} {platform} {url} арқылы тіркелдім

source: Tweet that you've enrolled in this course
kk_kz: Написать в Твиттер о том, что вы присоединились к этому курсу.

source: Post a Facebook message to say you've enrolled in this course
kk_kz: Поделиться новостью на Facebook о вашей записи на курс.

source: Email someone to say you've enrolled in this course
kk_kz: Сообщить по электронной почте, что вы записались на курс.

source: current location
kk_kz: қазіргі орналасқан жері

source: needs attention
kk_kz: назар аударыңыз

source: Course Material
kk_kz: Курс Материалдары

source: Hide
kk_kz: Жасыру

source: Show
kk_kz: Көрсету

source: Show Earlier Course Updates
kk_kz: Курстың Бұрынғы Жаңартуларын Көрсету

source: List of Courses
kk_kz: Курстар тізімі

source: Refine Your Search
kk_kz: Іздеуді Нақтылаңыз

source: {course_number} Courseware
kk_kz: {course_number} Курс бағдарламасы

source: Course Utilities
kk_kz: Курс утилиталары

source: Courseware
kk_kz: Курс бағдарламасы

source: Course Search
kk_kz: Курсты іздеу

source: No content has been added to this course
kk_kz: Бұл курсқа ешқандай контент қосылмаған

source: To access course materials, you must score {required_score}% or higher on this exam. Your current score is {current_score}%.
kk_kz: Курс материалдарына қол жеткізу үшін осы емтиханға {required_score}% немесе одан жоғары теру керек. Сіздің ағымдағы баллыңыз- {current_score}%.

source: Your score is {current_score}%. You have passed the entrance exam.
kk_kz: Сіздің ұпайыңыз {current_score} % - ға тең. Сіз түсу емтиханын тапсырдыңыз.

source: Gradebook
kk_kz: Бағалар журналы

source: Search students
kk_kz: Студенттерді іздеу

source: previous page
kk_kz: предыдущая страница

source: of
kk_kz: из

source: next page
kk_kz: Келесі бет

source: {course_number} Course Info
kk_kz: Курс туралы ақпарат {course_number}

source: You are not enrolled yet
kk_kz: Сіз әлі тіркелген жоқсыз

source: You are not currently enrolled in this course. {link_start}Enroll now!{link_end}
kk_kz: Қазіргі уақытта сіз бұл курсқа тіркелмегенсіз. {link_start}дәл қазір тіркеліңіз!{сілтеме}

source: Welcome to {org}'s {course_title}!
kk_kz: {Org} {course_title} - ге қош келдіңіз!

source: Welcome to {course_title}!
kk_kz: {Course_title} қош келдіңіз!

source: Resume Course
kk_kz: Курсты Жалғастыру

source: View Updates in Studio
kk_kz: Studio Жаңартуларды қарау

source: Course Updates and News
kk_kz: Курс жаңартулары және жаңалықтар

source: Handout Navigation
kk_kz: Көрнекті материалдар бойынша навигация

source: Course Tools
kk_kz: Курс құралдары

source: News - MITx 6.002x
kk_kz: Жаңалықтар - MITx 6.002x

source: Updates to Discussion Posts You Follow
kk_kz: Сіз қадағалайтын пікірталастардағы жаңа хабарлар

source: Purchase the Program (
kk_kz: Бағдарламаны сатып алыңыз (

source: Original Price
kk_kz: Бастапқы Баға

source: Discounted Price
kk_kz: Жеңілдікпен бағасы

source: Start Learning
kk_kz: Оқуды Бастаңыз

source: Play
kk_kz: Қалпына келтіру

source: YouTube Video
kk_kz: YouTube бейнесі

source: View Courses
kk_kz: Курстарды Қарау

source: Meet the Instructors
kk_kz: Оқытушылармен Танысу

source: Frequently Asked Questions
kk_kz: Жиі қойлатын сұрақтар

source: Job Outlook
kk_kz: Жұмыс Перспективалары

source: Real Career Impact
kk_kz: Мансапқа Нақты Әсер Ету

source: What You'll Learn
kk_kz: Сіз не үйренесіз

source: Average Length
kk_kz: Орташа Ұзындығы

source: {weeks_to_complete} weeks per course
kk_kz: курсқа {weeks_to_complete} апта

source: Effort
kk_kz: Күш-жігер

source: {min_hours_effort_per_week}-{max_hours_effort_per_week} hours per week, per course
kk_kz: курс үшін аптасына {min_hours_effort r_week}-{max_hours_effort_per_week} сағат

source: Number of Courses
kk_kz: Курстар саны

source: {number_of_courses} courses in program
kk_kz: бағдарлама бойынша {number_of_courses} курстар

source: Price (USD)
kk_kz: Бағасы (USD)

source: ${newPrice}{htmlEnd} for entire program
kk_kz: бүкіл бағдарлама үшін ${newPrice}{htmlEnd}

source: You save ${discount_value} {currency}
kk_kz: Сіз ${discount_value} {currency} үнемдейсіз

source: ${full_program_price} for entire program
kk_kz: бүкіл бағдарлама үшін ${full_program_price}

source: Courses in the {}
kk_kz: Курстар {}

source: Starts on {}
kk_kz: {}Басталады

source: {course_number} Progress
kk_kz: Алға басу{course_number}

source: View Grading in studio
kk_kz: Studio Бағаларды қарау

source: Course Progress for Student '{username}' ({email})
kk_kz: Достижения '{username}' ({email}) на курсе

source: View Certificate
kk_kz: Сертификатты қарау

source: Opens in a new browser window
kk_kz: Жаңа шолғыш терезесінде ашылады

source: Download Your Certificate
kk_kz: Сертификатты Жүктеп Алыңыз

source: Request Certificate
kk_kz: Сертификатты сұрату

source: Requirements for Course Credit
kk_kz: Курс бойынша есептерге қойылатын талаптар

source: {student_name}, you are no longer eligible for credit in this course.
kk_kz: {student_name}, сіз енді осы курста кредит алуға құқығыңыз жоқ.

source: {student_name}, you have met the requirements for credit in this course. {a_start}Go to your dashboard{a_end} to purchase course credit.
kk_kz: {student_name}, сіз осы курста кредит алу талаптарын орындадыңыз. {a_start}курсқа кредит алу үшін бақылау тақтасына өтіңіз{a_end}.

source: {student_name}, you have not yet met the requirements for credit.
kk_kz: {student_name}, сіз кредит алу талаптарын әлі орындаған жоқсыз.

source: Information about course credit requirements
kk_kz: Курстарға арналған кредиттерге қойылатын талаптар туралы ақпарат

source: display_name
kk_kz: дисплей атауы

source: Verification Submitted
kk_kz: Растау жіберілді

source: Verification Failed
kk_kz: Растау Сәтсіз Аяқталды

source: Verification Declined
kk_kz: Растау Қабылданбады

source: Completed by {date}
kk_kz: {date} күні аяқталған

source: Upcoming
kk_kz: Алдағы

source: Less
kk_kz: Аз

source: Details for each chapter
kk_kz: Подробности по каждому разделу

source: {earned} of {total} possible points
kk_kz: {earned} {total} мүмкін ұпайлар

source: Suspicious activity detected during proctored exam review. Exam score 0.
kk_kz: Қайта емтихан кезінде анықталған күдікті әрекет. Емтихан балы 0.

source: Section grade has been overridden.
kk_kz: Бөлім класы жойылды.

source: Problem Scores:
kk_kz: Баллы за решение:

source: Practice Scores:
kk_kz: Баллы за практику:

source: Problem scores are hidden until the due date.
kk_kz: Мәселелерді бағалау белгіленген мерзім аяқталғанға дейін жасырылады.

source: Practice scores are hidden until the due date.
kk_kz: Оқу нәтижелері мерзімі аяқталғанға дейін жасырылған

source: Problem scores are hidden.
kk_kz: Мәселелерді бағалау жасырын.

source: Practice scores are hidden.
kk_kz: Оқу нәтижелері жасырын.

source: No problem scores in this section
kk_kz: Осы бөлімде тапсырмалар үшін ұпайлар жоқ

source: {course.display_number_with_default} Course Info
kk_kz: {course.display_number_with_default} курс туралы ақпарат

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
kk_kz: Соңғы рет Сіз {section_link} бөлімде болдыңыз. Егер Сіз аяқтасаңыз сол жақтан басқа бөлімді таңдаңыз.

source: Hi {name},
kk_kz: Здравствуйте, {name}!

source: Hi,
kk_kz: Здравствуйте!

source: Congratulations! You are now eligible to receive course credit from {providers} for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
kk_kz: Құттықтаймын! Енді сіз курсты сәтті аяқтау үшін {providers}-ден {platform_name} курсына кредит алуға құқығыңыз бар! {link_start}дәл қазір сатып алуға арналған несие.{link_end}

source: Congratulations! You are now eligible to receive course credit for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
kk_kz: Құттықтаймын! Енді сіз курсты сәтті аяқтау үшін {platform_name} курсына кредит алуға құқығыңыз бар! {link_start}дәл қазір сатып алуға арналған кредит.{link_end}

source: Course credit can help you get a jump start on your university degree, finish a degree already started, or fulfill requirements at a different academic institution.
kk_kz: Курс бойынша тест сізге университетте оқуды бастауға, басталған дәрежені алуға немесе басқа оқу орнында талаптарды орындауға көмектеседі.

source: There are 2 steps to getting course credit.
kk_kz: Курсқа кредит алудың 2 қадамы бар.

source: Purchase credit by going to your {link_start}{platform_name} dashboard{link_end} and clicking the {bold_start}Get Credit{bold_end} button below the course title.
kk_kz: {link_start}{platform_name} {link_end} және {bold_start}курс атауымен кредит алыңыз{bold_end} түймесін басу арқылы кредит алыңыз.

source: When your payment is complete, return to the dashboard and click the {bold_start}Request Credit{bold_end} button under the course title to request an official academic transcript at the institution that granted the credit.
kk_kz: Төлем аяқталғаннан кейін бақылау тақтасына оралып,несие беретін оқу орнынан ресми академиялық жазбаны сұрау үшін курс атауы бойынша {bold_start}несие сұрау{bold_end} түймесін басыңыз.

source: We hope you enjoyed the course, and we hope to see you in future {platform_name} courses!
kk_kz: Сізге курс ұнады деп үміттенеміз және сізді болашақ курстарда көреміз деп үміттенеміз {platform_name}!

source: The {platform_name} Team
kk_kz: Команда {platform_name}

source: {link_start}Click here for more information on credit at {platform_name}{link_end}.
kk_kz: {link_start}Кредит туралы қосымша ақпарат алу үшін мына жерді басыңыз {platform_name}{link_end}.

source: Your final grade:
kk_kz: Ваша итоговая оценка:

source: Grade required for a {cert_name_short}:
kk_kz: {cert_name_short} алу үшін қажетті баға

source: Grade required to pass this course:
kk_kz: Осы курсты өту үшін қажетті баға:

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
kk_kz: Сіздің {cert_name_long} күту мәртебесінде, өйткені Сізге {cert_name_short} беру фактісі Иранға, Кубаға, Сирияға және Суданға қарсы АҚШ тыйым салу әрекетіне түсуі мүмкін. Егер біздің жүйе осы елдермен сіздің байланысыңызды сәйкестендірді деп ойласаңыз, бізбен {email} почта бойынша байланысыңыз. Егер сіздің {cert_name_long} ақшаны қайтарғыңыз келсе, біздің биллинг бөлімімен байланысыңыз {billing_email}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
kk_kz: Сіздің {cert_name_long} күту мәртебесінде, өйткені Сізге {cert_name_short} беру фактісі Иранға, Кубаға, Сирияға және Суданға қарсы АҚШ тыйым салу әрекетіне түсуі мүмкін. Егер біздің жүйе осы елдермен сіздің байланысыңызды сәйкестендірді деп ойласаңыз, бізбен {email} почта бойынша байланысыңыз.

source: Your certificate was not issued because you do not have a current verified identity with {platform_name}.
kk_kz: Сіздің сертификатыңыз берілмеген, өйткені сізде қазіргі расталған тұлға жоқ {platform_name}.

source: Verify your identity now.
kk_kz: Подтвердить свою личность.

source: Your {cert_name_short} is Generating
kk_kz: Сіздің {cert_name_short} өңдеу процесінде

source: This link will open the certificate web view
kk_kz: Осы сілтеме арқылы сертификаттың веб-көрінісі ашылады

source: View {cert_name_short}
kk_kz: Просмотреть {cert_name_short}

source: This link will open/download a PDF document
kk_kz: Эта ссылка откроет/скачает PDF-документ

source: Download {cert_name_short} (PDF)
kk_kz: Скачать {cert_name_short} (PDF)

source: Download Your {cert_name_short} (PDF)
kk_kz: Скачать ваш {cert_name_short} (PDF)

source: This link will open/download a PDF document of your verified {cert_name_long}.
kk_kz: Осы сілтеме бойынша сіз PDF форматында сіздің {cert_name_long} сертификатты аша/көшіріп жүктей аласыз.

source: Download Your ID Verified {cert_name_short} (PDF)
kk_kz: Скачать подтверждённый {cert_name_short} (PDF)

source: Complete our course feedback survey
kk_kz: Осы курс туралы пікір нысанын толтырыңыз

source: Add Certificate to LinkedIn Profile
kk_kz: LinkedIn профиліне сертификат қосу

source: Share on LinkedIn
kk_kz: LinkedIn-де бөлісіңіз

source: Since we did not have a valid set of verification photos from you when your {cert_name_long} was generated, we could not grant you a verified {cert_name_short}. An honor code {cert_name_short} has been granted instead.
kk_kz: Сіздің {cert_name_long} құрылған кезде, растау үшін сізден суреттің қолданыстағы жиынын біз алмағандықтан, біз сізге расталған {cert_name_short} ұсына алмаймыз. {cert_name_short} ар-намыс коды оның орнына генерацияланған болды.

source: Course details
kk_kz: Курстың егжей-тегжейлері

source: {course_number} {course_name} Home Page
kk_kz: {course_number} {course_name} Басты бет

source: {course_number} {course_name} Cover Image
kk_kz: {course_number} {course_name} мұқаба

source: Enrolled as:
kk_kz: Внесён в список как:

source: Coming Soon
kk_kz: Жақында

source: Ended - {date}
kk_kz: Аяқталған - {date}

source: Started - {date}
kk_kz: Курс начался: {date}

source: Starts - {date}
kk_kz: Бастайды -{date}

source: for {course_display_name}
kk_kz: {course_display_name} үшін

source: You must select a session by {expiration_date} to access the course.
kk_kz: Курсқа кіру үшін {expiration_date} сеансын таңдау керек.

source: You must select a session to access the course.
kk_kz: Курсқа кіру үшін сеансты таңдау керек.

source: Change or Leave Session
kk_kz: Сеансты өзгертіңіз немесе қалдырыңыз

source: You can no longer change sessions.
kk_kz: Енді сеанстарды өзгерту мүмкін емес.

source: You can change sessions until {entitlement_expiration_date}.
kk_kz: Сеанстарды осы уақытқа дейін өзгерте аласыз {entitlement_expiration_date}.

source: View Archived Course
kk_kz: Мұрағаттан курсты қарау

source: I'm taking {course_name} online with {facebook_brand}. Check it out!
kk_kz: Мен {course_name} онлайн режимінде {facebook_brand} аламын. Мұны бағалаңыз!

source: Share {course_name} on Facebook
kk_kz: Facebook-те {course_name} бөлісіңіз

source: Share on Facebook
kk_kz: Facebook-те бөлісіңіз

source: I'm taking {course_name} online with {twitter_brand}. Check it out!
kk_kz: Мен {course_name} интернетте {twitter_brand} арқылы аламын. Мұны бағалаңыз!

source: Share {course_name} on Twitter
kk_kz: Twitter-де {course_name} - мен бөлісіңіз

source: Course options for
kk_kz: Курстардың нұсқалары

source: Available Actions
kk_kz: Қол Жетімді Әрекеттер

source: Email Settings
kk_kz: e-mail бапталымдары

source: Related Programs
kk_kz: Байланысты Бағдарламалар

source: You can no longer access this course because payment has not yet been received. You can {contact_link_start}contact the account holder{contact_link_end} to request payment, or you can {unenroll_link_start}unenroll{unenroll_link_end} from this course
kk_kz: У вас нет доступа к этому курсу, так как оплата ещё не произведена. Вы можете {contact_link_start}связаться с владельцем счёта{contact_link_end}, чтобы запросить оплату, или вы можете {unenroll_link_start}отчислиться{unenroll_link_end} с этого курса

source: Verification not yet complete.
kk_kz: Проверка личности не завершена

source: You only have {days} day left to verify for this course.
kk_kz: Остался {days} день для подтверждения вашей личности на этом курсе.

source: Almost there!
kk_kz: Жақындап қалдыңыз!

source: You still need to verify for this course.
kk_kz: Бұл курс үшін әлі де растаудан өту керек.

source: Verify Now
kk_kz: Қазір растау

source: You have submitted your verification information.
kk_kz: Сіз растау ақпаратын жібердіңіз.

source: You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
kk_kz: По завершении проверки личности появится соответствующее сообщение на вашей панели управления (обычно это занимает 1-2 дня).

source: Your current verification will expire soon!
kk_kz: Ағымдағы тексерудің жарамдылық мерзімі жақында аяқталады!

source: You have submitted your reverification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
kk_kz: Ваши личные данные для повторного подтверждения отправлены. По завершении проверки на вашей панели управления появится соответствующее сообщение (обычно это занимает 1-2 дня).

source: You have successfully verified your ID with edX
kk_kz: Вы успешно подтвердили свою личность

source: Your current verification is effective until {date}.
kk_kz: Қазіргі растау {date} дейін жарамды.

source: Your current verification will expire soon.
kk_kz: Срок действия вашего подтверждения личности скоро истечёт!
