Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Enter true or false. If this value is true, a Zendesk ticket will be created for suspicious attempts.
kk_kz: Рас немесе жалған екенін енгізіңіз .Егер бұл мән рас болса, күдікті әрекеттер үшін Zendesk билеті жасалады.

source: Enable Timed Exams
kk_kz: Уақыты белгіленген Емтихандарды Қосыңыз

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
kk_kz: Рас немесе жалған екенін енгізіңіз .Егер бұл мән рас болса, курста уақытша емтихандар бар. Осы параметрге қарамастан, уақытша емтихандар қосылады, егер кейінге қалдырылған емтихандар параметрге шын мәнімен орнатылса.

source: Minimum Grade for Credit
kk_kz: Кредит үшін ең төменгі баға

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
kk_kz: Студент курста кредит алу үшін ең төменгі балл - ондық санмен 0,0-ден 1,0 арасы. Мысалы, 75% үшін 0,75 енгізіңіз.

source: Self Paced
kk_kz: Өзіндік Қарқын

source: Set this to "true" to mark this course as self-paced. Self-paced courses do not have due dates for assignments, and students can progress through the course at any rate before the course ends.
kk_kz: Осы курсты өзіндік қарқында деп белгілеу үшін "рас" мәнін орнатыңыз. Өзіндік қарқындағы курстарда тапсырмалардың мерзімі жоқ, студенттер кез-келген жағдайда курсты бітіргенге дейін аяқтай алады.

source: Bypass Course Home
kk_kz: Пропускать главную страницу курса

source: Bypass the course home tab when students arrive from the dashboard, sending them directly to course content.
kk_kz: При переходе слушателя из панели управления не показывать главную страницу курса, а перенаправлять сразу на содержимое курса.

source: Enable Subsection Prerequisites
kk_kz: Бөлімшенің алдын ала шарттарын қосу

source: Enter true or false. If this value is true, you can hide a subsection until learners earn a minimum score in another, prerequisite subsection.
kk_kz: Рас немесе жалған екенін енгізіңіз .Егер бұл мән рас болса, оқушылар басқа міндетті бөлімде ең төменгі балл алғанға дейін сіз бөлімді жасыра аласыз.

source: Course Learning Information
kk_kz: Курсты оқуға арналған ақпарат

source: Specify what student can learn from the course.
kk_kz: Укажите, что студент может узнать из курса

source: Course Visibility For Unenrolled Learners
kk_kz: Есепке Алынбаған Оқушыларға Арналған Курстың Көрнекілігі

source: Defines the access permissions for unenrolled learners. This can be set to one of three values: 'private' (default visibility, only allowed for enrolled students), 'public_outline' (allow access to course outline) and 'public' (allow access to both outline and course content).
kk_kz: Тіркелмеген оқушыларға кіруге рұқсатты анықтайды. Мұны үш мәннің біріне орнатуға болады: 'private' (әдепкі көріну, тек тіркелген студенттер үшін рұқсат етіледі), "public_outline" (курс контурына кіруге рұқсат беру) және 'publiс' (курстың контурына да, мазмұнына да кіруге рұқсат беру).

source: Course Instructor
kk_kz: Курс Оқытушысы

source: Enter the details for Course Instructor
kk_kz: Курс оқытушысы үшін деректерді енгізіңіз

source: Add Unsupported Problems and Tools
kk_kz: Қолдау көрсетілмейтін мәселелер мен құралдарды қосыңыз

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
kk_kz: Рас немесе жалған екенін көрсетіңіз. Егер рас болса, студиядағы курсқа қолдау көрсетілмейтін мәселелер мен құралдарды қосуға болады. Тестілеу, қол жетімділік, интернационализация және құжаттама сияқты бір немесе бірнеше негізгі талаптарға сәйкес келмеуіне байланысты курстарда қолдау көрсетілмейтін мәселелер мен құралдарды пайдалану ұсынылмайды.

source: Highlights Enabled for Messaging
kk_kz: Хабар алмасуға арналған маңызды сәттер

source: Enter true or false. If true, any highlights associated with content in the course will be messaged to learners at their scheduled time.
kk_kz: Рас немесе жалған екенін көрсетіңіз. Егер рас болса,курстың мазмұнына байланысты кез-келген маңызды сәттер студенттерге белгіленген уақытта жіберіледі.

source: Other Course Settings
kk_kz: Другие настройки курса

source: Any additional information about the course that the platform needs or that allows integration with external systems such as CRM software. Enter a dictionary of values in JSON format, such as { "my_custom_setting": "value", "other_setting": "value" }
kk_kz: Платформа қажет кез-келген курс туралы қосымша ақпарат немесе оны CRM бағдарламалық жасақтамасы сияқты сыртқы жүйелермен біріктіруге мүмкіндік береді. Мән сөздігін JSON форматында енгізіңіз, мысалы { "my_custom_setting": "value", "other_setting": "value" }

source: General
kk_kz: Жалпы

source: {assignment_type} = {weighted_percent:.2%} of a possible {weight:.2%}
kk_kz: {assignment_type} = {weighted_percent:.2%} мүмкіндігі {weight:.2%}

source: Generated
kk_kz: қалыптасқан

source: {section_type} {index} Unreleased - 0% (?/?)
kk_kz: {section_type} {index} Жарияланбаған - 0% (?/?)

source: The lowest {drop_count} {section_type} scores are dropped.
kk_kz: Ең төменгі ұпайлар {drop_count} {section_type} алынып тасталады.

source: {section_type} Average = {percent:.0%}
kk_kz: {section_type} Орташа мән ={percent:.0%}

source: {short_label} Avg
kk_kz: {short_label} Орт.

source: Text
kk_kz: Текст

source: Html contents to display for this module
kk_kz: Осы модульде көрсетілетін Html мазмұны

source: Source code for LaTeX documents. This feature is not well-supported.
kk_kz: LaTeX құжаттарының бастапқы коды. Бұл функцияға дұрыс қолдау көрсетілмейді.

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
kk_kz: Выберите «Визуальный редактор», чтобы вводимый текст автоматически преобразовывался редактором в HTML. Выберите «Без обработки» для непосредственного редактирования кода HTML. После изменения этой настройки вам следует сохранить компонент, а затем вновь открыть его для редактирования.

source: Editor
kk_kz: Редактор

source: Visual
kk_kz: Визуальный

source: Raw
kk_kz: Без обработки

source: Hide Page From Learners
kk_kz: Парақшаны Оқушылардан Жасыру

source: If you select this option, only course team members with the Staff or Admin role see this page.
kk_kz: Егер сіз осы параметрді таңдасаңыз, бұл парақшаны курс тобының мүшелері тек қызметкерлер немесе админ рөлімен көреді.

source: HTML for the additional pages
kk_kz: Қосымша беттер үшін HTML

source: List of course update items
kk_kz: Курсты жаңарту элементтерінің тізімі

source: Any Type
kk_kz: Кез-Келген түрі

source: Library
kk_kz: Кітапхана

source: Select the library from which you want to draw content.
kk_kz: Введите библиотеку, из которой вы хотите извлечь данные

source: Library Version
kk_kz: Кітапхана нұсқасы

source: Determines how content is drawn from the library
kk_kz: Кітапханадан контенттің қалай алынатынын анықтайды

source: Choose n at random
kk_kz: Кездейсоқ N таңдаңыз

source: Count
kk_kz: Есепте

source: Enter the number of components to display to each student.
kk_kz: Әр оқушыға көрсетілетін компоненттер санын енгізіңіз.

source: Problem Type
kk_kz: Мәселе түрі

source: Choose a problem type to fetch from the library. If "Any Type" is selected no filtering is applied.
kk_kz: Кітапханадан шығару үшін мәселенің түрін таңдаңыз. Егер "кез-келген түрі" таңдалса, фильтрлеу қолданылмайды.

source: This component is out of date. The library has new content.
kk_kz: Бұл компонент ескірген. Кітапханада жаңа контент пайда болды.

source: {refresh_icon} Update now.
kk_kz: {refresh_icon} Қазір жаңартыңыз.

source: Library is invalid, corrupt, or has been deleted.
kk_kz: Библиотека неисправна, повреждена или удалена

source: Edit Library List.
kk_kz: Кітапханалар тізімін өңдеңіз.

source: This course does not support content libraries. Contact your system administrator for more information.
kk_kz: Бұл курс мазмұн кітапханаларын қолдамайды. Қосымша ақпарат алу үшін жүйе әкімшісіне хабарласыңыз.

source: A library has not yet been selected.
kk_kz: Кітапхана әлі таңдалмаған.

source: Select a Library.
kk_kz: Кітапхананы таңдаңыз.

source: There are no matching problem types in the specified libraries.
kk_kz: Бұл кітапханаларда проблемаларға сәйкес түрлері жоқ.

source: Select another problem type.
kk_kz: Мәселенің басқа түрін таңдаңыз.

source: The specified library is configured to fetch {count} problem,
kk_kz: Указанная библиотека настроена возвращать {count} задание,

source: Edit the library configuration.
kk_kz: Кітапхана конфигурациясын өзгертіңіз.

source: Invalid Library
kk_kz: Жарамсыз кітапхана

source: No Library Selected
kk_kz: Кітапхана таңдалған жоқ

source: Library Display Name
kk_kz: Көрсетілетін Кітапхана атауы

source: Enter the names of the advanced components to use in your library.
kk_kz: Кітапханада қолданылатын қосымша компоненттердің аттарын енгізіңіз.

source: The display name for this component. Analytics reports may also use the display name to identify this component.
kk_kz: Осы компонент үшін көрсетілетін атау. Аналитикалық есептер сонымен қатар осы компонентті анықтау үшін көрсетілген атауды қолдана алады.

source: LTI ID
kk_kz: LTI ИДЕНТИФИКАТОРЫ

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
kk_kz: Введите идентификатор LTI для внешнего оператора LTI. Это значение должно совпадать с идентификатором LTI, введённым вами в настройках «Регистрационные данные LTI» на странице расширенных настроек. <br />См. {docs_anchor_open}the edX LTI documentation{anchor_close} для получения подробной информации.

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
kk_kz: Введите ссылку на внешнее средство обучения, которое запускает этот компонент. Эта настройка применяется только в случае, когда элементу «Скрыть внешнее приложение» присвоено значение «Нет».<br />См. {docs_anchor_open}документацию по edX LTI{anchor_close} для получения детальной информации об этой настройке.

source: Custom Parameters
kk_kz: Теңшелетін параметрлері

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
kk_kz: Добавить пару ключ/значение для любых пользовательских параметров, таких как страница, на которой должна открываться ваша электронная книга, или цвет фона для данного компонента.<br />См. {docs_anchor_open}документацию по edX LTI{anchor_close} для получения детальной информации об этой настройке.

source: Open in New Page
kk_kz: Жаңа парақшада ашу

source: Select True if you want students to click a link that opens the LTI tool in a new window. Select False if you want the LTI content to open in an IFrame in the current page. This setting is only used when Hide External Tool is set to False.
kk_kz: Выберите «Нет», если вы ходите, чтобы при активации ссылки инструмент LTI открывался в новом окне. Выберите «Нет» для открытия LTI в том же окне. Эта настройка может быть использована только в случае, если для опции «Скрыть внешние инструменты» установлено значение «Нет».

source: Scored
kk_kz: Жинады

source: Select True if this component will receive a numerical score from the external LTI system.
kk_kz: Выберите «Да», если этот компонент получит численную оценку из внешней LTI-системы

source: Weight
kk_kz: Салмақ

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
kk_kz: Осы компонент үшін мүмкін ұпай санын енгізіңіз. Әдепкі мәні-1,0. Бұл параметр бағалау параметрі үшін Рас мәні орнатылған жағдайда ғана қолданылады.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
kk_kz: Результат сохранён в xblock KVS -- опубликованный результат продублирован в django DB.

source: Comment as returned from grader, LTI2.0 spec
kk_kz: Грейдерден қайтарылған түсініктеме, LTI2.0 сипаттамасы

source: Hide External Tool
kk_kz: Сыртқы құралды жасыру

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
kk_kz: Егер сіз осы компонентті сыртқы құралды іске қосудың орнына сыртқы бағалау жүйесімен синхрондау үшін толтырғыш ретінде қолданғыңыз келсе, Рас мәнін таңдаңыз. Бұл опция іске қосу түймесін және осы компонент үшін кез-келген жақтауды жасырады.

source: Request user's username
kk_kz: Пайдаланушы атын сұрау

source: Select True to request the user's username.
kk_kz: Пайдаланушы атын сұрау үшін Рас мәнін таңдаңыз.

source: Request user's email
kk_kz: Запросить адрес электронной почты пользователя.

source: Select True to request the user's email address.
kk_kz: Пайдаланушының электрондық пошта мекенжайын сұрау үшін Рас мәнін таңдаңыз.

source: LTI Application Information
kk_kz: LTI қосымшасы туралы ақпарат

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
kk_kz: Үшінші тарап қолданбасының сипаттамасын енгізіңіз. Пайдаланушы атын және/немесе электрондық поштаны сұраған кезде, пайдаланушыларға олардың аты және/немесе электрондық поштасы үшінші тарап қолданбасына неге жіберілетіні туралы хабарлау үшін осы мәтін жолағын пайдаланыңыз.

source: Button Text
kk_kz: Түйме мәтіні

source: Enter the text on the button used to launch the third party application.
kk_kz: Үшінші тарап қолданбасын іске қосу үшін пайдаланылатын батырмаға мәтінді енгізіңіз.

source: Accept grades past deadline
kk_kz: Мерзімнен кейін бағалауды қабылдау

source: Select True to allow third party systems to post grades past the deadline.
kk_kz: Үшінші тарап жүйелеріне мерзім аяқталғаннан кейін бағаларды жариялауға рұқсат беру үшін True мәнін таңдаңыз.

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
kk_kz: Арнайы параметрді тану мүмкін болмады:{custom_parameter}. "x=y" жолды пайдалану ұсынылады.

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
kk_kz: LTI кілтін тану мүмкін болмады:{lti_passport}. "id:key:secret" жолды пайдалану ұсынылады.

source: Due Date
kk_kz: Мерзім

source: Enter the default date by which problems are due.
kk_kz: Мәселелер туындауы керек әдепкі күнді енгізіңіз.

source: If true, can be seen only by course staff, regardless of start date.
kk_kz: Егер бұл рас болса, оны басталу күніне қарамастан курс қызметкерлері ғана көре алады.

source: Enter the URL for the course data GIT repository.
kk_kz: Курс деректерінің git репозиторийінің URL мекенжайын енгізіңіз.

source: XQA Key
kk_kz: Xqa кілті

source: This setting is not currently supported.
kk_kz: Қазіргі уақытта бұл параметрге қолдау көрсетілмейді.

source: Enter the ids for the content groups this problem belongs to.
kk_kz: Осы мәселеге қатысты мазмұн топтарының идентификаторларын енгізіңіз.

source: Specify when the Show Answer button appears for each problem. Valid values are "always", "answered", "attempted", "closed", "finished", "past_due", "correct_or_past_due", and "never".
kk_kz: Укажите, когда под каждым заданием должна появляться кнопка «Показать ответ». Возможные значения: "always" – всегда, "answered" – после ввода ответа, "attempted" – после совершения попытки, "closed" – когда закончились попытки или после срока сдачи, "finished" – когда ответ верен, закончились попытки или срок сдачи, "past_due" – после срока сдачи, "correct_or_past_due" – когда ответ верен или после срока сдачи и "never" – никогда.

source: Specify when to show answer correctness and score to learners. Valid values are "always", "never", and "past_due".
kk_kz: Оқушыларға дұрыс жауап пен бағалауды қашан көрсету керектігін көрсетіңіз. Жарамды мәндер - "әрқашан", "ешқашан" және "мерзімі өткен".

source: Specify the default for how often variable values in a problem are randomized. This setting should be set to "never" unless you plan to provide a Python script to identify and randomize values in most of the problems in your course. Valid values are "always", "onreset", "never", and "per_student".
kk_kz: Тапсырмадағы айнымалы мәндер қаншалықты жиі рандомизацияланатынын әдепкі бойынша көрсетіңіз. Егер сіз Python сценарийін курсыңыздағы көптеген мәселелерде мәндерді анықтау және рандомизациялау үшін ұсынуды жоспарламасаңыз, бұл параметр "ешқашан" күйіне орнатылуы керек. Жарамды мәндер - "always", "onreset", "never" және "per_student".

source: Days Early for Beta Users
kk_kz: Бета пайдаланушылары үшін бірнеше күн бұрын

source: Enter the number of days before the start date that beta users can access the course.
kk_kz: Бета-пайдаланушылар курсқа қол жеткізе алатын басталу күніне дейінгі күндер санын енгізіңіз.

source: Static Asset Path
kk_kz: Активке статикалық жол

source: Enter the path to use for files on the Files & Uploads page. This value overrides the Studio default, c4x://.
kk_kz: Файлдар мен жүктеулер бетіндегі файлдардың жолын енгізіңіз. Бұл мән Studio әдепкі мәнін жоққа шығарады, c4x://.

source: Enable LaTeX Compiler
kk_kz: LaTeX компиляторын қосыңыз

source: Enter true or false. If true, you can use the LaTeX templates for HTML components and advanced Problem components.
kk_kz: Рас немесе жалған екенін енгізіңіз . Егер бұл рас болса, HTML компоненттері мен кеңейтілген проблемалық компоненттер үшін LaTeX шаблондарын пайдалануға болады.

source: Enter the maximum number of times a student can try to answer problems. By default, Maximum Attempts is set to null, meaning that students have an unlimited number of attempts for problems. You can override this course-wide setting for individual problems. However, if the course-wide setting is a specific number, you cannot set the Maximum Attempts for individual problems to unlimited.
kk_kz: Оқушы тапсырмаларға жауап беруге тырысатын уақыттың максималды санын енгізіңіз. Әдепкі бойынша, әрекеттің максималды саны нөлге тең, яғни студенттердің проблемаларды шешуге шексіз әрекеттері бар. Бұл параметрді жеке мәселелер үшін бүкіл курс үшін қайта анықтауға болады. Алайда, егер бүкіл курс үшін белгілі бір сан болса, сіз жеке тапсырмалар үшін шексіз әрекеттерді орната алмайсыз.

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use in this course for the specified duration. Do not share the API key with other courses. Notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
kk_kz: Орналастырылған MATLAB қызметіне кіру үшін MathWorks ұсынған API кілтін енгізіңіз. Бұл кілт көрсетілген мерзім ішінде осы курс аясында ерекше пайдалану үшін беріледі. API кілтін басқа курстармен бөліспеңіз. Егер сіз кілт ашылған немесе бұзылған деп ойласаңыз, MathWorks-қа дереу хабарлаңыз. Курстың кілтін алу немесе мәселе туралы хабарлау үшін хабарласыңыз moocsupport@mathworks.com

source: Group Configurations
kk_kz: Группы

source: Enter the configurations that govern how students are grouped together.
kk_kz: Оқушылардың қалай топтасатынын анықтайтын конфигурацияларды енгізіңіз.

source: Enable video caching system
kk_kz: Бейнені кэштеу жүйесін қосыңыз

source: Enter true or false. If true, video caching will be used for HTML5 videos.
kk_kz: Рас немесе жалған екенін енгізіңіз. Егер рас болса, онда бейнені кэштеу HTML5 бейнесі үшін қолданылады.

source: Enable video auto-advance
kk_kz: Автоматты бейне жарнамасын қосыңыз

source: Specify whether to show an auto-advance button in videos. If the student clicks it, when the last video in a unit finishes it will automatically move to the next unit and autoplay the first video.
kk_kz: Көрсетіңіз, жөн көрсету түймешігін автоматты жылжыту видео. Егер студент блоктағы соңғы бейне аяқталған кезде оны басса, ол автоматты түрде келесі блокқа өтіп, бірінші бейнені автоматты түрде ойнатады.

source: Video Pre-Roll
kk_kz: Бейнені алдын ала қарау

source: Identify a video, 5-10 seconds in length, to play before course videos. Enter the video ID from the Video Uploads page and one or more transcript files in the following format: {format}. For example, an entry for a video with two transcripts looks like this: {example}
kk_kz: Курс бейнесінің алдында ойнату үшін 5-10 секундтық бейнені анықтаңыз. Бейне жүктеу бетінен бейне идентификаторын және бір немесе бірнеше шифрлау файлдарын келесі форматта енгізіңіз: {format}. Мысалы, екі декодталған бейненің жазбасы келесідей: {example}

source: Show Reset Button for Problems
kk_kz: Мәселелер туындаған кезде ысыру батырмасын көрсету

source: Enter true or false. If true, problems in the course default to always displaying a 'Reset' button. You can override this in each problem's settings. All existing problems are affected when this course-wide setting is changed.
kk_kz: Рас немесе жалған екенін енгізіңіз. Егер рас болса, мәселелер әдепкі курста әрқашан "қалпына келтіру" батырмасы көрсетіледі. Мұны әр мәселенің параметрлерінде қайта анықтауға болады. Бұл параметрді бүкіл курс үшін өзгерткен кезде барлық проблемалар әсер етеді.

source: Enable Student Notes
kk_kz: Оқушылардың жазбаларын қосыңыз

source: Enter true or false. If true, students can use the Student Notes feature.
kk_kz: Рас немесе жалған екенін енгізіңіз. Егер рас болса, Оқушылар "студенттік жазбалар" функциясын қолдана алады.

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
kk_kz: Оқушылардың жазбалары курста көрінетінін көрсетеді. Сондай-ақ, студенттер өздерінің жазбаларын оқу құралында көрсете алады немесе жасыра алады.

source: Tag this module as part of an Entrance Exam section
kk_kz: Бұл модульді қабылдау емтихандары бөлімінің бөлігі ретінде белгілеңіз

source: Enter true or false. If true, answer submissions for problem modules will be considered in the Entrance Exam scoring/gating algorithm.
kk_kz: Рас немесе жалған екенін енгізіңіз. Егер рас болса,проблемалық модульдерге жауаптар қабылдау емтихандарының ұпайларын есептеу алгоритмінде қарастырылады.

source: Enrollment Track Groups
kk_kz: Тіркеуді бақылау топтары

source: Partition for segmenting users by enrollment track
kk_kz: Пайдаланушыларды тіркеу жолы бойынша сегментациялауға арналған бөлім

source: Whether this student has voted on the poll
kk_kz: Бұл студент сауалнамада дауыс беріп/бермегені

source: Student answer
kk_kz: Студент жауабы

source: Poll answers from all students
kk_kz: Барлық студенттердің сауалнамасына жауаптар

source: Poll answers from xml
kk_kz: XML сауалнамаларына жауаптар

source: Poll question
kk_kz: Сауалнама сұрағы

source: Enter the date by which problems are due.
kk_kz: Мәселелер туындауы керек күнді енгізіңіз.

source: Hide sequence content After Due Date
kk_kz: Белгіленген күннен кейін контент реттілігін жасыру
