Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Pre-Requisite Course key if this course has a pre-requisite course
kk_kz: Егер бұл курста міндетті курс болса, міндетті курстың кілті

source: Grading policy definition for this class
kk_kz: Осы сынып үшін бағалау саясатын анықтау

source: Show Calculator
kk_kz: Калькуляторды Көрсету

source: Enter true or false. When true, students can see the calculator in the course.
kk_kz: "рас" немесе "жалған" екенін енгізіңіз. Дұрыс болған кезде студенттер курста калькуляторды көре алады.

source: Enter the name of the course as it should appear in the edX.org course list.
kk_kz: Введите название курса, которое будет отображаться в списке курсов на edX.org.

source: Course Display Name
kk_kz: Көрсетілген курс атауы

source: Course Editor
kk_kz: Курс редакторы

source: Enter the method by which this course is edited ("XML" or "Studio").
kk_kz: Осы курс өңделетін әдісті енгізіңіз ("XML" немесе "Studio").

source: Course Survey URL
kk_kz: Курс сауалнамасының URL мекенжайы

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
kk_kz: Курстың соңында сауалнама үшін URL мекенжайын енгізіңіз. Егер сіздің курста сауалнама болмаса, null теріңіз.

source: Discussion Blackout Dates
kk_kz: Электр Қуатын Өшіру Күнін Талқылау

source: Enter pairs of dates between which students cannot post to discussion forums. Inside the provided brackets, enter an additional set of square brackets surrounding each pair of dates you add. Format each pair of dates as ["YYYY-MM-DD", "YYYY-MM-DD"]. To specify times as well as dates, format each pair as ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. Be sure to include the "T" between the date and time. For example, an entry defining two blackout periods looks like this, including the outer pair of square brackets: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]
kk_kz: Введите пары дат, между которыми слушатели не смогут отправлять сообщения в обсуждениях. Каждая пара должна быть в формате ["ГГГГ-ММ-ДД", "ГГГГ-ММ-ДД"]. Чтобы указать конкретное время вместе с датами, пары должны иметь формат ["ГГГГ-ММ-ДДTЧЧ:ММ", "ГГГГ-ММ-ДДTЧЧ:ММ"]. Обязательно включите английскую букву «T» между датой и временем. Например, чтобы задать два периода блокировки обсуждений, введите в квадратных скобках: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]

source: Discussion Topic Mapping
kk_kz: Талқылау тақырыптарын салыстыру

source: Enter discussion categories in the following format: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. For example, one discussion category may be "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. The "id" value for each category must be unique. In "id" values, the only special characters that are supported are underscore, hyphen, and period. You can also specify a category as the default for new posts in the Discussion page by setting its "default" attribute to true. For example, "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.
kk_kz: Талқылау санаттарын келесі форматта енгізіңіз: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. Мысалы, талқылау санаттарының бірі "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. Әр санат үшін "идентификатор" мәні ерекше болуы керек. "Идентификатор" мәндерінде тек астын сызудың, сызықшаның және нүктенің арнайы таңбалары қолданылады. Сондай-ақ, талқылау бетіндегі жаңа хабарламалардың әдепкі санатын оның "әдепкі" төлсипаты үшін шын мәнін орнату арқылы көрсетуге болады. Мысалы, "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.

source: Discussion Sorting Alphabetical
kk_kz: Талқылауды Алфавит Бойынша Сұрыптау

source: Enter true or false. If true, discussion categories and subcategories are sorted alphabetically. If false, they are sorted chronologically by creation date and time.
kk_kz: "рас" немесе "жалған" екенін енгізіңіз. Егер бұл дұрыс болса, талқылаудың санаттары мен ішкі санаттары алфавиттік ретпен сұрыпталады. Егер мән жалған болса, олар жасалған күні мен уақыты бойынша хронологиялық ретпен сұрыпталады.

source: Course Announcement Date
kk_kz: Курстың Жарияланған Күні

source: Enter the date to announce your course.
kk_kz: Курстың жарияланатын күнін енгізіңіз.

source: Cohort Configuration
kk_kz: Когорт конфигурациясы

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
kk_kz: Когорт функциясын қосу, оқушылардың топтарға автоматты түрде бөлінуін анықтау немесе бүкіл курс бойынша талқыланатын кез-келген тақырыпты когорт мүшелері үшін жеке деп анықтау үшін саясат кілттері мен мәндерін енгізіңіз.

source: Course Is New
kk_kz: Жаңа курс

source: Enter true or false. If true, the course appears in the list of new courses on edx.org, and a New! badge temporarily appears next to the course image.
kk_kz: Введите true или false. Если введено значение true, курс отображается в списке новых курсов, а рядом с изображением курса временно появляется метка «Новый!»

source: Mobile Course Available
kk_kz: Мобильді Курс Қол Жетімді

source: Enter true or false. If true, the course will be available to mobile devices.
kk_kz: "рас" немесе "жалған" екенін енгізіңіз. If true, the course will be available to mobile devices.

source: Video Upload Credentials
kk_kz: Бейнелерді жүктеу үшін тіркелгі деректері

source: Enter the unique identifier for your course's video files provided by edX.
kk_kz: Введите уникальный идентификатор видеофайлов вашего курса, предоставленный edX.

source: Course Not Graded
kk_kz: Курс Бағаланбаған

source: Enter true or false. If true, the course will not be graded.
kk_kz: "рас" немесе "жалған" екенін енгізіңіз. Егер бұл рас болса, онда курс бағаланбайды.

source: Disable Progress Graph
kk_kz: Прогресс Кестесін Өшіріңіз

source: Enter true or false. If true, students cannot view the progress graph.
kk_kz: "рас" немесе "жалған" екенін енгізіңіз. Егер бұл дұрыс болса, студенттер прогресс кестесін көре алмайды.

source: PDF Textbooks
kk_kz: Pdf форматындағы оқулықтар

source: List of dictionaries containing pdf_textbook configuration
kk_kz: Pdf_textbook конфигурациясы бар сөздіктер тізімі

source: HTML Textbooks
kk_kz: HTML оқулықтары

source: For HTML textbooks that appear as separate tabs in the course, enter the name of the tab (usually the title of the book) as well as the URLs and titles of each chapter in the book.
kk_kz: Курста жеке қойындылар ретінде көрсетілетін HTML оқулықтары үшін қойынды атауын (әдетте кітап атауы), сондай-ақ кітаптағы әр тараудың URL мекен-жайы мен атауын енгізіңіз.

source: Remote Gradebook
kk_kz: Қашықтықтан сынақ кітапшасы

source: Enter the remote gradebook mapping. Only use this setting when REMOTE_GRADEBOOK_URL has been specified.
kk_kz: Қашықтағы сынақ кітапшасының көрсетілуін енгізіңіз. REMOTE_GRADEBOOK_URL параметрі көрсетілген жағдайда ғана осы параметрді пайдаланыңыз.

source: Enable CCX
kk_kz: CCX іске қосу

source: Allow course instructors to assign CCX Coach roles, and allow coaches to manage Custom Courses on edX. When false, Custom Courses cannot be created, but existing Custom Courses will be preserved.
kk_kz: Разрешите преподавателям назначать тьюторов и предоставьте последним право заведовать индивидуальными курсами в системе. Если указать значение false, это не повлияет на уже сформированные индивидуальные курсы, но создавать новые будет нельзя.

source: CCX Connector URL
kk_kz: CCX коннекторының URL мекенжайы

source: URL for CCX Connector application for managing creation of CCXs. (optional). Ignored unless 'Enable CCX' is set to 'true'.
kk_kz: CCX құруды басқаруға арналған CCX Connector қосымшасының URL мекенжайы. (міндетті түрде емес). Егер "CCX қосу" опциясы "рас"күйіне орнатылмаған болса, ол еленбейді.

source: Allow Anonymous Discussion Posts
kk_kz: Анонимді Хабарламаларды Талқылауға Рұқсат Етіңіз

source: Enter true or false. If true, students can create discussion posts that are anonymous to all users.
kk_kz: "Рас" немесе "Жалған" екенін енгізіңіз. Егер бұл дұрыс болса, студенттер барлық пайдаланушылар үшін анонимді болып табылатын талқылау хабарламаларын жасай алады.

source: Allow Anonymous Discussion Posts to Peers
kk_kz: Әріптестерге талқылау үшін анонимді хабарламаларға рұқсат беру

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
kk_kz: "Рас" немесе "Жалған" екенін енгізіңіз.Егер бұл рас болса, студенттер басқа студенттер үшін анонимді болып табылатын талқылау хабарламаларын жасай алады. Бұл параметр курс қызметкерлеріне анонимді хабарлама жібермейді.

source: Advanced Module List
kk_kz: Модульдердің кеңейтілген тізімі

source: Enter the names of the advanced modules to use in your course.
kk_kz: Курста қолданылатын қосымша модульдердің аттарын енгізіңіз.

source: Course Home Sidebar Name
kk_kz: Бүйірлік тақтаның атауы "курстың негізгі беті"

source: Enter the heading that you want students to see above your course handouts on the Course Home page. Your course handouts appear in the right panel of the page.
kk_kz: Курстың басты бетінде студенттерге курстың үлестірмелерінің үстінен көргіңіз келетін тақырыпты енгізіңіз. Сіздің бағам бойынша үлестірме материалдар беттің оң жақ панелінде көрсетіледі.

source: Course Handouts
kk_kz: Курстың көрнекті материалдары

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
kk_kz: Дұрыс, егер уақыт белдеулері курс күндерінде көрсетілуі керек болса. Due_date_display_format пайдасына ескірген.

source: Due Date Display Format
kk_kz: Орындалу Күнін Көрсету Пішімі

source: Enter the format for due dates. The default is Mon DD, YYYY. Enter "%m-%d-%Y" for MM-DD-YYYY, "%d-%m-%Y" for DD-MM-YYYY, "%Y-%m-%d" for YYYY-MM-DD, or "%Y-%d-%m" for YYYY-DD-MM.
kk_kz: Введите формат даты для указания сроков сдачи. По умолчанию используется американский стандарт. Введите "%d-%m-%Y" для перехода на русский.

source: External Login Domain
kk_kz: Кіруге Арналған Сыртқы Домен

source: Enter the external login method students can use for the course.
kk_kz: Введите название метода внешней аутентификации, которым могут воспользоваться слушатели курса

source: Certificates Downloadable Before End
kk_kz: Аяқталғанға Дейін Жүктелетін Сертификаттар

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
kk_kz: Рас неиесе жалған екенін енгізіңіз.Егер бұл рас болса, студенттер сертификаттарға қойылатын талаптарды орындаған жағдайда сертификаттарды курс аяқталғанға дейін жүктей алады.

source: Certificates Display Behavior
kk_kz: Сертификаттарды көрсету тәртібі

source: Enter end, early_with_info, or early_no_info. After certificate generation, students who passed see a link to their certificates on the dashboard and students who did not pass see information about the grading configuration. The default is end, which displays this certificate information to all students after the course end date. To display this certificate information to all students as soon as certificates are generated, enter early_with_info. To display only the links to passing students as soon as certificates are generated, enter early_no_info.
kk_kz: Введите одно из значений: end, early_with_info или early_no_info. После создания сертификатов слушатели, успешно прошедшие курс, увидят ссылку на сертификат на панели управления, а слушатели, набравшие недостаточное количество баллов, увидят информацию об оценке. По умолчанию установлено значение end – сертификаты будут доступны только после даты окончания курса. Чтобы показать информацию о сертификатах сразу после их создания, введите early_with_info. Чтобы показать ссылки на сертификаты заранее только тем, кто успешно прошёл курс, введите early_no_info.

source: Course About Page Image
kk_kz: Изображение для страницы «О курсе»

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
kk_kz: Курс кескінінің файл атауын өзгертіңіз. Сіз бұл файлды файлдар мен жүктеулер бетіне жүктеуіңіз керек. Сондай-ақ, курс кескінін параметрлер мен мәліметтер бетінде теңшеуге болады.

source: Course Banner Image
kk_kz: Курс баннер бейнесі

source: Edit the name of the banner image file. You can set the banner image on the Settings & Details page.
kk_kz: Баннер кескінінің файл атауын өзгертіңіз. Баннердің суретін параметрлер мен мәліметтер бетінде теңшеуге болады.

source: Course Video Thumbnail Image
kk_kz: Курстың қысқартылған бейне суреті

source: Edit the name of the video thumbnail image file. You can set the video thumbnail image on the Settings & Details page.
kk_kz: Бейне нобай файлының атын өзгертіңіз. Кішірейтілген бейне кескінін параметрлер мен мәліметтер бетіне орнатуға болады.

source: Issue Open Badges
kk_kz: Ашық Бейдждерді Шығару

source: Issue Open Badges badges for this course. Badges are generated when certificates are created.
kk_kz: Осы курс үшін ашық белгішелерді беріңіз. Сертификаттар жасалған кезде белгішелер жасалады.

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the short name of the type of certificate that students receive when they complete the course. For instance, "Certificate".
kk_kz: Бұл параметрді тек PDF сертификаттарын жасау кезінде пайдаланыңыз. Тырнақшалар арасында студенттер курсты аяқтағаннан кейін алған сертификат түрінің қысқаша атауын енгізіңіз. Мысалы, "Сертификат".

source: Certificate Name (Short)
kk_kz: Сертификат атауы (қысқаша)

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the long name of the type of certificate that students receive when they complete the course. For instance, "Certificate of Achievement".
kk_kz: Бұл параметрді тек PDF сертификаттарын жасау кезінде пайдаланыңыз. Тырнақшалар арасында студенттер курсты аяқтағаннан кейін алған сертификат түрінің ұзақ атауын енгізіңіз. Мысалы, "Жетістігі жайлы Сертификат".

source: Certificate Name (Long)
kk_kz: Сертификат атауы (ұзын)

source: Certificate Web/HTML View Enabled
kk_kz: Сертификаттардың веб / HTML көрінісі қосылған

source: If true, certificate Web/HTML views are enabled for the course.
kk_kz: Егер мән шын болса, курс үшін веб-сертификаттар/HTML көріністері бар.

source: Certificate Web/HTML View Overrides
kk_kz: Сертификат / HTML веб-көрінісін қайта анықтау

source: Enter course-specific overrides for the Web/HTML template parameters here (JSON format)
kk_kz: Веб/HTML шаблонының параметрлері үшін нақты курстардың алдын-ала анықтауларын мына жерге енгізіңіз (JSON пішімі).

source: Certificate Configuration
kk_kz: Сертификат конфигурациясы

source: Enter course-specific configuration information here (JSON format)
kk_kz: Введите информацию о настройках данного курса (в формате JSON)

source: CSS Class for Course Reruns
kk_kz: Курсты қайта бастауға арналған CSS класы

source: Allows courses to share the same css class across runs even if they have different numbers.
kk_kz: Курстарға әр түрлі нөмірлер болса да, әр түрлі іске қосу үшін бірдей css класын бөлісуге мүмкіндік береді.

source: Discussion Forum External Link
kk_kz: Пікірталас форумына сыртқы сілтеме

source: Allows specification of an external link to replace discussion forums.
kk_kz: Пікірталас форумдарын ауыстыру үшін сыртқы сілтемені көрсетуге мүмкіндік береді.

source: Hide Progress Tab
kk_kz: Скрыть страницу «Прогресс»

source: Allows hiding of the progress tab.
kk_kz: "Прогресс" қойындысын жасыруға мүмкіндік береді.

source: Course Organization Display String
kk_kz: Курсты ұйымдастыруды көрсету жолы

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
kk_kz: Курсқа қосқыңыз келетін курс ұйымын енгізіңіз. Бұл параметр курсты құру кезінде көрсетілген ұйымды қайта анықтайды. Курсты құру кезінде көрсетілген ұйымды пайдалану үшін null мәнін енгізіңіз.

source: Course Number Display String
kk_kz: Курс нөмірін көрсету жолы

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
kk_kz: Курсқа қосқыңыз келетін курс нөмірін енгізіңіз. Бұл параметр курсты құру кезінде енгізген курс нөмірін қайта анықтайды. Курсты құру кезінде енгізген курс нөмірін пайдалану үшін null теріңіз.

source: Course Maximum Student Enrollment
kk_kz: Курсқа студенттерді барынша қабылдау

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
kk_kz: Курсқа жазыла алатын студенттердің ең көп санын енгізіңіз. Шексіз студенттерге рұқсат беру үшін null теріңіз.

source: Allow Public Wiki Access
kk_kz: Викиге Көпшілікке Қол Жеткізуге Рұқсат Етіңіз

source: Enter true or false. If true, edX users can view the course wiki even if they're not enrolled in the course.
kk_kz: Введите true или false. Если введено значение true, все зарегистрированные пользователи получат доступ к вики курса, даже если они не записаны на курс.

source: Invitation Only
kk_kz: Тек Шақыру Бойынша

source: Whether to restrict enrollment to invitation by the course staff.
kk_kz: Курс қызметкерлерін шақырумен тіркеуді шектеу керек болса

source: Pre-Course Survey Name
kk_kz: Курс алды сауалнаманың атауы

source: Name of SurveyForm to display as a pre-course survey to the user.
kk_kz: Пайдаланушыға алдын-ала сауалнама ретінде көрсету үшін сауалнама формасының атауы.

source: Pre-Course Survey Required
kk_kz: Курс алды сауалнама қажет

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
kk_kz: Оқушылар курсыңыздың мазмұнын көрместен бұрын сауалнама толтыруы қажет болса, оны осында көрсетіңіз. Егер сіз бұл мәнді рас күйіне орнатсаңыз, жоғарыдағы курс сауалнамасы параметріне сауалнама атауын қосу керек.

source: Course Visibility In Catalog
kk_kz: Каталогтағы Курстың Көрінуі

source: Defines the access permissions for showing the course in the course catalog. This can be set to one of three values: 'both' (show in catalog and allow access to about page), 'about' (only allow access to about page), 'none' (do not show in catalog and do not allow access to an about page).
kk_kz: Курс каталогында курсты көрсету үшін қол жеткізу құқығын анықтайды. Мұны үш мәннің біріне орнатуға болады: екеуі де (каталогта көрсету және бағдарлама туралы параққа кіруге рұқсат беру), бағдарлама туралы (тек бағдарлама туралы параққа кіруге рұқсат беру), жоқ(каталогта көрсетілмеу және бағдарлама туралы параққа кіруге рұқсат бермеу).

source: Both
kk_kz: Выбрать оба

source: About
kk_kz: О нас

source: None
kk_kz: Жоқ

source: Entrance Exam Enabled
kk_kz: Қабылдау емтиханы енгізілген

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
kk_kz: Көрсетіңіз, қандай студенттер тапсыратын емтиханы бұрын олар мазмұнды көре сіздің курс. Курстың осы параметрінің күшіне енуі үшін қабылдау емтихандарын қосу керек екенін ескеріңіз.

source: Entrance Exam Minimum Score (%)
kk_kz: Түсу емтиханының ең төменгі балы (%)

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
kk_kz: Студенттер сіздің курстың мазмұнын көре алмас бұрын, түсу емтиханының ең төменгі пайыздық балын көрсетіңіз. Курстың осы параметрінің күшіне енуі үшін қабылдау емтихандарын қосу керек екенін ескеріңіз.

source: Entrance Exam ID
kk_kz: Қабылдау емтиханына қатысушының куәлігі

source: Content module identifier (location) of entrance exam.
kk_kz: Қабылдау емтиханының мазмұнының модулінің идентификаторы (орналасқан жері).

source: Social Media Sharing URL
kk_kz: Әлеуметтік медиа бөлісу URL

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
kk_kz: Егер бақылау тақтасында әлеуметтік медианы бөлісу және курстардың жеке URL мекен-жайы қосылған болса, сіз әлеуметтік медиа сайттары сілтеме жасай алатын URL мекенжайын (мысалы, курс бетінің URL мекен-жайы) көрсете аласыз. URL мекенжайлары толығымен толтырылуы керек. Мысалы: http://www.edx.org/course/Introduction-to-MOOCs-ITM001

source: Course Language
kk_kz: Курс тілі

source: Specify the language of your course.
kk_kz: Курстың тілін көрсетіңіз.

source: Teams Configuration
kk_kz: Команда конфигурациясы

source: Specify the maximum team size and topics for teams inside the provided set of curly braces. Make sure that you enclose all of the sets of topic values within a set of square brackets, with a comma after the closing curly brace for each topic, and another comma after the closing square brackets. For example, to specify that teams should have a maximum of 5 participants and provide a list of 2 topics, enter the configuration in this format: {example_format}. In "id" values, the only supported special characters are underscore, hyphen, and period.
kk_kz: Укажите максимальный размер команды и темы для команд внутри фигурных скобок. Убедитесь, что вы заключили наборы тем в квадратные скобки, через запятую после закрывающей фигурной скобки для каждой темы, и другой запятой после закрытия квадратных скобок. Например, чтобы указать, что команды должны иметь максимум 5 участников и представить список из 2 тем, введите конфигурацию в следующем формате: {example_format}. В значениях "id", помимо букв и цифр латинского алфавита поддерживается символы подчёркивания, дефис и точка.

source: Enable Proctored Exams
kk_kz: Кейінге қалдырылған емтихандарды қосу

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
kk_kz: Рас немесе жалған екенін енгізіңіз . Егер бұл мән шын болса, сіздің курсыңызда кешіктірілген емтихандар бар. Кейінге қалдырылған емтихандарды қосу уақыт емтихандарын өткізуге мүмкіндік беретініне назар аударыңыз.

source: Allow Opting Out of Proctored Exams
kk_kz: Кейінге қалдырылған емтихандардан бас тартуға рұқсат беру

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
kk_kz: Рас немесе жалған екенін енгізіңіз .Егер бұл мән рас болса, студенттер проректормен емтихан тапсыруды проректорсыз таңдай алады. Егер бұл мән жалған болса, барлық студенттер емтихан тапсыруы керек. Бұл параметр курс үшін кейінге қалдырылған емтихандар қосылған жағдайда ғана қолданылады.

source: Create Zendesk Tickets For Suspicious Proctored Exam Attempts
kk_kz: Создавать тикеты техподдержки в Zendesk для подозрительных попыток сдачи наблюдаемых экзаменов.
