Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Processing your account information
kk_kz: Обработка данных вашей учётной записи…

source: Please log in
kk_kz: Жүйеге кіруіңізді өтінеміз

source: to access your account and courses
kk_kz: чтобы получить доступ к своей учётной записи и курсам

source: We're Sorry, {platform_name} accounts are unavailable currently
kk_kz: Приносим извинения, учётные записи {platform_name} в данный момент недоступны

source: We couldn't log you in.
kk_kz: Не удалось войти в систему.

source: Your email or password is incorrect
kk_kz: Электронный адрес или пароль введены неправильно

source: An error occurred when signing you in to {platform_name}.
kk_kz: Произошла ошибка при входе в {platform_name}.

source: Please provide the following information to log into your {platform_name} account. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
kk_kz: Укажите следующую информацию для доступа к вашей учётной записи {platform_name}. Обязательные поля отмечены <strong class="indicator">жирным текстом и звёздочкой (*)</strong>.

source: Account Preferences
kk_kz: Настройки учётной записи

source: Sign in with {provider_name}
kk_kz: {provider_name} көмегімен жүйеге кіру

source: External resource
kk_kz: Сыртқы көз

source: {points} / {total_points} points
kk_kz: {points} / {total_points} нүктелер

source: {total_points} points possible
kk_kz: мүмкін ұпай саны {total_points}

source: View resource in a new window
kk_kz: Жаңа терезеде қарау

source: Please provide launch_url. Click "Edit", and fill in the required fields.
kk_kz: launch_url ұсыныңыз. \"Редакциялауды\" басыңыз және қажетті алаптарды толтырыңыз.

source: Feedback on your work from the grader:
kk_kz: Сынып жұмысынан кері байланыс:

source: Press to Launch
kk_kz: Іске қосуды басыңыз

source: Manage student accounts
kk_kz: Студент аккаунтын басқару

source: Username:
kk_kz: Пайдаланушының аты:

source: Profile:
kk_kz: Профиль:

source: Image:
kk_kz: сурет:

source: Name:
kk_kz: Аты:

source: Choose an action:
kk_kz: Әрекетті таңдап алу:

source: View Profile
kk_kz: Профилді қарау

source: Disable Account
kk_kz: Есептік жазбаны пайдалануға тыйым салу

source: Reenable Account
kk_kz: Аккаунтты белсендендіру

source: Remove Profile Image
kk_kz: Профиль суретін өшіру

source: Students whose accounts have been disabled
kk_kz: Есептік жазбалары бұғатталған студенттер. Жаңарту үшін бетті қайта жүктеңіз.

source: (reload your page to refresh)
kk_kz: (перезагрузите страницу для обновления)

source: working
kk_kz: орындау...

source: There has been an error on the {platform_name} servers
kk_kz: {platform_name} серверлеріндегі қателік

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
kk_kz: К сожалению, этот модуль временно недоступен. Наши сотрудники работают над устранением проблемы. Пожалуйста, отправьте нам сообщение на адрес {tech_support_email}, чтобы сообщить о возникших проблемах или неполадках.

source: Raw data:
kk_kz: Өңделмеген деректер:

source: You do not have any notes.
kk_kz: У вас нет заметок.

source: Course View
kk_kz: Курсты қарау

source: View this course as:
kk_kz: Бұл курсты келесідей қарастырыңыз:

source: Learner
kk_kz: Оқушы

source: Specific learner
kk_kz: Нақты оқушы

source: Learner in {content_group}
kk_kz: {content_group}-да оқушы

source: Username or email:
kk_kz: Имя пользователя или адрес электронной почты

source: Set preview mode
kk_kz: Алдын ала қарау режимін орнатыңыз

source: You are now viewing the course as {i_start}{user_name}{i_end}.
kk_kz: Енді сіз курсты келесідей қарастырасыз {i_start}{user_name}{i_end}.

source: You have used {num_used} of {num_total} attempt
kk_kz: Вы использовали {num_used} из {num_total} попытки

source: Some problems have options such as save, reset, hints, or show answer. These options follow the Submit button.
kk_kz: Кейбір мәселелерде сақтау, қалпына келтіру, шақыру немесе жауапты көрсету сияқты опциялар бар. Бұл параметрлер жіберу батырмасына сәйкес келеді.

source: Hint
kk_kz: Кеңес

source: Save
kk_kz: Сақтау

source: Save your answer
kk_kz: Жауабыңызды сақтаңыз

source: Reset your answer
kk_kz: Жауабыңызды қалпына келтіріңіз

source: Next Hint
kk_kz: Келесі Кеңес

source: Review
kk_kz: Қарау

source: Log In
kk_kz: Кіру

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
kk_kz: Сіздің пайдаланушы атыңыз, электрондық мекенжайыңыз және толық атыңыз {destination} жіберілетін болады, мұнда егжей-тегжейлі ақпаратты жинау және пайдалану қызметтерді ұсынудың олардың жеке шарттарымен және құпиялылық саясатымен реттелетін болады.

source: Return To %s
kk_kz: %s қайту

source: We're sorry, but this version of your browser is not supported. Try again using a different browser or a newer version of your browser.
kk_kz: Кешіріңіз, бірақ сіздің браузеріңіздің бұл нұсқасына қолдау көрсетілмейді. Басқа браузерді немесе браузердің жаңа нұсқасын пайдаланып әрекетті қайталаңыз.

source: The following errors occurred while processing your registration:
kk_kz: Сіздің тіркеуге арналған өтініміңізді өңдеу уақытында мынадай қателіктер пайда болды:

source: Sign up with {provider_name}
kk_kz: {provider_name} көмегімен жүйеге кіру

source: Create your own {platform_name} account below
kk_kz: Өзіңіздің жеке аккаунтыңызды құру {platform_name}

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
kk_kz: Толтыру үшін міндетті алаптар қара жалпақ мәтінмен <strong class="indicator"> және (*)</strong> жұлдызшамен белгіленген.

source: You've successfully signed in with {selected_provider}.
kk_kz: Вы успешно вошли с помощью {selected_provider}.

source: We just need a little more information before you start learning with {platform_name}.
kk_kz: {platform_name} сіз оқыту бастамас бұрын, бізге сәл қосымша ақпарат қажет

source: Please complete the following fields to register for an account.
kk_kz: Пожалуйста, заполните следующие поля для регистрации нового пользователя.

source: Your legal name, used for any certificates you earn.
kk_kz: Сіздің заңды атауыңыз қандай да бір табыс тапқаныңызда куәлік үшін пайдаланылады

source: Will be shown in any discussions or forums you participate in
kk_kz: Сіз қатысатын кез келген пікірталастарда немесе форумдарда бейнеленетін болады

source: cannot be changed later
kk_kz: кейін өзгертуге болмайды

source: Welcome {username}
kk_kz: Қош келдіңіз {username}

source: Enter a Public Display Name:
kk_kz: Пайдаланушының Жария Бейнеленетін Атын енгізіңіз:

source: Public Display Name
kk_kz: Жария Бейнеленетін Ат

source: Additional Personal Information
kk_kz: Қосымша жеке ақпарат

source: example: New York
kk_kz: мысалы: Нью-Йорк

source: Highest Level of Education Completed
kk_kz: Сіз аяқтаған білімнің ең жоғары деңгейі

source: Please share with us your reasons for registering with {platform_name}
kk_kz: {platform_name} тіркелу себептерімен бөлісуіңізді өтінеміз

source: Account Acknowledgements
kk_kz: Есептік жазбаны мойындау

source: I agree to the {link_start}Terms of Service{link_end}
kk_kz: Мен {link_end} қызметтерді ұсынудың шарттарымен {link_start} келісемін

source: I agree to the {link_start}Honor Code{link_end}
kk_kz: Мен {link_end} ар-намыс кодексімен {link_start} келісемін

source: Create My Account
kk_kz: Менің есептік жазбамды құру

source: Preferences for {platform_name}
kk_kz: {platform_name} үшін бапталымдар

source: Update my {platform_name} Account
kk_kz: Менің {platform_name} аккаунтымды жаңарту

source: Welcome {username}! Please set your preferences below
kk_kz: Қош келдіңіз, {username}! Сіздің бапталымдарыңызды төменде көрсетіңіз.

source: Enter a public username:
kk_kz: Пайдаланушының жария атын енгізіңіз:

source: Update My Account
kk_kz: Менің есептік жазбамды жаңарту

source: Registration Help
kk_kz: Тіркеуге көмек

source: Already registered?
kk_kz: Тіркелдіңіз бе?

source: Log in
kk_kz: Кіру

source: Welcome to {platform_name}
kk_kz: {platform_name} қош келдіңіз

source: Registering with {platform_name} gives you access to all of our current and future free courses. Not ready to take a course just yet? Registering puts you on our mailing list - we will update you as courses are added.
kk_kz: Регистрация на платформе «{platform_name}» даёт вам доступ ко всем нашим текущим и будущим бесплатным курсам. Пока не готовы записаться на курс? При регистрация вы будете подписаны на нашу рассылку – мы сообщим вам о добавлении новых курсов.

source: Next Steps
kk_kz: Дұдан арғы қадамдар

source: As part of joining {platform_name}, you will receive an email message with instructions for activating your account. Don't see the email? Check your spam folder and mark {platform_name} emails as 'not spam'. At {platform_name}, we communicate mostly through email.
kk_kz: При регистрации на платформе «{platform_name}» вы получите письмо с инструкцией по активации вашей учётной записи. Нет письма? Проверьте папку «Спам» и пометьте письма от {platform_name} «не спам». Электронная почта – основной способ связи с платформой «{platform_name}».

source: Need help registering with {platform_name}?
kk_kz: Нужна помощь в регистрации на {platform_name}?

source: View our FAQs for answers to commonly asked questions.
kk_kz: Жиі қойылатын сұрақтарға жауаптарды оқу үшін ЖҚС бөліміне кіріңіз.

source: You can find the answers to most of your questions in our list of FAQs. After you enroll in a course, you can also find answers in the course discussions.
kk_kz: Вы найдёте ответы на большинство своих вопросов в разделе «Вопросы и ответы», а после регистрации на курс – в разделе обсуждений по курсу.

source: Register for {platform_name}
kk_kz: Регистрация в {platform_name}

source: Create My {platform_name} Account
kk_kz: Создать мою учётную запись {platform_name}

source: Welcome!
kk_kz: Добро пожаловать!

source: Register below to create your {platform_name} account
kk_kz: Зарегистрируйтесь ниже, чтобы создать вашу учётную запись {platform_name}

source: Re-subscribe Successful!
kk_kz: Жазылым ойдағыдай жаңартылды!

source: You have re-enabled forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}.
kk_kz: Сіз форум туралы ескертулерді {platform_name} электрондық поштасынан қайта қостыңыз. Сіз {dashboard_link_start}бақылау тақтасына оралуға болады{link_end}.

source: Important!
kk_kz: Маңызды!

source: Previous
kk_kz: Алдыңғы

source: Next
kk_kz: Кейінгі

source: Sequence
kk_kz: Жүйелілік

source: Sign Up for {platform_name}
kk_kz: {platform_name} Есептік Жазбаны құру

source: e.g. yourname@domain.com
kk_kz: мысалы, yourname@domain.com

source: e.g. yourname (shown on forums)
kk_kz: мысалы, сіздің атыңыз (форумдарда бейнеленеді)

source: e.g. Your Name (for certificates)
kk_kz: мысалы, Сіздің Атыңыз (сертификаттар үшін)

source: <i>Welcome</i> {name}
kk_kz: <i>Добро пожаловать,</i> {name}!

source: Full Name *
kk_kz: Толық аты*

source: Ed. Completed
kk_kz: Алынған білім

source: Goals in signing up for {platform_name}
kk_kz: {platform_name} тіркелетін мақсаттар

source: Already have an account?
kk_kz: Есептік жазба бар ма?

source: Login.
kk_kz: Кіру.

source: This content experiment uses group configuration '{group_configuration_name}'.
kk_kz: Бұл контент экспериментінде топтық конфигурация қолданылады '{group_configuration_name}'.

source: Active Groups
kk_kz: Белсенді топтар

source: Inactive Groups
kk_kz: Енжар топтар

source: Staff Debug Info
kk_kz: Қызметкерлер үшін жөнге келтірілетін ақпарат

source: Submission history
kk_kz: Тексеруге материалдарды беру тарихы

source: {platform_name} Content Quality Assessment
kk_kz: {platform_name} мазмұнының сапасын бақылау қызметі

source: Comment
kk_kz: Түсініктемелер

source: comment
kk_kz: түсініктемелер

source: Tag
kk_kz: Тег

source: Optional tag (eg "done" or "broken"):
kk_kz: Міндетті емес тег (мысалы, \"аяқталды\" or \"жұмыс істемейді\"):

source: tag
kk_kz: тег

source: Add comment
kk_kz: Түсініктемелер қосу

source: Staff Debug:
kk_kz: Отладка для сотрудников

source: Score (for override only)
kk_kz: Бағалау (тек қайта анықтау үшін)

source: Reset Learner's Attempts to Zero
kk_kz: Оқушының әрекетін нөлге дейін төмендетіңіз

source: Delete Learner's State
kk_kz: Оқушының күйін жою

source: Rescore Learner's Submission
kk_kz: оқушының тапсыпмасын қайта бағалау

source: Rescore Only If Score Improves
kk_kz: Қайта бағалау Тек Баға Жақсарған Жағдайда Ғана

source: Override Score
kk_kz: Бағалауды Қайта Анықтау

source: Module Fields
kk_kz: Нысан алаптары

source: XML attributes
kk_kz: XML атрибуттары

source: Submission History Viewer
kk_kz: Тексеруге материалдарды беру тарихын қарау құралы

source: User:
kk_kz: Пользователь:

source: View History
kk_kz: Тарихты қарау

source: {course_number} Textbook
kk_kz: {course_number} оқулығы

source: Textbook Navigation
kk_kz: Оқулық бойынша навигация

source: Page
kk_kz: Бет

source: Previous page
kk_kz: Алдыңғы бет

source: Next page
kk_kz: Кейінгі бет

source: Sysadmin Dashboard
kk_kz: Панель управления администратора

source: Users
kk_kz: Пользователи

source: Staffing and Enrollment
kk_kz: Набор и регистрация

source: Git Logs
kk_kz: Логи Git

source: User Management
kk_kz: Управление учётными записями пользователей

source: Email or username
kk_kz: Адрес электронной почты или имя пользователя

source: Delete user
kk_kz: Удалить пользователя

source: Create user
kk_kz: Создать пользователя

source: Download list of all users (csv file)
kk_kz: Скачать список всех пользователей (CSV-файл)

source: Check and repair external authentication map
kk_kz: Проверить и восстановить карту внешней идентификации пользователей

source: Go to each individual course's Instructor dashboard to manage course enrollment.
kk_kz: Для управления зачислением на курс, перейдите к панели управления преподавателя.

source: Manage course staff and instructors
kk_kz: Управление списком сотрудников и преподавателей курса

source: Download staff and instructor list (csv file)
kk_kz: Скачать список сотрудников и преподавателей (CSV-файл)

source: Administer Courses
kk_kz: Управление курсами

source: Repo Location
kk_kz: Местонахождение репозитория

source: Repo Branch (optional)
kk_kz: Ветка git-репозитория (необязательно)

source: Load new course from GitHub
kk_kz: Загрузить новый курс с GitHub

source: Course ID or dir
kk_kz: ID или каталог курса

source: Delete course from site
kk_kz: Удалить курс с сайта

source: Platform Version
kk_kz: Версия платформы

source: previous
kk_kz: предыдущий

source: Page {current_page} of {total_pages}
kk_kz: Страница {current_page} из {total_pages}

source: next
kk_kz: следующий

source: Recent git load activity for {course_id}
kk_kz: Последние загрузки git для {course_id}

source: Date
kk_kz: Күні

source: Git Action
kk_kz: Операция Git

source: No git import logs have been recorded.
kk_kz: В журнале импорта из git нет записей.

source: No git import logs have been recorded for this course.
kk_kz: Нет журналов импорта из git для этого курса.

source: Tracking Log
kk_kz: Бақылау журналы

source: source
kk_kz: Қайнар көз

source: type
kk_kz: үлгісі

source: Unsubscribe Successful!
kk_kz: Вы отказались от уведомлений

source: You will no longer receive forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}. If you did not mean to do this, {undo_link_start}you can re-subscribe{link_end}.
kk_kz: Сіз бұдан былай форумнан электрондық пошта арқылы хабарлама алмайсыз {platform_name}. Сіз {dashboard_link_start} бақылау тақтасына оралуға болады{link_end}. Егер сіз мұны қаламасаңыз, {undo_link_start} қайта жазыла аласыз {link_end}

source: Dashboard for:
kk_kz: үшін үстел

source: More options
kk_kz: Көбірек

source: More Options
kk_kz: Көбірек

source: Using the system
kk_kz: Жүйені пайдалану

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
kk_kz: Бейнені қарау уақытында, субтитрлерді және навигация үшін айналдыру үстелін пайдаланыңыз. Субтитрлерге басу – ілгері және кейін жылжудың ең тез тәсілі

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
kk_kz: Егер сіздің монитордың рұқсаттық қабілеті төмен болса, қалған үш жиынды басып сол жақтағы навигациялық үстелді жасыруға болады

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
kk_kz: Егер сізге біршама ірі шрифттар керек болса, олардың масштабын жоғарылату немесе төмендету үшін өз браузеріңіздің бапталымдарын пайдаланыңыз. Google Chrome оны Ctrl и + немесе Ctrl и – бір уақытта басып істеуге болады.

source: Loading video player
kk_kz: Бейне плеерды жүктеу өтуде

source: Play video
kk_kz: Бейнені қарау

source: No playable video sources found.
kk_kz: Ойнатылатын видео көздері табылған жоқ.

source: Your browser does not support this video format. Try using a different browser.
kk_kz: Сіздің браузеріңіз бұл бейне форматын қолдамайды. Басқа шолғышты қолданып көріңіз.

source: Downloads and transcripts
kk_kz: Жүктеу және транскрипттер

source: Download video file
kk_kz: Бейне файлды жүктеу

source: Transcripts
kk_kz: Транскриптілер

source: Download {file}
kk_kz: Жүктеңіз {file}

source: Download transcript
kk_kz: Мәтінді көшіріп жүктеу

source: Handouts
kk_kz: Үлестірме материалдар

source: Download Handout
kk_kz: көрнекті материал көшіріп жүктеу

source: {num} of {total}
kk_kz: {total}-дан {num}

source: Your words were:
kk_kz: Сіздің сөздеріңіз мыналар болды:

source: API Access Request
kk_kz: API кіруге рұқсат сұрау

source: {platform_name} API Access Request
kk_kz: {platform_name} API кіруге рұқсат сұрау

source: Request API Access
kk_kz: API - ге кіруді сұрау

source: API Access Request Status
kk_kz: API - ге кіруге рұқсат сұраудың статусы

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
kk_kz: {platform_name} Курс каталогының API-не кіру туралы сұрауыңыз өңделеді. Өңдеу аяқталған кезде профильдегі электрондық пошта мекенжайына хабарлама аласыз. Сондай-ақ, API-ге кіру сұранысының күйін көру үшін осы бетке оралуға болады.

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
kk_kz: {platform_name} Курс каталогының API-не кіру туралы сұрауыңыз қабылданбады. Егер сіз бұл қате деп ойласаңыз немесе осы API пайдалану туралы басқа сұрақтар туындаса, {api_support_email_link} хабарласыңыз.

source: Your request to access the {platform_name} Course Catalog API has been approved.
kk_kz: {platform_name} Курс каталогының API-не кіру туралы сұрауыңыз мақұлданды.

source: Application Name
kk_kz: Бағдарлама атауы

source: API Client ID
kk_kz: API клиентінің идентификаторы

source: API Client Secret
kk_kz: API клиентінің құпиясы

source: Redirect URLs
kk_kz: URL мекен-жайларын қайта бағыттау

source: If you would like to regenerate your API client information, please use the form below.
kk_kz: Егер сіз API клиенті туралы ақпаратты қалпына келтіргіңіз келсе, төмендегі форманы қолданыңыз.

source: Generate API client credentials
kk_kz: API клиентінің тіркелгі деректерін жасау

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
kk_kz: Курстар каталогының {platform_name} API туралы көбірек білу үшін {link_start}API құжаттама бетіне кіріңіз {link_end}. Осы API пайдалану мәселелері бойынша {api_support_email_link} мекен-жайына хабарласыңыз.

source: API Terms of Service
kk_kz: API қызметтерін ұсыну шарттары

source: Terms of Service for {platform_name} APIs
kk_kz: API {platform_name} үшін қызмет көрсету шарттары

source: Effective Date: May 24th, 2018
kk_kz: Күшіне енген күні: 2018 жылғы 24 мамыр

source: Welcome to {platform_name}. Thank you for using {platform_name}'s Course Discovery API, Enterprise API and/or any additional APIs that we may offer from time to time (collectively, the "APIs"). Please read these Terms of Service prior to accessing or using the APIs. These Terms of Service, any additional terms within accompanying API documentation, and any applicable policies and guidelines that {platform_name} makes available and/or updates from time to time are agreements (collectively, the "Terms") between you and {platform_name}. These Terms are issued under the enterprise product agreement, member participation agreement, or other direct agreement governing the purchase of {platform_name} products, if any (the "Agreement"), executed by you or the party on whose behalf you are accessing or using the APIs and {platform_name}. In the event that you have such an Agreement that applies to your use of the APIs, the Agreement will control in the event of any conflict between it and these Terms. By accessing or using the APIs, you accept and agree to be legally bound by the Terms, whether or not you are a registered user. If you are accessing or using the APIs on behalf of a company, organization or other legal entity, you are agreeing to these Terms for that entity and representing and warranting to {platform_name} that you have full authority to accept and agree to these Terms for such entity, in which case the terms "you," "your" or related terms herein shall refer to such entity on whose behalf you are accessing or using the APIs. If you do not have such authority or if you do not understand or do not wish to be bound by the Terms, you should not use the APIs.
kk_kz: {platform_name} - ге қош келдіңіз. {Platform_name} курсын анықтау API, корпоративтік API және/немесе біз мезгіл-мезгіл ұсына алатын кез-келген қосымша API ("API"жиынтығында) пайдаланғаныңыз үшін алғыс айтамыз. API кіру немесе пайдалану алдында осы қызмет көрсету шарттарымен танысыңыз. Осы қызмет көрсету шарттары, API ілеспе құжаттамасындағы кез-келген қосымша шарттар, сондай-ақ {platform_name} ұсынатын және/немесе мезгіл-мезгіл жаңартып отыратын кез-келген қолданылатын саясат пен нұсқаулар сіз бен {platform_name} арасындағы келісімдер ("шарттар" жиынтығында) болып табылады. Бұл шарттар сіз немесе Сіздің атыңыздан API және {platform_name} кіретін немесе пайдаланатын тарап орындайтын {platform_name} өнімдерін сатып алуды реттейтін кәсіпорын өнімі туралы келісімге, қатысушы туралы келісімге немесе басқа тікелей келісімге ("келісім") сәйкес беріледі. Егер сізде API-ді қолдануға қатысты осындай келісім болса, Келісім оның арасындағы кез-келген жанжал туындаған жағдайда бақыланады{platform_name}

source: API Access
kk_kz: API-ге кіру
