Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
kk_kz: Взять указанный учебный курс и попытаться экспортировать его в репозиторий git . Каталог с учебным курсом должен уже существовать в репозитории git. Использование: git_export <course_loc> <git_url>

source: Unknown User ID: {0}
kk_kz: Неизвестный идентификатор пользователя: {0}

source: Permission denied
kk_kz: Доступ запрещён

source: We only support uploading a .tar.gz file.
kk_kz: Мы поддерживаем загрузку только файлов .tar.gz.

source: Tar file not found
kk_kz: Tar-файл не найден

source: Unsafe tar file. Aborting import.
kk_kz: Небезопасный tar-архив. Импорт отменён.

source: Could not find the {0} file in the package.
kk_kz: Не найден {0} в файле пакета.

source: Deleted Group
kk_kz: Группа удалена

source: Upload completed
kk_kz: Загрузка завершена

source: must have name of the certificate
kk_kz: должно быть указано название сертификата

source: Certificate dict {0} missing value key '{1}'
kk_kz: В словаре для сертификата {0} не хватает значения с ключом '{1}'.

source: PermissionDenied: Failed in authenticating {user}
kk_kz: PermissionDenied: ошибка аутентификации пользователя {user}

source: {platform_name} Support Levels:
kk_kz: Уровни поддержки {platform_name}:

source: Video
kk_kz: Видео

source: Blank
kk_kz: Пустой

source: Course has been successfully reindexed.
kk_kz: Поисковый индекс курса успешно обновлён.

source: Special characters not allowed in organization, course number, and course run.
kk_kz: Использование специальных символов запрещено для обозначения организации, номера курса и программы курсов.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
kk_kz: Уже существует курс с такой организацией и номером курса. Пожалуйста, измените одно из полей – организацию или номер курса.

source: Please change either the organization or course number so that it is unique.
kk_kz: Пожалуйста, измените Организацию или Номер курса. Они должны быть уникальными.

source: Unable to create course '{name}'. {err}
kk_kz: Невозможно создать курс с именем'{name}' {err}

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
kk_kz: Вы должны привязать этот курс к организации, прежде чем продолжить. Организации, которую вы выбрали, не существует в системе, вам нужно будет добавить её

source: Invalid prerequisite course key
kk_kz: Неверный ключ обязательного предыдущего курса

source: An error occurred while trying to save your tabs
kk_kz: При сохранении ваших вкладок произошла ошибка

source: Tabs Exception
kk_kz: Ошибка обновления вкладок

source: This group configuration is in use and cannot be deleted.
kk_kz: Этот набор групп уже используется и не может быть удалён.

source: This content group is in use and cannot be deleted.
kk_kz: Эта группа по изучаемым материалам уже используется и не может быть удалена.

source: Entrance Exam - Subsection
kk_kz: Вступительное испытание – подраздел

source: Completed Course Entrance Exam
kk_kz: Завершённое вступительное испытание

source: Course successfully exported to git repository
kk_kz: Учебный курс успешно экспортирован в хранилище git

source: Vertical
kk_kz: Вертикальный

source: File upload corrupted. Please try again
kk_kz: Загруженный файл повреждён. Пожалуйста, попробуйте ещё раз.

source: Invalid data
kk_kz: Неверные данные

source: Invalid data ({details})
kk_kz: Неверные данные ({details})

source: You can not move {source_type} into {target_parent_type}.
kk_kz: Вы не можете переместить {source_type} в {target_parent_type}.

source: Item is already present in target location.
kk_kz: Элемент уже находится в заданном месте.

source: You can not move an item into itself.
kk_kz: Невозможно переместить элемент в самого себя.

source: You can not move an item into it's child.
kk_kz: Невозможно поместить элемент в его дочерний элемент.

source: You can not move an item directly into content experiment.
kk_kz: Невозможно переместить элемент в компонент с экспериментальными материалами.

source: {source_usage_key} not found in {parent_usage_key}.
kk_kz: {source_usage_key} не найден в {parent_usage_key}.

source: You can not move {source_usage_key} at an invalid index ({target_index}).
kk_kz: Невозможно переместить {source_usage_key} на отсутствующую позицию ({target_index}).

source: You must provide target_index ({target_index}) as an integer.
kk_kz: Необходимо указать позицию ({target_index}) в виде целого числа.

source: Duplicate of {0}
kk_kz: Копия {0}

source: Duplicate of '{0}'
kk_kz: Копия «{0}»

source: Students must score {score}{pct_sign} or higher to access course materials.
kk_kz: Слушатели должны набрать {score}{pct_sign} или более для доступа к материалам курса.

source: Unable to create library - missing required field '{field}'
kk_kz: Не удалось создать библиотеку – не задано обязательное поле "{field}"

source: Unable to create library '{name}'. {err}
kk_kz: Не удалось создать библиотеку '{name}'. {err}

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
kk_kz: Библиотека этой организации с таким кодом уже существует. Пожалуйста, измените код вашей библиотеки, чтобы он был уникальным в пределах вашей организации.

source: Access restricted to: {list_of_groups}
kk_kz: Доступ разрешён для: {list_of_groups}

source: Transcripts are supported only for "video" modules.
kk_kz: Субтитры поддерживаются только для компонентов «Видео».

source: Incoming video data is empty.
kk_kz: Пустые входные видеоданные.

source: Can't find item by locator.
kk_kz: По указателю элемент найти не удалось.

source: Insufficient permissions
kk_kz: Недостаточно прав

source: Could not find user by email address '{email}'.
kk_kz: Не удалось найти пользователя по адресу электронной почты '{email}'.

source: No `role` specified.
kk_kz: «Роль» не задана.

source: User {email} has registered but has not yet activated his/her account.
kk_kz: Пользователь {email} уже зарегистрировал, но ещё не активировал свою учётную запись.

source: Invalid `role` specified.
kk_kz: Задана неверная «роль».

source: You may not remove the last Admin. Add another Admin first.
kk_kz: Вы не можете удалить последнего Администратора. Сначала добавьте другого Администратора.

source: Uploading
kk_kz: Жүктеу

source: In Progress
kk_kz: Жұмыс барысында

source: Ready
kk_kz: Готово

source: Uploaded
kk_kz: Загружено

source: Failed
kk_kz: Неудачно

source: Cancelled
kk_kz: Жойылған

source: Failed Duplicate
kk_kz: Нефункциональная копия

source: YouTube Duplicate
kk_kz: Повторный YouTube token

source: Invalid Token
kk_kz: Неверный ключ

source: Imported
kk_kz: Импортировано

source: Unknown
kk_kz: Белгісіз

source: {profile_name} URL
kk_kz: URL-ссылка на {profile_name}

source: Duration
kk_kz: Продолжительность

source: Date Added
kk_kz: Дата добавления

source: unrequested
kk_kz: незарегистрирован

source: pending
kk_kz: ожидание

source: granted
kk_kz: предоставленный

source: denied
kk_kz: отказано

source: Studio user
kk_kz: Пользователь Studio

source: The date when state was last updated
kk_kz: Дата последнего обновления состояния

source: Current course creator state
kk_kz: Текущее состояние создателя курса

source: Optional notes about this user (for example, why course creation access was denied)
kk_kz: Дополнительные заметки о пользователе (например, почему отказано в доступе)

source: Force Publish Course
kk_kz: Обеспечить публикацию курса

source: Sometimes the draft and published branches of a course can get out of sync. Force publish course command resets the published branch of a course to point to the draft branch, effectively force publishing the course. This view dry runs the force publish command
kk_kz: Иногда черновой вариант и опубликованный курс рассинхронизируются. Команда принудительной публикации позволяет привести опубликованную версию курса к черновой, полностью публикуя изменения. Данное представление позволяет сымитировать запуск принудительной публикации.

source: Please provide course id.
kk_kz: Пожалуйста, укажите идентификатор курса.

source: Invalid course key.
kk_kz: Курстың кілті дұрыс емес.

source: No matching course found.
kk_kz: Соответствующий курс не найден.

source: Force publishing course is not supported with old mongo courses.
kk_kz: Принудительная публикация не поддерживается старой версией Mongo-курсов.

source: Course is already in published state.
kk_kz: Курс уже опубликован.

source: Incorrect format for field '{name}'. {detailed_message}
kk_kz: Неверный формат для поля '{name}'. {detailed_message}

source: Dictionary with the available tags
kk_kz: Словарь тегов

source: Studio Administration
kk_kz: Администратор студии

source: Page Not Found
kk_kz: Бет табылмады

source: Page not found
kk_kz: Бет табылмады

source: Content
kk_kz: Мазмұны

source: Settings
kk_kz: Настройки

source: Loading
kk_kz: Жүктелуде

source: Course Number
kk_kz: Курс нөмірі

source: Course Outline
kk_kz: Структура курса

source: Error:
kk_kz: Қателік:

source: Organization:
kk_kz: Ұйым:

source: Course Number:
kk_kz: Курс нөмірі:

source: Course Run:
kk_kz: Курс барысы:

source: Courses
kk_kz: КУРСТАР

source: Sign In to {studio_name}
kk_kz: Кіру {studio_name}

source: Don't have a {studio_name} Account? Sign up!
kk_kz: Нет учётной записи {studio_name}? Зарегистрируйтесь!

source: Required Information to Sign In to {studio_name}
kk_kz: Информация, необходимая для входа в {studio_name}

source: E-mail
kk_kz: Электрондық почта

source: example: username@domain.com
kk_kz: үлгі: username@domain.com

source: Forgot password?
kk_kz: Құпия сөзді ұмыттыңыз ба?

source: example: Jane Doe
kk_kz: үлгі: Jane Doe

source: example: JaneDoe
kk_kz: үлгі: JaneDoe

source: Course End Date
kk_kz: Дата окончания курса

source: Instructors
kk_kz: Оқытушылар

source: Requirements
kk_kz: Талаптар

source: Details
kk_kz: Егжей-тегжейлер

source: View
kk_kz: Қарау

source: Reset
kk_kz: Ысыру

source: Legal
kk_kz: Заңды

source: Choose Language
kk_kz: Тілді таңдаңыз

source: Account
kk_kz: Аккаунт

source: Help
kk_kz: Помощь

source: Looking for help with {studio_name}?
kk_kz: {studio_name} жөнінде көмек іздедіңіз бе?

source: Hide {studio_name} Help
kk_kz: Анықтаманы жасыру {studio_name}

source: {studio_name} Documentation
kk_kz: {studio_name} Жазбалар

source: Access documentation on http://docs.edx.org
kk_kz: http://docs.edx.org бойынша құжаттамаға қол жеткізу

source: edX Documentation
kk_kz: Документация по edX

source: Enroll in edX101: Overview of Creating an edX Course
kk_kz: Пройти курс «Базовые возможности системы»

source: Enroll in edX101
kk_kz: Пройти курс «Базовые возможности системы»

source: Enroll in StudioX: Creating a Course with edX Studio
kk_kz: Пройти курс «Как создать курс в Studio»

source: Enroll in StudioX
kk_kz: Пройти курс «Как создать курс в Studio»

source: Send an email to {email}
kk_kz: {email} адресіне хат жіберу

source: name
kk_kz: аты

source: Usermenu
kk_kz: Қолданушы менюі

source: Usermenu dropdown
kk_kz: Выпадающий список меню пользователя

source: Sign Out
kk_kz: Шығу

source: Code Editor
kk_kz: Код редакторы

source: Feedback Form
kk_kz: Кері байланыс нысаны

source: Email: {email}
kk_kz: Электрондық пошта: {email}

source: Full Name: {realname}
kk_kz: Толық аты: {realname}

source: Inquiry Type: {inquiry_type}
kk_kz: Сұрау түрі:{inquiry_type}

source: Message: {message}
kk_kz: Хабарлама: {message}

source: Tags: {tags}
kk_kz: Тегтер:{tags}

source: Additional Info:
kk_kz: Қосымша ақпарат:

source: Feedback from user
kk_kz: Пайдаланушылардың пікірлері

source: The email associated with your {platform_name} account has changed from {old_email} to {new_email}.
kk_kz: {Platform_name} есептік жазбаңызбен байланысты электрондық пошта мекенжайы {old_email} - ден {new_email} - ге өзгерді.

source: No action is needed on your part.
kk_kz: Сіздің тарапыңыздан ешқандай әрекет қажет емес.

source: If this change is not correct, contact {link_start}{platform_name} Support{link_end} or your administrator.
kk_kz: Егер бұл өзгеріс дұрыс болмаса, қолдау қызметіне хабарласыңыз {link_start}{platform_name} {link_end} немесе әкімшіңізге.

source: Your {platform_name} account email has been updated
kk_kz: Есептік жазбаңыздың электрондық пошта мекенжайы {platform_name} жаңартылды

source: Add a Post
kk_kz: Хабар қосу

source: New topic form
kk_kz: Тақырыптың жаңа формасы

source: Discussion thread list
kk_kz: Талқыланатын тақырыптар тізімі

source: %s discussion started
kk_kz: Открыта %s тема для обсуждения

source: %s comment
kk_kz: %s комментарий

source: Discussion unavailable
kk_kz: Талқылау мүмкін емес

source: The discussions are currently undergoing maintenance. We'll have them back up shortly!
kk_kz: Қазіргі уақытта техникалық қызмет көрсету талқылануда. Жақында біз оларды қайтарамыз!

source: Content Locked
kk_kz: Мазмұн Бұғатталған

source: You must complete the prerequisites for '{prereq_section_name}' to access this content.
kk_kz: Бұл мазмұнға қол жеткізу үшін '{prereq_section_name}' үшін алғышарттарды орындау қажет.

source: Go to Prerequisite Section
kk_kz: Міндетті шарттар бөліміне өтіңіз

source: Collapse Instructions
kk_kz: Нұсқаулықтарды жиыру

source: Guided Discussion
kk_kz: Бақыланатын пікірталастар

source: Hide Annotations
kk_kz: Түсіндірмелерді жасыру

source: Bookmarked
kk_kz: Бетбелгі

source: Bookmark this page
kk_kz: Осы бетті бетбелгілерге қосыңыз

source: You do not have access to this dependency module.
kk_kz: Сізде бұл тәуелділік модуліне қол жетімділік жоқ.

source: LEARN MORE
kk_kz: ҚОСЫМША БІЛУ ҮШІН

source: Starts
kk_kz: Басталуы

source: Starts: {date}
kk_kz: Басталады: {date}

source: View all Courses
kk_kz: Барлық курстар қарау

source: Dashboard
kk_kz: Үстел

source: You are not enrolled in any courses yet.
kk_kz: Сіз әлі қандай да бір курстарға тіркелмегенсіз.

source: Explore courses
kk_kz: Просмотреть курсы

source: Activate your account!
kk_kz: Есептік жазбаңызды іске қосыңыз!

source: Course-loading errors
kk_kz: Курсты жүктеу кезінде қателіктер

source: Search Your Courses
kk_kz: Сіздің курсыңызға ізденіс

source: Clear search
kk_kz: Ізденісті жою

source: Account Status Info
kk_kz: Аккаунт статусы жөнінде мәлімет

source: Order History
kk_kz: Тапсырыстар тарихы

source: Email Settings for {course_number}
kk_kz: {course_number} курс үшін e-mail бапталымдар

source: Receive course emails
kk_kz: Курс әкімшісінен таратуға жазылу

source: Save Settings
kk_kz: Бапталымдарды сақтау

source: Unenroll
kk_kz: Тізімнен алып тастау

source: View Unit in Studio
kk_kz: Просмотр блока в Studio

source: E-mail change failed
kk_kz: Электрондық почтаның мекенжайын ауыстыру мүмкін болады

source: We were unable to send a confirmation email to {email}
kk_kz: Бізге {email} растауды жіберу мүмкін болмады

source: Go back to the {link_start}home page{link_end}.
kk_kz: {link_end} үй бетінің {link_start} қайту

source: E-mail change successful!
kk_kz: Электрондық мекенжайды ауыстыру ойдағыдай өтті!

source: You should see your new email in your {link_start}dashboard{link_end}.
kk_kz: Енді сіздің электрондық почтаңыздың жаңа мекенжайы {link_end} үстелінің сіздің {link_start} пайда болуы тиіс

source: An account with the new e-mail address already exists.
kk_kz: Электрондық почтаның осындай мекенжайымен есептік жазба бар.

source: You should Register before trying to access the Unit
kk_kz: Блокқа кірмес бұрын тіркелуіңіз қажет.

# self
source: Enroll
kk_kz: Тізімге енгізу

source: Don't enroll
kk_kz: түсуге болмайды

source: Student Enrollment Form
kk_kz: Студент ретінде курсқа жазылу үшін нысан

source: Course:
kk_kz: Курс:

source: Add new students
kk_kz: Жаңа студенттерді қосу

source: Existing students:
kk_kz: Бар студенттер:

source: New students added:
kk_kz: Добавлены новые слушатели:

source: Students rejected:
kk_kz: Слушатели, получившие отказ:

source: Debug:
kk_kz: Отладка:

source: External Authentication failed
kk_kz: Сыртқы Авторландыру қателігі

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
kk_kz: Өзіңіздің электрондық почтаңыздың мекенжайын төмендегі алапқа енгізіңіз және біз сізге парольді ысыру жөніндегі нұсқаулықты жібереміз

source: Required Information
kk_kz: Қажетті ақпарат

source: Your E-mail Address
kk_kz: Сіздің электрондық почтаңыздың мекенжайы

source: This is the e-mail address you used to register with {platform}
kk_kz: Бұл e-mail мекенжайы, оның көмегімен сіз {platform} тілкелдіңіз

source: Reset My Password
kk_kz: Менің паролімді ысыру

source: Email is incorrect.
kk_kz: Электрондық почтаның мекенжайы дұрыс енгізілмеді

source: Support
kk_kz: Техподдержка

source: For {strong_start}questions on course lectures, homework, tools, or materials for this course{strong_end}, post in the {link_start}course discussion forum{link_end}.
kk_kz: Если у вас есть {strong_start}вопросы по лекциям, домашним заданиям, приложениям или материалам данного курса{strong_end}, напишите об этом на {link_start}форуме обсуждений{link_end}.

source: Have {strong_start}general questions about {platform_name}{strong_end}? You can find lots of helpful information in the {platform_name} {link_start}FAQ{link_end}.
kk_kz: Появились {strong_start}общие вопросы о платформе «{platform_name}»{strong_end}? Вы найдёте много полезной информации в разделе {link_start}«Вопросы и ответы»{link_end} {platform_name}.

source: Have a {strong_start}question about something specific{strong_end}? You can contact the {platform_name} general support team directly:
kk_kz: Возник {strong_start}вопрос по определённой теме{strong_end}? Свяжитесь с командой поддержки {platform_name}:

source: Report a problem
kk_kz: Сообщить о проблеме

source: Make a suggestion
kk_kz: Внести предложение

source: Ask a question
kk_kz: Задать вопрос

source: Please note: The {platform_name} support team is English speaking. While we will do our best to address your inquiry in any language, our responses will be in English.
kk_kz: Обратите внимание: команда поддержки {platform_name} говорит только на английском языке. Мы сделаем всё, что от нас зависит, чтобы рассмотреть ваш запрос, но наши ответы будут на английском языке.

source: Briefly describe your issue
kk_kz: Кратко опишите проблему

source: Tell us the details
kk_kz: Сообщите нам детали

source: Describe what you were doing when you encountered the issue. Include any details that will help us to troubleshoot, including error messages that you saw.
kk_kz: Опишите, что вы делали, когда столкнулись с проблемой. Укажите всё, что может помочь нам разрешить проблему, включая текст увиденных вами сообщений об ошибке.

source: Thank You!
kk_kz: Рахмет!

source: Thank you for your inquiry or feedback. We typically respond to a request within one business day, Monday to Friday. In the meantime, please review our {link_start}detailed FAQs{link_end} where most questions have already been answered.
kk_kz: Спасибо за ваш вопрос или предложение. Как правило, мы отвечаем в течение одного рабочего дня, с понедельника по пятницу. Пока вы можете изучить наш детальный раздел {link_start}«Вопросы и ответы»{link_end}.

source: - Select -
kk_kz: - Таңдаңыз -

source: problem
kk_kz: Тапсырма

source: Report a Problem
kk_kz: Сообщить о проблеме

source: Brief description of the problem
kk_kz: Краткое описание проблемы

source: Details of the problem you are encountering{asterisk}
kk_kz: Подробности обнаруженной проблемы{asterisk}

source: suggestion
kk_kz: предложение

source: Make a Suggestion
kk_kz: Внести предложение

source: Brief description of your suggestion
kk_kz: Краткое описание вашего предложения

source: question
kk_kz: вопрос

source: Ask a Question
kk_kz: Задать вопрос

source: Brief summary of your question
kk_kz: Краткое содержание вашего вопроса

source: An error has occurred.
kk_kz: Произошла ошибка.

source: Please {link_start}send us e-mail{link_end}.
kk_kz: {link_start}Отправьте нам электронное сообщение{link_end}

source: Please try again later.
kk_kz: Повторите попытку позже.

source: The course has ended.
kk_kz: Курс аяқталды.

source: The due date for this assignment has passed.
kk_kz: Бұл тапсырманың мерзімі аяқталды.

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
kk_kz: Поскольку курс завершён, доступ к этому заданию закрыт. {line_break}Если вы выполнили это задание, вы можете увидеть свою оценку в разделе {link_start}прогресс{link_end}.

source: Because the due date has passed, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
kk_kz: Поскольку срок сдачи истёк, доступ к этому заданию закрыт. {line_break}Если вы выполнили это задание, вы можете увидеть свою оценку в разделе {link_start}прогресс{link_end}.

source: Search for a course
kk_kz: Курс іздеу

source: Welcome to the Open edX{registered_trademark} platform!
kk_kz: Добро пожаловать на платформу Open edX{registered_trademark}!

source: It works! This is the default homepage for this Open edX instance.
kk_kz: Работает! Перед вами образец главной страницы Open edX.

source: Invalid email change key
kk_kz: Электрондық почтаны ауыстырудың дұрыс емес кілті

source: This e-mail key is not valid. Please check:
kk_kz: Электрондық почтаның осы кілті жарамсыз. Тексеруді өтінеміз:

source: Was this key already used? Check whether the e-mail change has already happened.
kk_kz: Осы кілт бұдан бұрын пайдаланылмады ма? Сіз электрондық почтаның мекенжайын ауыстырмадыңыз ба екеніне көз жеткізіңіз.

source: Did your e-mail client break the URL into two lines?
kk_kz: Сіздің почта клиентіңіз сілтемені екі бөлікке бөліп тастамады ма?

source: The keys are valid for a limited amount of time. Has the key expired?
kk_kz: Кілттер шектеулі уақытта қолданылады. Сіздің кілтіңіздің қолданылу мерзімі өтпеді ме?

source: Showing all matching content eligible to be added into {display_name}. Each student will be assigned {max_count} component drawn randomly from this list.
kk_kz: Показаны все материалы, которые можно добавить в {display_name}. Каждому студенту будет случайным образом задан {max_count} элемент из этого списка.

source: Helpful Information
kk_kz: Полезная информация

source: Login via OpenID
kk_kz: Войти с помощью OpenID

source: You can now start learning with {platform_name} by logging in with your <a rel="external" href="http://openid.net/">OpenID account</a>.
kk_kz: Теперь вы можете начать изучать курсы {platform_name}, используя свой внешний <a rel="external" href="http://openid.net/">аккаунт OpenID account</a>.

source: Not Enrolled?
kk_kz: Не зарегистрированы?

source: Sign up for {platform_name} today!
kk_kz: Зарегистрируйтесь для доступа к {platform_name} уже сегодня!

source: Need Help?
kk_kz: Көмек керек пе?

source: Looking for help signing in or with your {platform_name} account?
kk_kz: Нужна помощь при входе или с вашей учётной записью {platform_name}?

source: View our help section for answers to commonly asked questions.
kk_kz: Посетите наш раздел помощи для того, чтобы прочитать ответы на часто задаваемые вопросы.

source: Log into your {platform_name} Account
kk_kz: Вход в вашу учётную запись {platform_name}

source: Log into My {platform_name} Account
kk_kz: Вход в мою учётную запись {platform_name}

source: Access My Courses
kk_kz: Перейти к своим курсам
