Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Discussion
kk_kz: Обсуждение

source: Problem
kk_kz: Задача

source: Advanced
kk_kz: Дополнительно

source: Entrance Exam
kk_kz: Оқуға түсу емтиханы

source: Section
kk_kz: Раздел

source: Subsection
kk_kz: Подраздел

source: Unit
kk_kz: Блок

source: Empty
kk_kz: Бос

source: The following parameters are required: {missing}.
kk_kz: Келесі параметрлер қажет: {missing}.

source: A transcript with the "{language_code}" language code already exists.
kk_kz: Расшифровка с кодом языка "{language_code}" уже существует.

source: A transcript file is required.
kk_kz: Табель қажет.

source: There is a problem with this transcript file. Try to upload a different file.
kk_kz: Мына табель файлында проблема бар. Басқа файлмен табельді жүктеңіз.

source: Name
kk_kz: Аты

source: Video ID
kk_kz: Видео ID

source: Status
kk_kz: Состояние

source: Pending
kk_kz: күтуде

source: Django site admin
kk_kz: Django сайтының админі

source: Django administration
kk_kz: Django администрациясы

source: View site
kk_kz: Сайтты қарау

source: Documentation
kk_kz: Документация

source: Log out
kk_kz: Выйти

source: Mode
kk_kz: Режим

source: Verification Deadline
kk_kz: Қайта анықтаудың соңғы мерзімі

source: OPTIONAL: After this date/time, users will no longer be able to submit photos for verification. This appies ONLY to modes that require verification.
kk_kz: ҚОСЫМША: осы күн/уақыттан кейін пайдаланушылар енді фотосуреттерді тексеру үшін жібере алмайды. Бұл ТЕК тексеруді қажет ететін режимдерге қатысты.

source: Your verification is pending
kk_kz: Сіздің тексерісіңіз қаралуда

source: Verified: Pending Verification
kk_kz: Тексерді: салыстырып тексеру үшін күту

source: ID verification pending
kk_kz: ID тексеру жарияланды

source: You're enrolled as a verified student
kk_kz: Сіз тексерілген студент ретінде тіркелдіңіз

source: Verified
kk_kz: тексерілген

source: ID Verified Ribbon/Badge
kk_kz: Жеке басын куәландыратын бейдж

source: You're enrolled as an honor code student
kk_kz: Сіз үздік студент ретінде қабылданасыз

source: Honor Code
kk_kz: Ар-намыс кодексі

source: You're enrolled as a professional education student
kk_kz: Кәсіби білімді студент ретінде тіркелдіңіз

source: Professional Ed
kk_kz: Кәсіби Ed

source: Display Name
kk_kz: Атын көрсету

source: Price
kk_kz: Баға

source: Upgrade Deadline
kk_kz: Қайта жаңарту мерзімі

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
kk_kz: Қосымша: осы күн/уақыттан кейін пайдаланушылар бұдан былай бұл режимде тіркеле алмайды. Егер пайдаланушылар курсқа тіркелу жабылғанға дейін осы режимде тіркеле алатын болса, бұл бланкті бос қалдырыңыз.

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
kk_kz: Қосымша: бұл осы режимнің сыртқы электрондық коммерция қызметіндегі элементі (сақтау бірлігі). Егер курс электрондық коммерция қызметіне әлі ауыспаған болса, бұл бланкті бос қалдырыңыз.

source: This is the bulk SKU (stock keeping unit) of this mode in the external ecommerce service.
kk_kz: Бұл осы режимнің сыртқы электрондық коммерция қызметіндегі негізгі элементі (сақтау бірлігі).

source: Honor
kk_kz: Ар-намыс

source: Professional education modes are not allowed to have expiration_datetime set.
kk_kz: Кәсіптік білім беру режимдеріне қолданылу мерзімінің аяқталу уақытын белгілеуге рұқсат етілмейді.

source: Verified modes cannot be free.
kk_kz: Режимы с подтверждением личности не могут быть бесплатными.

source: {currency_symbol}{price}
kk_kz: {price}{currency_symbol}

source: Free
kk_kz: Тегін

source: The time period before a course ends in which a course mode will expire
kk_kz: Курс режимінің қолданылу мерзімі аяқталатын курс аяқталғанға дейінгі уақыт кезеңі

source: Congratulations! You are now enrolled in {course_name}
kk_kz: Құттықтаймын! Сіз {course_name} курсына қабылдандыңыз

source: Enrollment is closed
kk_kz: Тіркеу жабық

source: Enrollment mode not supported
kk_kz: Курсқа жазылу режимі қолдау таппайды

source: Invalid amount selected.
kk_kz: Қате сома таңдалды.

source: No selected price or selected price is too low.
kk_kz: Баға таңдалмады немесе таңдалған баға өте төмен.

source: Administrator
kk_kz: Әкімші

source: Moderator
kk_kz: Модератор

source: Group Moderator
kk_kz: Группа модераторы

source: Community TA
kk_kz: Қоғамдастықтың техникалық ассистенті

source: Student
kk_kz: Студент

source: User profile
kk_kz: Пайдаланушының профилі

source: Account recovery
kk_kz: Есептік жазбаны қалпына келтіру

source: Password
kk_kz: Пароль

source: Raw passwords are not stored, so there is no way to see this user's password.
kk_kz: Өңделмеген құпиясөздер сақталмайды, сондықтан бұл пайдаланушының құпиясөзін көруге мүмкіндік жоқ.

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
kk_kz: Бұл электрондық пошта мекенжайында байланысты пайдаланушы тіркелгісі жоқ. Сіз тіркелгеніңізге сенімдісіз бе?

source: The user account associated with this e-mail address cannot reset the password.
kk_kz: Осы электрондық пошта мекенжайына байланысты пайдаланушы тіркелгісі құпия сөзді қалпына келтіре алмайды.

source: Full Name cannot contain the following characters: < >
kk_kz: Толық аты-жөнде келесі таңбалар болмауы керек: < >

source: A properly formatted e-mail is required
kk_kz: Белгіленген нысандағы электрондық мекенжай талап етіледі

source: Your legal name must be a minimum of two characters long
kk_kz: Сіздің ресми атыңыз кем дегенде бір таңбадан тұруы керек

source: Email cannot be more than %(limit_value)s characters long
kk_kz: Электрондық поштаның ұзындығы %(limit_value)s таңбадан аспауы керек

source: You must accept the terms of service.
kk_kz: Сіз қызметтер көрсету шарттарын қабылдауыңыз тиіс.

source: A level of education is required
kk_kz: Білім деңгейі – міндетті толтыруға арналған алап

source: Your gender is required
kk_kz: Сіздің жынысыңыз – міндетті толтыруға арналған алап

source: Your year of birth is required
kk_kz: Сіздің туған жылыңыз – міндетті толтыруға арналған алап

source: Your mailing address is required
kk_kz: Сіздің почталық мекенжайыңыз – міндетті толтыруға арналған алап

source: A description of your goals is required
kk_kz: Сіздің мақсаттарыңыздың сипаттамасы – міндетті толтыруға арналған алап

source: A city is required
kk_kz: Қала – міндетті толтыруға арналған алап

source: A country is required
kk_kz: Ел – міндетті толтыруға арналған алап

source: To enroll, you must follow the honor code.
kk_kz: Тіркелу үшін сіз Ар-намыс кодексін ұстануыңыз қажет.

source: You are missing one or more required fields
kk_kz: Сізде бір немесе одан да көп алап толтырылмаған

source: Unauthorized email address.
kk_kz: Рұқсат етілмеген электрондық пошта мекенжайы

source: It looks like {email} belongs to an existing account. Try again with a different email address.
kk_kz: Cіз көрсеткен {email} басқа аккаунтқа тиесілі секілді. Басқа электронды поштаны қолданып көріңіз.

source: An account with the Public Username '{username}' already exists.
kk_kz: Жария аты '{username}' аккаунт жоқ.

source: An account with the Email '{email}' already exists.
kk_kz: Электрондық мекенжайы '{email}' есептік жазба бар.

source: Removed group: "{}"
kk_kz: Удалённая группа: «{}»

source: Did not find a group with name "{}" - skipping.
kk_kz: Группа с названием «{}» не была найдена – пропуск.

source: Invalid group name: "{group_name}". {messages}
kk_kz: Некорректное название группы: «{group_name}». {messages}

source: Created new group: "{}"
kk_kz: Создана новая группа: «{}»

source: Found existing group: "{}"
kk_kz: Найдена существующая группа: «{}»

source: Adding {codenames} permissions to group "{group}"
kk_kz: Добавление прав {codenames} группе «{group}»

source: Removing {codenames} permissions from group "{group}"
kk_kz: Отзыв прав {codenames} группы «{group}»

source: Invalid permission option: "{}". Please specify permissions using the format: app_label:model_name:permission_codename.
kk_kz: Некорректное название права доступа: "{}". Пожалуйста, укажите права доступа в формате: app_label:model_name:permission_codename.

source: Invalid permission codename: "{codename}". No such permission exists for the model {module}.{model_name}.
kk_kz: Некорректное название права доступа: "{codename}". Не существует таких прав доступа к модели {module}.{model_name}.

source: Setting {attribute} for user "{username}" to "{new_value}"
kk_kz: Установка атрибута{attribute} для пользователя "{username}" в значение "{new_value}"

source: Skipping user "{}" because the specified and existing email addresses do not match.
kk_kz: Пропуск пользователя "{}", так как указанный адрес электронной почты не был найден.

source: Did not find a user with username "{}" - skipping.
kk_kz: Не был найден пользователь с именем пользователя "{}" – пропуск.

source: Removing user: "{}"
kk_kz: Удаление пользователя: "{}"

source: Created new user: "{}"
kk_kz: Создан новый пользователь: "{}"

source: Found existing user: "{}"
kk_kz: Найти существующего пользователя: "{}"

source: Setting unusable password for user "{}"
kk_kz: Настройка неиспользуемого пароля для пользователя "{}"

source: Created new profile for user: "{}"
kk_kz: Создать новый профиль для пользователя: "{}"

source: Could not find a group named "{}" - skipping.
kk_kz: Невозможно найти группу с названием "{}" – пропуск.

source: Adding user "{username}" to groups {group_names}
kk_kz: Редактировать пользователя "{username}" в группу {group_names}

source: Removing user "{username}" from groups {group_names}
kk_kz: Удаление пользователя "{username}" из групп {group_names}

source: Your account has been disabled. If you believe this was done in error, please contact us at {support_email}
kk_kz: Есептік жазбаңыз өшірілді. Егер сіз бұл қате жасалды деп ойласаңыз, бізге {support_email} арқылы хабарласыңыз

source: Disabled Account
kk_kz: Есептік жазба бұғатталды

source: Male
kk_kz: Еркек

source: Female
kk_kz: Әйел

source: Other/Prefer Not to Say
kk_kz: Басқа/Айтпауды жөн көру

source: Doctorate
kk_kz: Докторлық дәреже

source: Master's or professional degree
kk_kz: Магистратура немесе специалитет

source: Bachelor's degree
kk_kz: Бакалавриат

source: Associate degree
kk_kz: Маман деңгейі

source: Secondary/high school
kk_kz: Орташа/Толық орташа

source: Junior secondary/junior high/middle school
kk_kz: Аяқталмаған орташа/жоғарғы сыныптар/орташа сыныптар

source: Elementary/primary school
kk_kz: Бастауыш

source: No formal education
kk_kz: Ресми білім жоқ

source: Other education
kk_kz: Басқа білім

source: Post doctorate
kk_kz: Постдокторантура

source: Candidate
kk_kz: Ғылыми дәрежесі

source: {platform_name} Honor Code Certificate for {course_name}
kk_kz: {platform_name} {course_name} курсынан Үздік дәрежелі сертификаты

source: {platform_name} Verified Certificate for {course_name}
kk_kz: {platform_name} {course_name} курсының Расталған сертификаты

source: {platform_name} Professional Certificate for {course_name}
kk_kz: {platform_name} {course_name} курсының Кәсіби сертификаты

source: The company identifier for the LinkedIn Add-to-Profile button e.g 0_0dPSPyS070e0HsE9HNz_13_d11_
kk_kz: Идентификатор компании в LinkedIn вида 0_0dPSPyS070e0HsE9HNz_13_d11_

source: Short identifier for the LinkedIn partner used in the tracking code. (Example: 'edx') If no value is provided, tracking codes will not be sent to LinkedIn.
kk_kz: Краткий идентификатор партнёра LinkedIn, используемый в коде отслеживания (например: 'edx'). Если значение не предусмотрено, код отслеживания не будет отправлен в LinkedIn.

source: {platform_name} Certificate for {course_name}
kk_kz: {course_name} курсының {platform_name} сертификаты

source: The ISO 639-1 language code for this language.
kk_kz: ISO 639-1 тіл коды осы тіл үшін.

source: Namespace of enrollment attribute
kk_kz: Тіркелудің есімдер орны

source: Name of the enrollment attribute
kk_kz: Тіркелген атрибут атауы

source: Value of the enrollment attribute
kk_kz: Тіркеу атрибутының мәні

source: The window of time after enrolling during which users can be granted a refund, represented in microseconds. The default is 14 days.
kk_kz: Тіркелгеннен кейінгі пайдаланушыларға ақшаны кері қайтаруға берілетін уақыт кезеңі микросекундтарда ұсынылады. Әдетте 14 күн.

source: Name of the UTM cookie
kk_kz: UTM cookie файлының атауы

source: Name of the affiliate cookie
kk_kz: Серіктестік cookie файлының атауы

source: Name of this user attribute.
kk_kz: Имя атрибута данного пользователя.

source: Value of this user attribute.
kk_kz: Значение атрибута данного пользователя.

source: Secondary email address
kk_kz: Қосымша электрондық пошта мекенжайы

source: Secondary email address to recover linked account.
kk_kz: Есептік жазбаны қалпына келтіру үшін қосымша электрондық пошта мекенжайы.

source: and
kk_kz: » и «

source: Photos are mismatched
kk_kz: Фотосуреттер сәйкес келмейді

source: Name missing from ID photo
kk_kz: Жеке басын куәландыратын фотосуретте есімі жоқ

source: ID photo not provided
kk_kz: Фотосуреті бар жеке куәлік берілмеген

source: ID is invalid
kk_kz: Жеке куәлік жарамсыз

source: Learner photo is blurry
kk_kz: Оқушының суреті бұлыңғыр

source: Name on ID does not match name on account
kk_kz: Жеке куәліктегі есім есептік жазбадағы есіммен сәйкес келмейді

source: Learner photo not provided
kk_kz: Оқушының фотосуреті берілмеген

source: ID photo is blurry
kk_kz: Жеке куәліктің фотосуреті бұлыңғыр

source: Check your {email_start}{email}{email_end} inbox for an account activation link from {platform_name}. If you need help, contact {link_start}{platform_name} Support{link_end}.
kk_kz: {email_start}{email}{email_end} пошта жәшігінен есептік жазбаны іске қосу үшін {platform_name}-нан келген сілтемені тексеріңіз. Егер сізге көмек қажет болса, {link_start}{platform_name} қызметіне, қолдау бөлімі {link_end} хабарласыңыз.

source: Add a recovery email to retain access when single-sign on is not available. Go to {link_start}your Account Settings{link_end}.
kk_kz: Бірыңғай кіру болмаған кезде кіруді сақтау үшін қалпына келтіру электрондық поштасын қосыңыз. {link_start} есептік жазбаңыздың параметрлері {link_end} бөліміне өтіңіз.

source: The course you are looking for does not start until {date}.
kk_kz: Сіз іздеген курс {date} мерзіміне дейін басталмайды.

source: The course you are looking for is closed for enrollment as of {date}.
kk_kz: Сіз іздеген курс тіркелу үшін {date} мерзіміне жабық.

source: No inactive user with this e-mail exists
kk_kz: Отсутствуют неактивные пользователи с данным адресом электронной почты.

source: Unable to send reactivation email
kk_kz: Невозможно отправить письмо для повторной активации.

source: Course id not specified
kk_kz: Курс сәйкестендіргіші көрсетілмеген

source: Invalid course id
kk_kz: Курстың сәйкестендіргіші дұрыс емес

source: Course id is invalid
kk_kz: Курстың рұқсат етілмеген сәйкестендіргіші

source: Could not enroll
kk_kz: Тіркеуге мүмкіндік болмады

source: You are not enrolled in this course
kk_kz: Сіз осы курсқа тіркелмегенсіз

source: Your certificate prevents you from unenrolling from this course
kk_kz: На данном курсе вы получите или уже получили сертификат об успешном завершении, поэтому вы не можете отменить зачисление на курс.

source: Enrollment action is invalid
kk_kz: Тіркеу қол жетімсіз

source: Please enter a username
kk_kz: Қолданушы атын енгізіңіз

source: Please choose an option
kk_kz: Опцияны таңдаңыз

source: User with username {} does not exist
kk_kz: Аты {} пайдаланушы жоқ

source: Successfully disabled {}'s account
kk_kz: {} пайдаланушының есептік жазбасы ойдағыдай бұғатталды

source: Successfully reenabled {}'s account
kk_kz: {} пайдаланушының есептік жазбасы ойдағыдай бұғаттаудан шығарылды

source: Unexpected account status
kk_kz: Есептік жазбаның күтпеген мәртебесі

source: {html_start}Your account could not be activated{html_end}Something went wrong, please <a href="{support_url}">contact support</a> to resolve this issue.
kk_kz: {html_start} Есептік жазбаңызды іске қосу сәтсіз аяқталды {html_end} бірдеңе дұрыс болмады, осы мәселені шешу үшін <a href="{support_url}"> қолдау тобына </a> хабарласыңыз.

source: {html_start}This account has already been activated.{html_end}
kk_kz: {html_start}Бұл есептік жазба іске қосылды.{html_end}

source: {html_start}Success{html_end} You have activated your account.
kk_kz: {html_start}Сәттілік{html_end} сіз есептік жазбаңызды іске қостыңыз.

source: {html_start}Success! You have activated your account.{html_end}You will now receive email updates and alerts from us related to the courses you are enrolled in. Sign In to continue.
kk_kz: {html_start}Сіз өзіңіздің есептік жазбаңызды сәтті түрде іске қостыңыз!{html_end}енді сіз бізден электрондық пошта жаңартулары мен сіз жазған курстарға қатысты ескертулер аласыз. Жалғастыру үшін жүйеге кіріңіз.

source: No email address provided.
kk_kz: Электрондық пошта мекенжайы көрсетілмеген.

source: Password reset unsuccessful
kk_kz: Парольді шығарып тастау мүмкін болмады

source: Error in resetting your password.
kk_kz: Сіздің пароліңізді өзгерту кезінде қателер туындады.

source: Error in resetting your password. Please try again.
kk_kz: парольді келтіру кезінде кезде қате. Көріңіз тағы да.

source: Valid e-mail address required.
kk_kz: Жарамды электрондық почта мекенжайы талап етіледі.

source: Old email is the same as the new email.
kk_kz: Электрондық почтаның бұрынғы және жаңа мекенжайлары дәл келеді.

source: Cannot be same as your sign in email address.
kk_kz: Кіру электрондық поштасының мекен-жайы сәйкес келмеуі мүмкін.

source: Unable to send email activation link. Please try again later.
kk_kz: Электрондық пошта қосу сілтемесін жіберу мүмкін емес.Әрекетті кейінірек қайталап көріңіз.

source: Deleted the selected configuration(s).
kk_kz: Таңдалған конфигурация(лар)ды жойды.

source: Delete the selected configuration
kk_kz: Таңдалған конфигурацияны жойыңыз

source: Unable to connect with the external provider, please try again
kk_kz: Невозможно подключиться к внешнему провайдеру, пожалуйста, попытайтесь позже.

source: Authentication with {} is currently unavailable.
kk_kz: Қазіргі уақытта {} көмегімен аутентификация қол жетімді емес.

source: Secondary providers are displayed less prominently, in a separate list of "Institution" login providers.
kk_kz: Қосымша провайдерлер "мекеме"кіру провайдерлерінің жеке тізімінде аз көрінеді.

source: The Site that this provider configuration belongs to.
kk_kz: Осы провайдердің конфигурациясы бар Сайт.

source: If this option is enabled, users that visit a "TPA hinted" URL for this provider (e.g. a URL ending with `?tpa_hint=[provider_name]`) will be forwarded directly to the login URL of the provider instead of being first prompted with a login dialog.
kk_kz: Егер бұл опция қосылған болса, бұл провайдер үшін "TPA hinted" URL мекен-жайына кіретін пайдаланушылар (мысалы, `?tpa_hint=[provider_name] URL-мен аяқталатын ), алдымен кіру терезесінің орнына тікелей провайдердің кіру URL мекен-жайына жіберіледі.

source: If this option is enabled, users will not be asked to confirm their details (name, email, etc.) during the registration process. Only select this option for trusted providers that are known to provide accurate user information.
kk_kz: Егер бұл опция қосылған болса, пайдаланушылардан тіркеу процесі кезінде олардың деректерін (аты, электрондық пошта мекенжайы және т.б.) растау сұралмайды. Бұл параметрді пайдаланушылар туралы нақты ақпарат беретін сенімді провайдерлер үшін ғана таңдаңыз.

source: If this option is selected, users will not be required to confirm their email, and their account will be activated immediately upon registration.
kk_kz: Егер бұл параметр таңдалса, пайдаланушыларға өздерінің электрондық пошталарын растаудың қажеті жоқ және есептік жазба тіркелгеннен кейін бірден іске қосылады.

source: If this option is selected, users will be sent a welcome email upon registration.
kk_kz: Егер бұл параметр таңдалса, тіркеу кезінде пайдаланушыларға сәлемдеме хаты жіберіледі.

source: If this option is not selected, users will not be presented with the provider as an option to authenticate with on the login screen, but manual authentication using the correct link is still possible.
kk_kz: Егер бұл опция таңдалмаса, провайдер пайдаланушыларға кіру экранында аутентификация опциясы ретінде ұсынылмайды, бірақ дұрыс сілтемені қолдана отырып қолмен аутентификация жасау әлі де мүмкін.

source: If this option is set, then users logging in using this SSO provider will have their session length limited to no longer than this value. If set to 0 (zero), the session will expire upon the user closing their browser. If left blank, the Django platform session default length will be used.
kk_kz: Егер бұл параметр орнатылса, осы бірыңғай кіру провайдерін пайдаланып жүйеге кіретін пайдаланушылар үшін сеанстың ұзақтығы осы мәннен аспайды. Егер 0 (нөл) мәні орнатылса, пайдаланушы шолғышты жапқаннан кейін сеанстың жарамдылық мерзімі аяқталады. Егер бос қалса, әдепкі Django платформасының сеансының ұзындығы қолданылады.

source: If this option is selected, users will be directed to the registration page immediately after authenticating with the third party instead of the login page.
kk_kz: Егер бұл параметр таңдалса, пайдаланушылар кіру бетінің орнына үшінші тарап аутентификациясынан кейін бірден тіркеу бетіне жіберіледі.

source: Synchronize user profile data received from the identity provider with the edX user account on each SSO login. The user will be notified if the email address associated with their account is changed as a part of this synchronization.
kk_kz: Синхронизируйте личные данные пользователя, полученные от поставщика учетных записей, с учетной записью зарегистрированного пользователя при каждом едином входе в систему. Пользователь будет уведомлен, если электронный адрес, привязанный к учетной записи, будет изменен в ходе данной синхронизации.

source: The Site that this SAML configuration belongs to.
kk_kz: Бұл SAML конфигурациясы бар Сайт.

source: {platform_name} Support
kk_kz: {platform_name} Қолдау

source: Please wait
kk_kz: Күтуіңізді сұраймыз

source: LONG_DATE_FORMAT
kk_kz: %A, %d %B %Y года

source: DATE_TIME_FORMAT
kk_kz: %d %B %Y г. %H:%M

source: SHORT_DATE_FORMAT
kk_kz: %d.%m.%Y

source: TIME_FORMAT
kk_kz: %H:%M

# weekday name
source: Monday
kk_kz: Дүйсенбі

# weekday name
source: Tuesday
kk_kz: Сейсенбі

# weekday name
source: Wednesday
kk_kz: Сәрсенбі

# weekday name
source: Thursday
kk_kz: Бейсенбі

# weekday name
source: Friday
kk_kz: Жұма

# weekday name
source: Saturday
kk_kz: Сенбі

# weekday name
source: Sunday
kk_kz: Жексенбі

# abbreviated weekday name
source: Mon
kk_kz: Дс

# abbreviated weekday name
source: Tue
kk_kz: Сс

# abbreviated weekday name
source: Wed
kk_kz: Ср

# abbreviated weekday name
source: Thu
kk_kz: Бс

# abbreviated weekday name
source: Fri
kk_kz: Жм

# abbreviated weekday name
source: Sat
kk_kz: Сн

# abbreviated weekday name
source: Sun
kk_kz: Жс

# abbreviated month name
source: Jan
kk_kz: янв.

# abbreviated month name
source: Feb
kk_kz: февр.

# abbreviated month name
source: Mar
kk_kz: март

# abbreviated month name
source: Apr
kk_kz: апр.

# abbreviated month name
source: May
kk_kz: май

# abbreviated month name
source: Jun
kk_kz: июнь

# abbreviated month name
source: Jul
kk_kz: июль

# abbreviated month name
source: Aug
kk_kz: авг.

# abbreviated month name
source: Sep
kk_kz: сент.

# abbreviated month name
source: Oct
kk_kz: окт.

# abbreviated month name
source: Nov
kk_kz: нояб.

# abbreviated month name
source: Dec
kk_kz: дек.

# month name
source: January
kk_kz: января
