Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Please Enter the Integer Value for Coupon Discount
kk_kz: Пожалуйста, введите целочисленный код купона для получения скидки.

source: Please Enter the Coupon Discount Value Less than or Equal to 100
kk_kz: Пожалуйста, введите величину скидки по купону, меньшую либо равную 100

source: Please enter the date in this format i-e month/day/year
kk_kz: Пожалуйста, введите дату в этом формате, т. е. месяц/день/год

source: coupon with the coupon code ({code}) added successfully
kk_kz: купон с кодом ({code}) успешно добавлен

source: coupon with the coupon code ({code}) already exists for this course
kk_kz: Купон ({code}) для данного курса уже был активирован.

source: coupon id not found
kk_kz: идентификационный номер купона не найден

source: coupon with the coupon id ({coupon_id}) updated Successfully
kk_kz: купон с идентификационным номером ({coupon_id}) успешно обновлён

source: Instructor
kk_kz: Оқытушы

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
kk_kz: {link_start} студенттерді қабылдау және қатысу туралы түсінік алу үшін кіріңіз {analytics_dashboard_name}, курстарды талдауға арналған жаңа өнім{link_end}.

source: E-Commerce
kk_kz: Электронная коммерция

source: Special Exams
kk_kz: Арнайы емтихандар

source: Certificates
kk_kz: Сертификаты

source: Please Enter the numeric value for the course price
kk_kz: Курс бағасының сандық мәнін енгізіңіз

source: CourseMode with the mode slug({mode_slug}) DoesNotExist
kk_kz: Slug режимі бар курс режимі ({mode_slug}) жоқ

source: CourseMode price updated successfully
kk_kz: Курстың бағасы сәтті жаңартылды

source: Course Info
kk_kz: Курс туралы ақпарат

source: Enrollment data is now available in {dashboard_link}.
kk_kz: Тіркеу деректері енді {dashboard_link} қол жетімді.

source: Membership
kk_kz: Мүшелік

source: Cohorts
kk_kz: Топтар

source: Discussions
kk_kz: Талқылаулар

source: Student Admin
kk_kz: Әкімші студент

source: Extensions
kk_kz: Мерзімдерді ұзарту

source: Data Download
kk_kz: Деректерді көшіріп жүктеу

source: Analytics
kk_kz: Талдау

source: Metrics
kk_kz: Показатели

source: Open Responses
kk_kz: Ашық Жауаптар

source: 0 sent
kk_kz: 0 жіберілді

source: {num_emails} sent
kk_kz: {num_emails} отправлено

source: {num_emails} failed
kk_kz: {num_emails} ошибка

source: Complete
kk_kz: Аяқталды

source: Incomplete
kk_kz: Аяқталған жоқ

source: The enrollment code ({code}) was not found for the {course_name} course.
kk_kz: Не найден регистрационный код ({code}) для курса {course_name}.

source: This enrollment code has been canceled. It can no longer be used.
kk_kz: Этот регистрационный код недействителен. Его уже нельзя использовать.

source: This enrollment code has been marked as unused.
kk_kz: Этот регистрационный код отмечен как неиспользованный.

source: The enrollment code has been restored.
kk_kz: Регистрационный код восстановлен.

source: The redemption does not exist against enrollment code ({code}).
kk_kz: Код зачисления ({code}) невозможно вернуть.

source: Could not find student matching identifier: {student_identifier}
kk_kz: Тиісті оқушы идентификаторын табу мүмкін емес: {student_identifier}

source: Unable to parse date:
kk_kz: Не удалось распознать дату:

source: Couldn't find module for url: {0}
kk_kz: url: {0} сәйкес келетін модуль табылмады

source: Unit {0} has no due date to extend.
kk_kz: {0} Өлшем бірлігінің ұзарту мерзімі жоқ.

source: An extended due date must be later than the original due date.
kk_kz: Ұзартылған төлем күні бастапқы төлем күнінен кеш болуы керек.

source: No due date extension is set for that student and unit.
kk_kz: Срок сдачи задания для этого обучающегося не был продлён.

source: Full Name
kk_kz: Толық аты

source: Extended Due Date
kk_kz: Ұзартылған Мерзім

source: Users with due date extensions for {0}
kk_kz: {0} арналған күн кеңейтулері бар пайдаланушы

source: Due date extensions for {0} {1} ({2})
kk_kz: {0} {1} ({2}) үшін мерзімдерді ұзарту

source: Requested task is already running
kk_kz: Запрошенное задание уже выполняется.

source: Error occured. Please try again later.
kk_kz: Қате пайда болды. Кейінірек қайталап көріңіз.

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
kk_kz: {report_type} есебі жасалады. Есеп күйін көру үшін төмендегі аяқталмаған тапсырмалар бөлімін қараңыз. Есепті аяқталған кезде жүктей аласыз.

source: This component cannot be rescored.
kk_kz: Бұл компонентті қайта сақтау мүмкін емес.

source: This component does not support score override.
kk_kz: Бұл компонент бағалауды қайта анықтауды қолдамайды.

source: Scores must be between 0 and the value of the problem.
kk_kz: Бағалау 0-ден мәселенің мәні арасында болуы керек.

source: Not all problems in entrance exam support re-scoring.
kk_kz: Қабылдау емтихандарындағы барлық мәселелер қайта балл алуды қолдамайды.

source: rescored
kk_kz: Қайта бағаланды

source: overridden
kk_kz: күші жойылды

source: reset
kk_kz: шығарып тасталды

source: deleted
kk_kz: жойылды

source: emailed
kk_kz: Электрондық почтаға жіберілді

source: graded
kk_kz: Бағаланды

source: problem distribution graded
kk_kz: мәселелерді санаттар бойынша бөлу

source: generating_enrollment_report
kk_kz: генерация отчёта о записи на курс

source: certificates generated
kk_kz: жасалған сертификаттар

source: cohorted
kk_kz: распределено по группам

source: First Name
kk_kz: аты

source: Last Name
kk_kz: Тегі

source: Company Name
kk_kz: Компанияның атауы

source: Title
kk_kz: Атауы

source: Year of Birth
kk_kz: Туған жылы

source: Enrollment Date
kk_kz: Тіркеу күні

source: Currently Enrolled
kk_kz: Сейчас записан

source: Enrollment Source
kk_kz: Способ записи

source: Manual (Un)Enrollment Reason
kk_kz: Причина для ручного отчисления (зачисления)

source: Enrollment Role
kk_kz: Роль

source: List Price
kk_kz: Заявленная цена

source: Payment Amount
kk_kz: Cумма платежа

source: Coupon Codes Used
kk_kz: Использованный код купона

source: Registration Code Used
kk_kz: Использованный регистрационный код

source: Payment Status
kk_kz: Статус платежа

source: Transaction Reference Number
kk_kz: Идентификационный номер операции

source: No status information available
kk_kz: Мәртебе туралы қол жетімді ақпарат жоқ

source: No task_output information found for instructor_task {0}
kk_kz: instructor_task {0} арналған task_output ақпарат жоқ

source: No parsable task_output information found for instructor_task {0}: {1}
kk_kz: instructor_task {0}: {1} арналған task_output танылған ақпарат жоқ

source: No parsable status information available
kk_kz: Мәртебенің танылған ақпараты жоқ

source: No message provided
kk_kz: Хабарлар ұсынылмады

source: Invalid task_output information found for instructor_task {0}: {1}
kk_kz: instructor_task {0}: {1} арналған task_output қате ақпарат табылды

source: No progress status information available
kk_kz: Ілгерілеу мәртебесі туралы ақпарат қол жетімді емес

source: No parsable task_input information found for instructor_task {0}: {1}
kk_kz: nstructor_task {0}: {1} арналған task_input ақпараты танылмады

source: Progress: {action} {succeeded} of {attempted} so far
kk_kz: Ілгерілеу: {attempted}-дан ойдағыдай {action} {succeeded}

source: Unable to find submission to be {action} for student '{student}'
kk_kz: '{student}' студенттің {action} болуы тиіс тапсырмасын табу мүмкін болмады

source: Problem failed to be {action} for student '{student}'
kk_kz: '{student}' студенттің тапсырмасы {action} болмады

source: Problem successfully {action} for student '{student}'
kk_kz: '{student}' студенттің тапсырмасы ойдағыдай {action} болды

source: Unable to find entrance exam submission to be {action} for student '{student}'
kk_kz: Студент '{student}' үшін қабылдау емтиханына жіберу {action} мүмкін емес

source: Entrance exam successfully {action} for student '{student}'
kk_kz: студент '{student}' үшін қабылдау емтиханы сәтті {action}

source: Unable to find any students with submissions to be {action}
kk_kz: {action} өтінімі бар студентті табу мүмкін емес

source: Problem failed to be {action} for any of {attempted} students
kk_kz: Бір де бір {attempted} студенттің тапсырмасы {action} болмады

source: Problem successfully {action} for {attempted} students
kk_kz: {attempted} студенттердің тапсырмасы ойдағыдай {action} болды

source: Problem {action} for {succeeded} of {attempted} students
kk_kz: {attempted} студенттерден алынған {succeeded} тапсырма ойдағыдай {action} болды

source: Unable to find any recipients to be {action}
kk_kz: Оларға хабар {action} болуы тиіс алушыларды табу мүмкін болмады

source: Message failed to be {action} for any of {attempted} recipients
kk_kz: Хабар {attempted} алушылардың ешқайсысы үшін {action} болмады

source: Message successfully {action} for {attempted} recipients
kk_kz: Хабар {attempted} алушылар үшін ойдағыдай {action}

source: Message {action} for {succeeded} of {attempted} recipients
kk_kz: {attempted} алушылардан хабар {action} {succeeded}

source: Status: {action} {succeeded} of {attempted}
kk_kz: Мәртебесі: {attempted}-тен {action} {succeeded}

source: (skipping {skipped})
kk_kz: (жіберілді {skipped})

source: (out of {total})
kk_kz: ({total}-дан)

source: This component's access settings refer to deleted or invalid group configurations.
kk_kz: Бұл компоненттің қатынау параметрлері жойылған немесе жарамсыз топтық конфигурацияларға жатады.

source: This unit's access settings refer to deleted or invalid group configurations.
kk_kz: Бұл құрылғының кіру параметрлері қашықтағы немесе жарамсыз топтық конфигурацияларға жатады.

source: This component's access settings refer to deleted or invalid groups.
kk_kz: Бұл компоненттің кіру параметрлері жойылған немесе жарамсыз топтарға жатады.

source: This unit's access settings refer to deleted or invalid groups.
kk_kz: Бұл құрылғының кіру параметрлері жойылған немесе жарамсыз топтарға жатады.

source: This component's access settings contradict its parent's access settings.
kk_kz: Бұл компоненттің кіру параметрлері ата-анасының кіру параметрлеріне қайшы келеді.

source: Whether to display this module in the table of contents
kk_kz: Бұл модульді мазмұн кестесінде көрсету керек пе

source: What format this module is in (used for deciding which grader to apply, and what to show in the TOC)
kk_kz: Бұл модуль қандай форматта орналасқан (қай грейдерді қолдану және TOC-та не көрсету туралы шешім қабылдау үшін қолданылады)

source: Course Chrome
kk_kz: Курс Chrome

source: Enter the chrome, or navigation tools, to use for the XBlock in the LMS. Valid values are: "chromeless" -- to not use tabs or the accordion; "tabs" -- to use tabs only; "accordion" -- to use the accordion only; or "tabs,accordion" -- to use tabs and the accordion.
kk_kz: LMS ішіндегі xblock үшін қолданылатын chrome немесе навигация құралдарын енгізіңіз. Мәндермен болып табылады: "chromeless" - қойындыларды немесе аккордеонды пайдаланбаңыз; "tabs" - тек қойындыларды пайдаланыңыз; "accordion" - тек аккордеонды қолданыңыз; немесе "tabs,accordion" - қойындылар мен аккордеонды пайдалану.

source: Default Tab
kk_kz: Әдепкі қойынды

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
kk_kz: Егер орнатылмаған болса, курс қойындысы таңдалады.

source: LaTeX Source File Name
kk_kz: Бастапқы LaTeX файлының атауы

source: Enter the source file name for LaTeX.
kk_kz: Введите имя исходного файла для LaTeX

source: A dictionary that maps which groups can be shown this block. The keys are group configuration ids and the values are a list of group IDs. If there is no key for a group configuration or if the set of group IDs is empty then the block is considered visible to all. Note that this field is ignored if the block is visible_to_staff_only.
kk_kz: Осы блокта қандай топтарды көрсетуге болатындығын көрсететін сөздік. Кілттер-топ конфигурациясының идентификаторлары, ал мәндер-топ идентификаторларының тізімі. Егер топ конфигурациясы үшін кілт болмаса немесе топ идентификаторларының жиынтығы бос болса, онда блок бәріне көрінетін болып саналады. Егер блок visible_to_staff_only болса, бұл өріс еленбейтініне назар аударыңыз.

source: My Notes
kk_kz: Мои заметки

source: Order Payment Confirmation
kk_kz: Подтверждение платежа

source: Confirmation and Registration Codes for the following courses: {course_name_list}
kk_kz: Подтверждение платежа и регистрационные коды на следующие курсы: {course_name_list}

source: Trying to add a different currency into the cart
kk_kz: Попытка добавить другую валюту в корзину

source: Internal reference code for this invoice.
kk_kz: Внутренний код для этого счёта

source: Customer's reference code for this invoice.
kk_kz: Номер счёта плательщика.

source: The amount of the transaction. Use positive amounts for payments and negative amounts for refunds.
kk_kz: Сумма сделки. Используйте положительную сумму для получения и отрицательную сумму для возврата.

source: Lower-case ISO currency codes
kk_kz: ISO код валюты строчными буквами

source: Optional: provide additional information for this transaction
kk_kz: Опционально: предоставьте дополнительную информацию для данной транзакции

source: The status of the payment or refund. 'started' means that payment is expected, but money has not yet been transferred. 'completed' means that the payment or refund was received. 'cancelled' means that payment or refund was expected, but was cancelled before money was transferred.
kk_kz: Статус оплаты или возврата. "started" означает, что оплата ожидается, но деньги ещё не переведены. "completed" означает, что оплата или возврат был получен. "cancelled" означает, что оплата или возврат платежа был отменён прежде, чем деньги были переведены.

source: The number of items sold.
kk_kz: Количество проданных товаров.

source: The price per item sold, including discounts.
kk_kz: Цена за единицу, включая скидки.

source: Registration for Course: {course_name}
kk_kz: Регистрация на курс: {course_name}

source: Please visit your {link_start}dashboard{link_end} to see your new course.
kk_kz: Пожалуйста, перейдите к {link_start}панели управления{link_end}, чтобы просмотреть свой новый курс.

source: Enrollment codes for Course: {course_name}
kk_kz: Коды для регистрации на курс: {course_name}

source: Mode {mode} does not exist for {course_id}
kk_kz: Режим {mode} не существует для {course_id}

source: {mode_name} for course {course}
kk_kz: {mode_name} для курса {course}

source: You can unenroll in the course and receive a full refund for 14 days after the course start date.
kk_kz: Вы можете отписаться от курса и полностью вернуть средства в течение 14 дней после даты запуска курса.

source: If you haven't verified your identity yet, please start the verification process ({verification_url}).
kk_kz: Если вы ещё не подтвердили свои данные, пройдите по ссылке ({verification_url}).

source: You can unenroll in the course and receive a full refund for 2 days after the course start date.
kk_kz: Вы можете отписаться от курса и полностью вернуть средства в течение 2 дней после даты запуска курса.

source: {refund_reminder_msg}To receive your refund, contact {billing_email}. Please include your order number in your email. Please do NOT include your credit card information.
kk_kz: {refund_reminder_msg} чтобы вернуть деньги, свяжитесь {billing_email}. Пожалуйста, включите в письмо ваш номер заказа. Никому не сообщайте информацию о вашей кредитной карте!

source: We greatly appreciate this generous contribution and your support of the {platform_name} mission. This receipt was prepared to support charitable contributions for tax purposes. We confirm that neither goods nor services were provided in exchange for this gift.
kk_kz: Мы высоко ценим этот щедрый вклад и вашу поддержку миссии платформы «{platform_name}». Этот чек идёт в поддержку благотворительных взносов для целей налогообложения. Мы подтверждаем, что ни товары, ни услуги не были предоставлены в обмен на этот дар.

source: Could not find a course with the ID '{course_id}'
kk_kz: Курс '{course_id}' не обнаружен.

source: Donation for {course}
kk_kz: Пожертвование на курс {course}

source: Donation for {platform_name}
kk_kz: Пожертвование на {platform_name}

source: Page {page_number} of {page_count}
kk_kz: Страница {page_number} из {page_count}

source: Invoice
kk_kz: Счёт-фактура

source: Order
kk_kz: Заказ

source: Date: {date}
kk_kz: Дата: {date}

source: Quantity
kk_kz: Количество

source: List Price per item
kk_kz: Список цен за единицу

source: Discount per item
kk_kz: Скидка за единицу

source: Amount
kk_kz: Сумма

source: Total
kk_kz: Итого

source: Payment Received
kk_kz: Платёж получен

source: Balance
kk_kz: Остаток

source: Billing Address
kk_kz: Адрес плательщика

source: Disclaimer
kk_kz: Оговорка об ограничении ответственности

source: TERMS AND CONDITIONS
kk_kz: ПОЛОЖЕНИЯ И УСЛОВИЯ

source: UNKNOWN REASON
kk_kz: ПРИЧИНА НЕИЗВЕСТНА

source: The payment processor did not return a required parameter: {parameter}
kk_kz: Платёжный сервис не передал нужного параметра: {parameter}

source: The payment processor returned a badly-typed value {value} for parameter {parameter}.
kk_kz: Платёжный сервис передал значение {value} для параметра {parameter} с опечаткой.

source: The payment processor accepted an order whose number is not in our system.
kk_kz: Платёжный сервис принял заказ, которого нет в нашей системе.

source: The amount charged by the processor {charged_amount} {charged_amount_currency} is different than the total cost of the order {total_cost} {total_cost_currency}.
kk_kz: Сумма, взимаемая системой {charged_amount} {charged_amount_currency} отличается от общей стоимости заказа {total_cost} {total_cost_currency}.

source: Sorry! Our payment processor did not accept your payment. The decision they returned was {decision}, and the reason was {reason}. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}.
kk_kz: Извините! Платёжная система не приняла ваш платёж. Полученный ответ: {decision}, причина: {reason}. Денежные средства не были сняты с вашего счёта. Пожалуйста, попробуйте другой способ оплаты. По вопросам оплаты свяжитесь с нами по адресу {email}.

source: Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data! We apologize that we cannot verify whether the charge went through and take further action on your order. The specific error message is: {msg} Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
kk_kz: К сожалению, наша система платежей прислала подтверждение оплаты с противоречивыми данными. Примите наши извинения: мы не можем проверить, прошёл ли платёж и предпринять дальнейшие действия в отношении вашего заказа. Содержание сообщения об ошибке: {msg}. Возможно, денежные средства были сняты с вашей кредитной карты. По вопросам оплаты свяжитесь с нами по адресу {email}.

source: Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: {msg}. Your credit card has probably been charged. Contact us with payment-specific questions at {email}.
kk_kz: Извините! По ошибке с вашего счёта была списана сумма, отличающаяся от стоимости заказа! Сообщение об ошибке: {msg}. Скорее всего, денежные средства были сняты с вашей кредитной карты. По вопросам оплаты свяжитесь с нами по адресу {email}.

source: Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: {msg}. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
kk_kz: Извините! Наша платёжная система отправила обратно подтверждение оплаты, которое имело противоречивые данные, поэтому мы не в состоянии проверить, пришло ли сообщение действительно от платёжной системы. Сообщение об ошибке: {msg}. Приносим свои извинения: мы не можем проверить, прошёл ли платёж и предпринять дальнейшие действия в отношении вашего заказа. Возможно, денежные средства были сняты с вашей кредитной карты. По вопросам оплаты свяжитесь с нами по адресу {email}.

source: Sorry! Our payment processor sent us back a message saying that you have cancelled this transaction. The items in your shopping cart will exist for future purchase. If you feel that this is in error, please contact us with payment-specific questions at {email}.
kk_kz: Извините! Наша система оплаты отправила нам сообщение о том, что вы отменили эту транзакцию. Покупки останутся в вашей корзине. Если вы считаете, что это ошибка, пожалуйста, свяжитесь с нами по вопросам оплаты по {email}.

source: We're sorry, but this payment was declined. The items in your shopping cart have been saved. If you have any questions about this transaction, please contact us at {email}.
kk_kz: Приносим свои извинения: платёж отклонён. Список товаров в вашей корзине был сохранён. Если у вас возникли вопросы об этой операции, пожалуйста, свяжитесь с нами по адресу {email}.

source: Sorry! Your payment could not be processed because an unexpected exception occurred. Please contact us at {email} for assistance.
kk_kz: Извините! Ваш платёж не может быть обработан из-за возникновения непредвиденной ситуации. Пожалуйста, свяжитесь с нами по адресу {email} для помощи.

source: Successful transaction.
kk_kz: Транзакция успешна.

source: The request is missing one or more required fields.
kk_kz: В запросе не заполнено как минимум одно обязательное поле.

source: One or more fields in the request contains invalid data.
kk_kz: Как минимум одно из полей в запросе содержит некорректные данные.

source: The merchant reference code for this authorization request matches the merchant reference code of another authorization request that you sent within the past 15 minutes. Possible action: Resend the request with a unique merchant reference code.
kk_kz: За последние 15 минут вы отправили запрос на авторизацию с таким же кодом продавца. Отправьте повторный запрос с новым кодом продавца.

source: Only a partial amount was approved.
kk_kz: Сумма была одобрена лишь частично.

source: General system failure.
kk_kz: Общий отказ системы.

source: The request was received but there was a server timeout. This error does not include timeouts between the client and the server.
kk_kz: Запрос получен, но сервер не успел его обработать. Истечение срока ожидания соединения между клиентом и сервером не вызывает эту ошибку.

source: The request was received, but a service did not finish running in time.
kk_kz: Запрос получен, но сервис не успел его обработать.

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the Address Verification System (AVS).
kk_kz: Запрос авторизации был одобрен банком, но отклонён CyberSource, так как он не прошёл систему верификации адреса (AVS).

source: The issuing bank has questions about the request. You do not receive an authorization code programmatically, but you might receive one verbally by calling the processor. Possible action: retry with another form of payment.
kk_kz: Банк, выпустивший карту, пока не может одобрить платёж. Код авторизации не будет выслан, но вы можете узнать его у представителей банка. Получите код или используйте другой способ оплаты.
