Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Your current verification will expire in {days} days. {start_link}Re-verify your identity now{end_link} using a webcam and a government-issued photo ID.
kk_kz: Ағымдағы тексеру мерзімі {days} күннен кейін аяқталады. {start_link}веб-камера мен Үкімет берген жеке куәліктің көмегімен жеке куәлігіңізді қазір{end_link} қайта растаңыз.

source: Pursue a {cert_name_long} to highlight the knowledge and skills you gain in this course.
kk_kz: Получите {cert_name_long}, чтобы подтвердить знания и навыки, приобретённые вами при прохождении курса.

source: It's official. It's easily shareable. It's a proven motivator to complete the course. {line_break}{link_start}Learn more about the verified {cert_name_long}{link_end}.
kk_kz: Это официальный сертификат. О нём легко рассказать. Стремление получить такой сертификат мотивирует закончить курс. {line_break}{link_start}Узнать больше о подтверждённом {cert_name_long}{link_end}.

source: You have completed this course and are eligible to purchase course credit. Select <strong>Get Credit</strong> to get started.
kk_kz: Вы завершили курс, теперь вы имеете право получить зачётные единицы за курс. Для этого нажмите <strong>Получить зачёт</strong>.

source: You are now eligible for credit from {provider}. Congratulations!
kk_kz: Енді сіз{provider}-ден кредит алуға құқығыңыз бар. Құттықтаймын!

source: Get Credit
kk_kz: Кредит алу

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select <b>Request Credit</b> to get started.
kk_kz: Благодарим за оплату. Для получения зачёта вам необходимо отправить соответствующий запрос на веб-сайте {link_to_provider_site}. Нажмите <b>Запросить зачётные единицы</b> для начала.

source: Request Credit
kk_kz: Кредит Сұрау

source: {provider_name} has received your course credit request. We will update you when credit processing is complete.
kk_kz: {provider_name} курсқа қабылдау туралы сұрауыңызды алды. Бұл туралы несиені өңдеу аяқталған кезде хабарлаймыз.

source: View Details
kk_kz: Толық ақпаратты қарау

source: <b>Congratulations!</b> {provider_name} has approved your request for course credit. To see your course credit, visit the {link_to_provider_site} website.
kk_kz: <b>Поздравляем!</b> {provider_name} утвердил ваш запрос о зачётных единицах. Для просмотра перейдите по ссылке {link_to_provider_site}.

source: View Credit
kk_kz: Кредитті Қарау

source: {provider_name} did not approve your request for course credit. For more information, contact {link_to_provider_site} directly.
kk_kz: {provider_name} курсқа қабылдау туралы сұрауыңызды қанағаттандырмады. Қосымша ақпарат алу үшін тікелей хабарласыңыз {link_to_provider_site}.

source: An error occurred with this transaction. For help, contact {support_email}.
kk_kz: Бұл транзакцияда қате пайда болды. Көмек алу үшін {support_email} мекен-жайына хабарласыңыз.

source: Current Verification Status: Approved
kk_kz: Текущий статус подтверждения личности: подтверждено

source: Your edX verification has been approved. Your verification is effective for one year after submission.
kk_kz: Вы успешно прошли подтверждение личности. Данный статус сохраняется в течение года после отправки данных.

source: Current Verification Status: Pending
kk_kz: Текущий статус подтверждения личности: ожидание рассмотрения

source: Your edX ID verification is pending. Your verification information has been submitted and will be reviewed shortly.
kk_kz: Данные для подтверждения вашей личности ожидают проверки. Ваши фотографии отправлены и скоро будут отсмотрены.

source: Current Verification Status: Denied
kk_kz: Текущий статус подтверждения личности: отклонено

source: Your verification submission was not accepted. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
kk_kz: Ваш запрос на подтверждения личности отклонён. Для получения подтверждённого сертификата вам необходимо отправить новые фотографии себя и удостоверяющего личность документа до окончания срока подтверждения личности в курсе.

source: Your verification was denied for the following reasons:
kk_kz: Ваш запрос на подтверждение личности отклонён по следующим причинам:

source: Resubmit Verification
kk_kz: Растауды қайта жіберу

source: Current Verification Status: Expired
kk_kz: Текущий статус подтверждения личности: истёк срок действия

source: Your verification has expired. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
kk_kz: Срок действия подтверждения вашей личности истёк. Для получения подтверждённого сертификата вам необходимо отправить новые фотографии себя и удостоверяющего личность документа до окончания срока подтверждения личности в курсе.

source: Could Not Link Accounts
kk_kz: Невозможно связать учётные записи

source: The {provider_name} account you selected is already linked to another {platform_name} account.
kk_kz: Сіз таңдаған {provider_name} есептік жазбасы басқа {platform_name} есептік жазбасымен байланысты.

source: We're sorry to see you go! Please share your main reason for unenrolling.
kk_kz: Мы сожалеем, что вы покидаете курс! Пожалуйста, расскажите, какова основная причина вашего ухода?

source: I just wanted to browse the material
kk_kz: Мен жай ғана материалды қарап шыққым келді

source: This won't help me reach my goals
kk_kz: Бұл менің мақсаттарыма жетуге көмектеспейді

source: I don't have the time
kk_kz: Менде уақыт жоқ

source: I don't have the academic or language prerequisites
kk_kz: Менде академиялық немесе тілдік алғышарттар жоқ

source: I don't have enough support
kk_kz: Менде қолдау жеткіліксіз

source: I am not happy with the quality of the content
kk_kz: Мен мазмұн сапасына риза емеспін

source: The course material was too hard
kk_kz: Мен мазмұн сапасына риза емеспін

source: The course material was too easy
kk_kz: Курстың материалы өте қарапайым болды

source: Something was broken
kk_kz: Бір нәрсе бұзылды

source: Other
kk_kz: Басқа

source: Thank you for sharing your reasons for unenrolling.
kk_kz: Тіркеуден бас тарту себептерімен бөліскеніңіз үшін рахмет.

source: You are unenrolled from
kk_kz: Сіз тіркелмегенсіз

source: Return To Dashboard
kk_kz: Бақылау Тақтасына Оралыңыз

source: Browse Courses
kk_kz: Курстарды Қарау

source: Results:
kk_kz: Нәтижелер:

source: Topic:
kk_kz: Тақырыбы:

source: Show Discussion
kk_kz: Талқылауды көрсету

source: To view live discussions, click Preview or View Live in Unit Settings.
kk_kz: Чтобы просмотреть активные темы обсуждения, нажмите «Предварительный просмотр» или «Просмотр курса» в настройках блока.

source: Discussion ID: {discussion_id}
kk_kz: Идентификатор обсуждения: {discussion_id}

source: Discussion topics list
kk_kz: Талқыланатын тақырыптар тізімі

source: Filter Topics
kk_kz: Тақырыптарды сүзу

source: filter topics
kk_kz: тақырыптарды сүзу

source: All Discussions
kk_kz: Барлық Талқылаулар

source: Posts I'm Following
kk_kz: Мен бақылайтын хабарлар

source: Filter:
kk_kz: Сүзгі:

source: Show all posts
kk_kz: Барлық хаттарды көрсету

source: Unread posts
kk_kz: Оқылмаған хабарлар

source: Unanswered posts
kk_kz: Сообщения без ответов

source: Flagged
kk_kz: Таңбаланған

source: Group:
kk_kz: Тобы:

source: in all groups
kk_kz: барлық топтарда

source: Sort:
kk_kz: Сұрыптау:

source: by recent activity
kk_kz: соңғы қызметі бойынша

source: by most activity
kk_kz: көптеген қызмет түрлері бойынша

source: by most votes
kk_kz: көпшілік дауыспен

source: Student Notes
kk_kz: Студенттік жазбалар

source: Highlights and notes you've made in course content
kk_kz: Курстың мазмұнында жасаған маңызды сәттер мен жазбалар

source: Search notes for:
kk_kz: Іздеу үшін ескертулер:

source: Search notes for...
kk_kz: Жазбаларды іздеу...

source: View notes by:
kk_kz: Көру белгілер бойынша:

source: You have not made any notes in this course yet. Other students in this course are using notes to:
kk_kz: Сіз бұл курста әлі жазба жасаған жоқсыз. Осы курстың басқа студенттері жазбаларды пайдаланады:

source: Mark a passage or concept so that it's easy to find later.
kk_kz: Отметить отрывок или понятие, чтобы их впоследствии было легко найти.

source: Record thoughts about a specific passage or concept.
kk_kz: Белгілі бір үзінді немесе тұжырымдама туралы ойларды жазыңыз.

source: Highlight important information to review later in the course or in future courses.
kk_kz: Курс барысында немесе болашақ курстарда одан әрі оқу үшін маңызды ақпаратты бөліп алыңыз.

source: Get started by making a note in something you just read, like {section_link}.
kk_kz: {Section_link} сияқты жаңа оқыған нәрсеңізге белгі қоюдан бастаңыз.

source: Hide notes
kk_kz: Жасырын ескертулер

source: Show notes
kk_kz: Ескертулерді көрсету

source: You're almost there! Use the link to activate your account to access engaging, high-quality {platform_name} courses. Note that you will not be able to log back into your account until you have activated it.
kk_kz: Уже почти всё! Для доступа к занимательным, высококачественным курсам на платформе «{platform_name}» активируйте свою учётную запись с помощью указанной ссылки. Вы не сможете зайти в свою учётную запись до её активации.

source: Enjoy learning with {platform_name}.
kk_kz: Успехов в обучении на платформе «{platform_name}»!

source: If you need help, please use our web form at {support_url} or email {support_email}.
kk_kz: Если вам нужна помощь, используйте форму помощи {support_url} или напишите нам e-mail по адресу {support_email}.

source: This email message was automatically sent by {lms_url} because someone attempted to create an account on {platform_name} using this email address.
kk_kz: Это письмо было автоматически отправлено {lms_url}, так как кто-то использовал этот электронный адрес для создания учётной записи на платформе «{platform_name}».

source: Action Required: Activate your {platform_name} account
kk_kz: Требуется активация учётной записи на платформе «{platform_name}»

source: Thank you for your purchase of
kk_kz: Спасибо за оплату, внесённую за

source: Your payment was successful.
kk_kz: Сіздің төлеміңіз сәтті өтті.

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
kk_kz: Егер сізде төлемдерге байланысты сұрақтар болса, FAQ ({faq_url}) оқыңыз немесе {billing_email} жазыңыз.

source: If you have billing questions, please contact {billing_email}.
kk_kz: Егер сізде төлемдерге байланысты сұрақтар болса, {billing_email} жазыңыз.

source: {order_placed_by} placed an order and mentioned your name as the Organization contact.
kk_kz: {order_placed_by} тапсырыс берді және сіздің атыңызды ұйымның байланыс тұлғасы ретінде атап өтті.

source: {order_placed_by} placed an order and mentioned your name as the additional receipt recipient.
kk_kz: {order_placed_by} поместите заказ и укажите ваше имя в качестве дополнительной расписки получателя.

source: The items in your order are:
kk_kz: Сіздің тапсырысыңыздағы нысандар

source: Quantity - Description - Price
kk_kz: Саны – Сипаттамасы -Бағасы

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
kk_kz: Кредиттік немесе дебиттік картамен барлығы төлеуге берлген: {currency_symbol}{total_cost}

source: Company Name:
kk_kz: компанияның атауы:

source: Purchase Order Number:
kk_kz: Сатып алуға тапсырыс нөмірі:

source: Company Contact Name:
kk_kz: Компанияның байланыс аты:

source: Company Contact Email:
kk_kz: Компанияның байланыс электрондық поштасы:

source: Recipient Name:
kk_kz: Алушының аты:

source: Recipient Email:
kk_kz: Алушының электрондық поштасының мекенжайы:

source: Order Number: {order_number}
kk_kz: тапсырыс нөмірі: {order_number}

source: A CSV file of your registration URLs is attached. Please distribute registration URLs to each student planning to enroll using the email template below.
kk_kz: Тіркелген URL мекенжайлары бар CSV файлы. Төмендегі электрондық пошта шаблонын пайдаланып тіркелуді жоспарлаған әр оқушыға тіркеу URL мекен-жайын таратыңыз.

source: Warm regards,
kk_kz: Жылы лебізбен,

source: Warm regards,<br>The {platform_name} Team
kk_kz: Жылы лебізбен,<br> {platform_name} командасы

source: Dear [[Name]]
kk_kz: Құрметті [[Name]]

source: To enroll in {course_names} we have provided a registration URL for you. Please follow the instructions below to claim your access.
kk_kz: {Course_names}-ге тіркелу үшін біз сізге тіркелу үшін URL мекен-жайын ұсындық. Кіру үшін төмендегі нұсқауларды орындаңыз.

source: Your redeem url is: [[Enter Redeem URL here from the attached CSV]]
kk_kz: Сіздің URL мекен-жайыңыз: [[Enter Redeem URL here from the attached CSV]]

source: (1) Register for an account at {site_name}
kk_kz: (1) есептік жазбаңызға {site_name} мекен-жайы бойынша тіркеліңіз

source: (2) Once registered, copy the redeem URL and paste it in your web browser.
kk_kz: (2) тіркелгеннен кейін сатып алу үшін URL мекенжайын көшіріп, оны веб-браузерге қойыңыз.

source: (3) On the enrollment confirmation page, Click the 'Activate Enrollment Code' button. This will show the enrollment confirmation.
kk_kz: (3) тіркеуді растау бетінде "тіркеу кодын іске қосу" түймесін басыңыз. Бұл тіркеуді Растауды көрсетеді.

source: (4) You should be able to click on 'view course' button or see your course on your student dashboard at {url}
kk_kz: (4) сіз "курсты қарау" түймесін басуыңыз керек немесе курсыңызды {url} мекен-жайы бойынша студенттердің басқару тақтасында көре аласыз

source: (5) Course materials will not be available until the course start date.
kk_kz: (5) курс материалдары курс басталғанға дейін қол жетімді болмайды.

source: <p>Sincerely,</p><p>[[Your Signature]]</p>
kk_kz: <p>Шынайылықпен,</p><p>[[Your Signature]]</p>

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us immediately. Contact information is listed at:
kk_kz: Подтверждаем смену электронного адреса, связанного с вашей учётной записью на платформе «{platform_name}», с {old_email} на {new_email}. Если вы не делали такого запроса, пожалуйста, свяжитесь с нами по адресу:

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
kk_kz: Бізде ескі электрондық хабарлардың тізілімі сақталуда, сондықтан егер осы сұраныс абайсыз істелінсе, біз осы проблеманы қарастыра аламыз.

source: Request to change {platform_name} account e-mail
kk_kz: Запрос на смену электронного адреса учётной записи на платформе «{platform_name}»

source: Sorry! The photos you submitted for ID verification were not accepted, for the following reason(s):
kk_kz: Кешіріңіз! Жеке басын тексеру үшін жіберген фотосуреттер келесі себеп(тер)мен қабылданбаған:

source: The photo(s) of you:
kk_kz: Сіздің фотосурет(тер)іңіз :

source: The photo of you:
kk_kz: Сіздің фотосуретіңіз :

source: The photo of your ID:
kk_kz: Жеке куәліктің фотосуреті:

source: Other Reasons:
kk_kz: Басқа Себептер:

source: Resubmit Verification: {reverify_url}
kk_kz: Растауды қайта жіберу: {reverify_url}

source: ID Verification FAQ: {faq_url}
kk_kz: Идентификаторды растау туралы жиі қойылатын сұрақтар: {faq_url}

source: Thank you,
kk_kz: Рахмет,

source: The {platform_name} team
kk_kz: {platform_name} командасы

source: Your payment was successful. You will see the charge below on your next credit or debit card statement under the company name {merchant_name}.
kk_kz: Сіздің төлеміңіз сәтті өтті. Сіз төлем сомасын төменде компания {merchant_name} деп аталатын несие немесе дебеттік карта бойынша келесі үзінді көшірмеден көресіз.

source: Your order number is: {order_number}
kk_kz: Сіздің тапсырысыңыздың нөмірі: {order_number}

source: Hi {full_name},
kk_kz: Здравствуйте, {full_name}!

source: Thanks for submitting your photos!
kk_kz: Фотосуреттеріңізді жібергеніңіз үшін рахмет!

source: Thank you for purchasing enrollments in {course_name}.
kk_kz: Спасибо за оплату регистрации на {course_name}.

source: An invoice for {currency_symbol}{total_price} is attached. Payment is due upon receipt. You can find information about payment methods on the invoice.
kk_kz: Счёт на сумму {currency_symbol}{total_price} прилагается. Оплата производится при получении. Информация о способах оплаты находится на бланке счёта.

source: A .csv file that lists your enrollment codes is attached. You can use the email template below to distribute enrollment codes to your students. Each student must use a separate enrollment code.
kk_kz: В приложении находится файл в формате CSV со списками кодов для записи на курс. Вы можете использовать приведённый ниже шаблон электронного сообщения для рассылки кодов обучающимся. Каждый слушатель курса должен использовать отдельный код для записи на курс.

source: Thanks, The {platform_name} Team
kk_kz: С благодарностью, Команда {platform_name}

source: Dear [[Name]]:
kk_kz: Уважаемый/ая [[Имя]]:

source: We have provided a course enrollment code for you in {course_name}. To enroll in the course, click the following link:
kk_kz: Вам предоставлен код для записи на курс {course_name}. Чтобы записаться на курс, щёлкните по следующей ссылке:

source: HTML link from the attached CSV file
kk_kz: Ссылка HTML из приложенного файла в формате CSV

source: After you enroll, you can see the course on your student dashboard. You can see course materials after the course start date.
kk_kz: Записавшись на курс, вы сможете увидеть его на своей панели управления. Вы сможете посмотреть материалы курса после даты начала курса.

source: Sincerely, [[Your Signature]]
kk_kz: С уважением, [[Ваша подпись]]

source: INVOICE
kk_kz: СЧЁТ-ФАКТУРА

source: Invoice No: {invoice_number}
kk_kz: Счёт-фактура №: {invoice_number}

source: Terms: Due Upon Receipt
kk_kz: Условия: оплата по получении

source: Due Date: {date}
kk_kz: Срок оплаты: {date}

source: Bill to:
kk_kz: Счёт на:

source: Customer Reference Number: {reference_number}
kk_kz: Регистрационный номер покупателя: {reference_number}

source: Balance Due: {currency_symbol}{sale_price}
kk_kz: К оплате: {currency_symbol}{sale_price}

source: Course: {course_name}
kk_kz: Курс: {course_name}

source: Price: {currency_symbol}{course_price} Quantity: {quantity} Sub-Total: {currency_symbol}{sub_total} Discount: {currency_symbol}{discount}
kk_kz: Цена: {currency_symbol}{course_price} Количество: {quantity} Итог: {currency_symbol}{sub_total} Скидка: {currency_symbol}{discount}

source: Total: {currency_symbol}{sale_price}
kk_kz: Итого: {currency_symbol}{sale_price}

source: Payment Instructions
kk_kz: Порядок осуществления платежа

source: If we do not receive payment, the learner enrollments that use these codes will be canceled and learners will not be able to access course materials. All purchases are final. For more information, see the {site_name} cancellation policy.
kk_kz: Если платёж не получен в срок, запись слушателей по этим кодам будет отменена и они не получат доступ к учебным материалам. Платежи необратимы. Подробную информацию вы найдёте в соответствующих правилах сайта {site_name}.

source: For payment questions, contact {contact_email}
kk_kz: С вопросами об оплате обращайтесь по адресу {contact_email}

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at {email}.
kk_kz: Біз өте өкінеміз. Біздің курс қызметкерлері сіздің атыңызды {old_name} - ден {new_name} - ге өзгерту туралы сұрауыңызды мақұлдамады. Егер сізге қосымша көмек қажет болса, курс қызметкерлеріне {email} мекен-жайына жазыңыз.

source: We have successfully verified your identity for the {assessment} assessment in the {course_name} course.
kk_kz: Біз {course_name} курсында {assessment} бағалау үшін сіздің жеке басыңызды сәтті растадық.

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity.
kk_kz: Біз {course_name} курсында {assessment} бағалау үшін сіздің жеке басыңызды растай алмадық. Сіз өзіңіздің жеке басыңызды растау үшін {allowed_attempts} ішінен {used_attempts} қолдандыңыз.

source: You must verify your identity before the assessment closes on {due_date}.
kk_kz: Бағалау {due_date} ішінде аяқталғанға дейін сіз өзіңіздің жеке басыңызды растауыңыз керек.

source: To try to verify your identity again, select the following link:
kk_kz: Жеке басыңызды растау үшін тағы бір рет келесі сілтемеге өтіңіз:

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity, and verification is no longer possible.
kk_kz: Біз {course_name} курсында {assessment} бағалау үшін сіздің жеке басыңызды растай алмадық. Сіз өзіңіздің жеке басыңызды растау үшін {used_attempts} {allowed_attempts} әрекетінен қолдандыңыз, енді тексеру мүмкін емес.

source: To go to the courseware, select the following link:
kk_kz: Оқулыққа өту үшін келесі сілтемеге өтіңіз:

source: If you have any questions, you can contact student support at {support_link}.
kk_kz: Егер сізде сұрақтар туындаса, студенттерді қолдау қызметіне мына мекен-жай бойынша хабарласа аласыз {support_link}

source: Thanks,
kk_kz: Рахмет,

source: This Course Unavailable In Your Country
kk_kz: Осы курс Сіздің бет үшін қолжетімсіз

source: Our system indicates that you are trying to access this {platform_name} course from a country or region in which it is not currently available.
kk_kz: Біздің жүйе сіз қазіргі уақытта қол жетімді емес елден немесе аймақтан осы {platform_name} курсына кіруге тырысқаныңызды көрсетеді.

source: Our system indicates that you are trying to enroll in this {platform_name} course from a country or region in which it is not currently available.
kk_kz: Біздің жүйе сіз қазіргі уақытта қол жетімді емес елден немесе аймақтан осы {platform_name} курсына жазылуға тырысқаныңызды көрсетеді.

source: Enrollment Successful
kk_kz: Тіркелу Сәтті Өтті

source: Thank you for enrolling in {course_names}. We hope you enjoy the course.
kk_kz: Спасибо, что записались на курс {course_names}. Мы надеемся, что курс вам понравится!

source: Thank you for enrolling in:
kk_kz: Тіркелгеніңіз үшін рахмет:

source: We hope you enjoy the course.
kk_kz: Мы надеемся, курс вам понравится!

source: {platform_name} is a nonprofit bringing high-quality education to everyone, everywhere. Your help allows us to continuously improve the learning experience for millions and make a better future one learner at a time.
kk_kz: {platform_name} предоставляет высококачественное некоммерческое образование для всех. Ваша помощь позволяет нам постоянно совершенствоваться и создавать лучшее будущее для миллионов людей по всему миру.

source: Donation Actions
kk_kz: Пожертвования

source: Financial Assistance Application
kk_kz: Қаржылық көмек пайдалану

source: A Note to Learners
kk_kz: Оқушыларға ескерту

source: Dear edX Learner,
kk_kz: Құрметті edX студенті,

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
kk_kz: EdX қаржылық көмегі-бұл кез-келген қаржылық жағдайда студенттерге edX курсын сәтті аяқтағаннан кейін расталған сертификат алуға мүмкіндік беретін бағдарлама.
