Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Expand All Sections
kk_kz: Развернуть разделы

source: Click to open the courseware in the LMS in a new tab
kk_kz: Кликните, чтобы открыть содержание курса в новой вкладке

source: View Live
kk_kz: Просмотр курса

source: Creating your course organization
kk_kz: Создание структуры вашего курса

source: You add sections, subsections, and units directly in the outline.
kk_kz: Разделы, подразделы и блоки можно добавить непосредственно в структуру курса.

source: Create a section, then add subsections and units. Open a unit to add course components.
kk_kz: Создайте раздел, а затем добавьте в него подразделы и блоки. Откройте блок, чтобы добавить содержимое курса.

source: Reorganizing your course
kk_kz: Реорганизация вашего курса

source: Drag sections, subsections, and units to new locations in the outline.
kk_kz: Перетащите разделы, подразделы и блоки в любое место в структуре данного курса.

source: Learn more about the course outline
kk_kz: Узнать больше о структуре курса

source: Setting release dates and grading policies
kk_kz: Настройка дат выпуска и правил оценивания

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
kk_kz: Нажмите на иконку «Настроить» соответствующего раздела или подраздела, чтобы установить его дату выпуска. При настройке подраздела вы также можете определить правила оценивания и срок сдачи заданий.

source: Learn more about grading policy settings
kk_kz: Узнать больше о настройках правил оценивания

source: Changing the content learners see
kk_kz: Изменение материалов, доступных слушателям

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
kk_kz: Чтобы опубликовать предварительную версию материалов, выберите иконку «Опубликовать» в разделе, подразделе или блоке.

source: To make a section, subsection, or unit unavailable to learners, select the Configure icon for that level, then select the appropriate {em_start}Hide{em_end} option. Grades for hidden sections, subsections, and units are not included in grade calculations.
kk_kz: Чтобы закрыть слушателям доступ к разделу, подразделу или блоку, нажмите значок настроек соответствующего элемента и выберите {em_start}«Скрыть»{em_end}. Оценки за скрытые разделы, подразделы и блоки не учитываются при вычислении итоговой оценки.

source: To hide the content of a subsection from learners after the subsection due date has passed, select the Configure icon for a subsection, then select {em_start}Hide content after due date{em_end}. Grades for the subsection remain included in grade calculations.
kk_kz: Чтобы скрыть содержимое подраздела от слушателей по окончании срока его сдачи, нажмите на соответствующий значок настроек, затем выберите {em_start}«Скрыть содержимое по окончании срока»{em_end}. Оценки за подраздел будут учтены при вычислении итоговой оценки.

source: Learn more about content visibility settings
kk_kz: Узнать больше о настройках видимости содержимого

source: Pages
kk_kz: Страницы

source: New Page
kk_kz: Новая страница

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
kk_kz: Внимание: страницы общедоступны. Если у пользователей есть ссылка на страницу, они смогут просматривать её, даже если они не записаны на курс и не вошли на сайт.

source: Show this page
kk_kz: Показать эту страницу

source: Show/hide page
kk_kz: Показать/скрыть страницу

source: This page cannot be reordered
kk_kz: Эта страница не может быть переназначена

source: You can add additional custom pages to your course.
kk_kz: Вы можете добавить свои собственные дополнительные страницы к вашему курсу.

source: Add a New Page
kk_kz: Добавить новую страницу

source: What are pages?
kk_kz: Какие страницы?

source: Pages are listed horizontally at the top of your course. Default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
kk_kz: Названия страниц расположены горизонтально над содержимым курса. После основных страниц (Главная, Курс, Обсуждение, Вики и Прогресс) отображаются учебники и добавленные вами дополнительные страницы.

source: Custom pages
kk_kz: Дополнительные страницы

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
kk_kz: Вы можете создавать и редактировать свои собственные страницы с дополнительными материалами. Например, вы можете добавить страницы с правилами оценивания, презентациями и календарём курса.

source: How do pages look to students in my course?
kk_kz: Как выглядят страницы для слушателей моего курса?

source: Students see the default and custom pages at the top of your course and use these links to navigate.
kk_kz: Слушатели видят страницы в верхней части вашего курса и используют их как ссылки для навигации.

source: See an example
kk_kz: Посмотреть пример

source: Pages in Your Course
kk_kz: Страницы в вашем курсе

source: Preview of Pages in your course
kk_kz: Предварительный просмотр страниц вашего курса

source: Pages appear in your course's top navigation bar. The default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
kk_kz: Названия страниц находятся на верхней навигационной панели. После основных страниц (Главная, Курс, Обсуждение, Вики и Прогресс) отображаются учебники и дополнительные страницы.

source: close modal
kk_kz: закрыть форму

source: Internal Server Error
kk_kz: Внутренняя ошибка сервера

source: The Page You Requested Page Cannot be Found
kk_kz: Запрашиваемая вами страница не может быть найдена

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
kk_kz: Приносим свои извинения. Мы не смогли найти {studio_name} запрашиваемую вами страницу. Вы можете вернуться на главную страницу {studio_name} и повторить попытку. Если проблема всё ещё возникает, {link_start}обратитесь в центр поддержки {studio_name}{link_end} для получения дальнейшей помощи.

source: The Server Encountered an Error
kk_kz: Ошибка сервера

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
kk_kz: Приносим свои извинения. При попытке обработать ваш запрос на сервере возникла ошибка. Вы можете вернуться на главную страницу {studio_name} и повторить попытку. Если ошибка повторится, пожалуйста, {link_start}напишите в службу поддержки {studio_name}{link_end} для получения дальнейшей помощи.

source: Back to dashboard
kk_kz: Вернуться к панели управления

source: Library Export
kk_kz: Экспорт библиотеки

source: Course Export
kk_kz: Экспорт курса

source: About Exporting Libraries
kk_kz: Об экспорте библиотек

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
kk_kz: Вы можете экспортировать библиотеки и редактировать их вне {studio_name}. Экспортируемый файл имеет формат .tar.gz (это файл .tar, сжатый при помощи GNU Zip) и содержит структуру и материалы библиотеки. Вы также можете повторно импортировать ранее экспортированные библиотеки.

source: About Exporting Courses
kk_kz: Об экспорте курса

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
kk_kz: Вы можете экспортировать курсы и редактировать их вне {studio_name}. Экспортируемый файл имеет формат .tar.gz (это файл .tar, сжатый при помощи GNU Zip) и содержит структуру и материалы учебного курса. Вы также можете повторно импортировать ранее экспортированный учебный курс.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
kk_kz: {em_start}Внимание:{em_end} когда вы экспортируете курс, такая информация как ключи MATLAB API, регистрационные данные LTI, секретные строки и URL-адрес хранилища примечаний включаются в экспортируемые данные. Если вы раздаёте экспортируемые файлы, вы можете поделиться конфиденциальной или лицензируемой информацией

source: Export My Library Content
kk_kz: Экспорт содержимого библиотеки

source: Export My Course Content
kk_kz: Экспорт содержимого учебного курса

source: Export Library Content
kk_kz: Экспортировать содержимое библиотеки

source: Export Course Content
kk_kz: Экспортировать содержимое учебного курса

source: Library Export Status
kk_kz: Статус экспорта библиотеки

source: Course Export Status
kk_kz: Статус экспорта курса

source: Preparing
kk_kz: Подготовка

source: Preparing to start the export
kk_kz: Подготовка к началу экспорта

source: Exporting
kk_kz: Экспорт

source: Creating the export data files (You can now leave this page safely, but avoid making drastic changes to content until this export is complete)
kk_kz: Создание файлов с данными для экспорта (теперь Вы можете безопасно покинуть эту страницу, но старайтесь не делать коренных изменений в контенте до тех пор, пока импорт не будет завершён)

source: Compressing
kk_kz: Сжатие

source: Compressing the exported data and preparing it for download
kk_kz: Сжатие экспортированных данных и их подготовка к скачиванию

source: Your exported library can now be downloaded
kk_kz: Теперь вы можете скачать экспортированную библиотеку

source: Your exported course can now be downloaded
kk_kz: Теперь вы можете скачать экспортированный курс

source: Download Exported Library
kk_kz: Скачать экспортированную библиотеку

source: Download Exported Course
kk_kz: Скачать экспортированный курс

source: Data {em_start}exported with{em_end} your course:
kk_kz: Данные, {em_start}экспортируемые вместе{em_end} с вашим курсом:

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
kk_kz: Значения расширенных настроек, включая ключи MATLAB API и регистрационные данные LTI

source: Course Content (all Sections, Sub-sections, and Units)
kk_kz: Содержимое курса (все разделы, подразделы и блоки)

source: Course Structure
kk_kz: Структура курса

source: Individual Problems
kk_kz: Отдельные задачи

source: Course Assets
kk_kz: Файлы курса

source: Course Settings
kk_kz: Настройки курса

source: Data {em_start}not exported{em_end} with your course:
kk_kz: Данные, {em_start}не экспортируемые{em_end} с вашим курсом:

source: User Data
kk_kz: Данные пользователя

source: Course Team Data
kk_kz: Данные о команде курса

source: Forum/discussion Data
kk_kz: Данные форума/обсуждений

source: Why export a library?
kk_kz: Зачем экспортировать библиотеки?

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
kk_kz: Возможно, вы захотите отредактировать XML-файл библиотеки вне {studio_name} или создать резервную копию вашей библиотеки. Также вам может потребоваться копия, чтобы позже импортировать её в другую библиотеку и модифицировать её.

source: Opening the downloaded file
kk_kz: Открытие скачанного файла

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
kk_kz: Используйте программу-архиватор, чтобы извлечь информацию из файла с расширением .tar.gz. Извлечённая информация включает файл library.xml, а также вложенные папки, в которых находится содержимое библиотеки.

source: Learn more about exporting a library
kk_kz: Доп. информация об экспорте библиотеки

source: Why export a course?
kk_kz: Зачем экспортировать курс?

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
kk_kz: Возможно, вы захотите отредактировать XML-файл своего курса вне {studio_name} или создать резервную копию курса. Также вам может потребоваться копия курса, чтобы позже импортировать её в другой курс и модифицировать её.

source: What content is exported?
kk_kz: Какие элементы курса экспортируются?

source: Course dates
kk_kz: Важные даты курса

source: The course team
kk_kz: Команда курса

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
kk_kz: Используйте программу-архиватор, чтобы извлечь информацию из файла с расширением .tar.gz. Извлечённая информация включает файл course.xml, а также вложенные папки, в которых находится содержимое курса.

source: Learn more about exporting a course
kk_kz: Доп. информация об экспорте курса

source: Export Course to Git
kk_kz: Экспортировать курс в Git

source: Export to Git
kk_kz: Экспортировать в Git

source: About Export to Git
kk_kz: Об экспортировании в Git

source: Use this to export your course to its git repository.
kk_kz: Используйте эту возможность, чтобы экспортировать ваш курс в git-репозиторий

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
kk_kz: Это позволит запуститься автоматическому обновлению и обновит содержание вашего курса, видимое для слушателей, если сконфигурированы автоматические настройки импортирования из git

source: Export Course to Git:
kk_kz: Экспортировать курс в Git:

source: giturl must be defined in your course settings before you can export to git.
kk_kz: Для экспорта в git в настройках курса должен быть задан параметр giturl.

source: Export Failed
kk_kz: Ошибка экспорта

source: Export Succeeded
kk_kz: Экспорт успешно завершён

source: Your course:
kk_kz: Ваш курс:

source: Course git url:
kk_kz: Git url курса:

source: Experiment Group Configurations
kk_kz: Наборы экспериментальных групп

source: This module is disabled at the moment.
kk_kz: Этот модуль в данный момент недоступен.

source: Enrollment track groups allow you to offer different course content to learners in each enrollment track. Learners enrolled in each enrollment track in your course are automatically included in the corresponding enrollment track group.
kk_kz: Группы по режимам записи позволяют вам показывать различное содержимое курса слушателям, записанным в разных режимах. Слушатели автоматически распределяются по данным группам в зависимости от режима записи.

source: On unit pages in the course outline, you can restrict access to components to learners based on their enrollment track.
kk_kz: На странице каждого блока в структуре курса вы можете ограничить доступ к компонентам для слушателей с определёнными режимами записи.

source: You cannot edit enrollment track groups, but you can expand each group to view details of the course content that is designated for learners in the group.
kk_kz: Вы не можете изменять группы по режимам записи, но вы можете разрешить каждой группе доступ к содержимому курса, предназначенному для слушателей из этой группы.

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
kk_kz: Если в вашем курсе разрешено использование групп, вы можете создать материалы, ориентированные на различные уровни подготовки ваших слушателей.

source: Each content group that you create can be associated with one or more cohorts. In addition to making course content available to all learners, you can restrict access to some content to learners in specific content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
kk_kz: Каждая созданная группа по изучаемым материалам должна быть связана не менее чем с одной группой в курсе. В дополнение к материалам курса, предназначенным для всех слушателей, вы можете указать, что некоторые материалы доступны только определённым группам. Только члены этих групп получат доступ к дополнительным материалам.

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
kk_kz: Нажмите {em_start}«Новая группа по изучаемым материалам»{em_end}, чтобы добавить новую группу. Чтобы изменить название группы по изучаемым материалам, наведите курсор мыши на соответствующее поле и нажмите {em_start}«Отредактировать»{em_end}. Вы можете удалить группу по изучаемым материалам, только если она не используется ни в одном в блоке. Для удаления наведите курсор мыши на группу и нажмите на значок с корзиной.

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of learners are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
kk_kz: Используйте настройку экспериментальных групп если вы хотите провести А/Б-тестирование материалов вашего курса. Данная настройка определяет, сколько групп слушателей будет участвовать в эксперименте. Когда вы создаёте экспериментальный материал, укажите группы, которые будут его использовать.

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
kk_kz: Нажмите {em_start}«Новый набор групп»{em_end}, чтобы добавить новый набор. Чтобы изменить набор групп, наведите курсор мыши на соответствующее поле и нажмите {em_start}«Отредактировать»{em_end}. Вы можете удалить набор групп, только если он не используется в эксперименте. Для этого наведите курсор мыши на набор и нажмите на значок корзины.

source: Details & Schedule
kk_kz: Подробности и расписание

source: Welcome
kk_kz: Добро пожаловать

source: Welcome to {studio_name}
kk_kz: Добро пожаловать в {studio_name}

source: {studio_name} helps manage your online courses, so you can focus on teaching them
kk_kz: {studio_name} помогает управлять онлайн-курсами, позволяя вам сосредоточиться на процессе преподавания

source: {studio_name}'s Many Features
kk_kz: Множество возможностей {studio_name}

source: {studio_name} Helps You Keep Your Courses Organized
kk_kz: {studio_name} Поможет вам систематизировать свои курсы

source: Enlarge image
kk_kz: Увеличить изображение

source: Keeping Your Course Organized
kk_kz: Структурирование курсов

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
kk_kz: В основе любого курса лежит его структура. В {studio_name} есть редактор {strong_start}структуры{strong_end}, который создаст простую иерархию разделов и позволит перетаскивать элементы с помощью мыши. Это поможет вам организовать свою работу и работу ваших студентов.

source: Simple Organization For Content
kk_kz: Простая организация материалов

source: {studio_name} uses a simple hierarchy of {strong_start}sections{strong_end} and {strong_start}subsections{strong_end} to organize your content.
kk_kz: {studio_name} предлагает простую иерархию {strong_start}разделов{strong_end} и {strong_start}подразделов{strong_end} для организации материалов курса.

source: Change Your Mind Anytime
kk_kz: Вы всегда можете всё изменить

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
kk_kz: Составьте примерную структуру курса и наполняйте её содержимым с любого места. С помощью перетаскивания вы сможете быстро перегруппировать элементы курса.

source: Go A Week Or A Semester At A Time
kk_kz: Распределите работу по неделям или семестрам

source: Build and release {strong_start}sections{strong_end} to your students incrementally. You don't have to have it all done at once.
kk_kz: Создавайте {strong_start}разделы{strong_end} и открывайте их студентам постепенно. Не обязательно делать всё сразу.

source: Learning is More than Just Lectures
kk_kz: Обучение – это не только лекции

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
kk_kz: {studio_name} позволяет сообща менять ваш курс, чтобы слушатели достигли наилучших результатов в обучении. Вставляйте видео, обсуждения и всевозможные упражнения всего в несколько кликов.

source: Create Learning Pathways
kk_kz: Создание направленного обучения

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
kk_kz: Помогайте осваивать каждое понятие, используя мультимедиа, документы HTML и упражнения.

source: Work Visually, Organize Quickly
kk_kz: Быстрая организация наглядной работы

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
kk_kz: Работая с наглядными инструментами, вы будете видеть именно то, что увидят слушатели. Приведите курс в порядок, просто перетащив материалы на нужное место.

source: A Broad Library of Problem Types
kk_kz: Широкий выбор типов заданий

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
kk_kz: Предложите слушателям больше, чем вопросы с вариантами ответов. {studio_name} поддерживает более десятка видов заданий для проверки полученных знаний.

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
kk_kz: {studio_name} создаёт возможность простой, быстрой и частичной публикации. С друзьями.

source: Simple, Fast, and Incremental Publishing. With Friends.
kk_kz: Публикуйте свои материалы просто, быстро и постепенно. С коллегами.

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
kk_kz: {studio_name} работает как уже известные вам веб-приложения, но понимает, как устроен ваш план обучения. Моментальная публикация в сети, когда вам это необходимо, целесообразное открытие доступа к материалам по частям. И, вместе со своими соавторами, вы можете составлять курс всей командой.

source: Instant Changes
kk_kz: Мгновенные изменения
