Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: IN PARTICULAR, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL HAVE ANY LIABILITY FOR ANY CONSEQUENTIAL, INDIRECT, PUNITIVE, SPECIAL, EXEMPLARY OR INCIDENTAL DAMAGES, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT {platform_name} OR ANY OF THE {platform_name} PARTICIPANTS HAS BEEN NEGLIGENT OR OTHERWISE AT FAULT (INCLUDING, BUT NOT LIMITED TO, CLAIMS FOR DEFAMATION, ERRORS, LOSS OF PROFITS, LOSS OF DATA OR INTERRUPTION IN AVAILABILITY OF DATA).
kk_kz: Атап айтқанда, қолданыстағы заңмен рұқсат етілген максималды дәрежеде {platform_name} де, қатысушылардың ешқайсысы {platform_name} кез-келген жанама, жанама, айыппұл, ерекше, шамамен немесе кездейсоқ шығындар үшін алдын-ала болжанатын немесе болжанбаған және {platform_name} немесе кез-келген қатысушы {platform_name} немқұрайды немесе басқа жолмен кінәлі (диффамация, қателер, жоғалған пайда, деректердің жоғалуы туралы шағымдарды қоса, бірақ олармен шектелмейді, немесе деректердің қол жетімділігін үзу).

source: CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.
kk_kz: КЕЙБІР МЕМЛЕКЕТТЕРДІҢ ЗАҢДАРЫ БОЛЖАМДЫ КЕПІЛДІКТЕРГЕ НЕМЕСЕ БЕЛГІЛІ БІР ШЫҒЫНДАРДЫ АЛЫП ТАСТАУҒА НЕМЕСЕ ШЕКТЕУГЕ ЖОЛ БЕРМЕЙДІ. ЕГЕР БҰЛ ЗАҢДАР СІЗГЕ ҚАТЫСТЫ БОЛСА, ЖОҒАРЫДА АТАЛҒАН КЕЙБІР НЕМЕСЕ БАРЛЫҚ ЖАУАПКЕРШІЛІКТЕН БАС ТАРТУ, АЛЫП ТАСТАУ НЕМЕСЕ ШЕКТЕУЛЕР СІЗГЕ ҚАТЫСТЫ БОЛМАУЫ МҮМКІН ЖӘНЕ СІЗДЕ ҚОСЫМША ҚҰҚЫҚТАР БОЛУЫ МҮМКІН.

source: The APIs and API Content may include hyperlinks to sites maintained or controlled by others and not affiliated with or under the control of {platform_name}. {platform_name_capitalized} and the {platform_name} Participants are not responsible for and do not routinely screen, approve, review or endorse the contents of or use of any of the products or services that may be offered at these third-party sites. If you decide to access linked third-party websites, you do so at your own risk.
kk_kz: API және API мазмұны басқа адамдар қолдайтын немесе бақылайтын және байланысты емес немесе бақыланатын сайттарға гиперсілтемелерді қамтуы мүмкін {platform_name}. {platform_name_capitalized} және {platform_name} қатысушылары жауап бермейді және әдетте осы үшінші тарап сайттарында ұсынылуы мүмкін кез-келген өнімдер мен қызметтердің мазмұнын немесе қолданылуын қабылдамайды, мақұлдамайды, қарамайды немесе мақұлдамайды. Егер сіз байланысты үшінші тарап веб-сайттарына кіруді шешсеңіз, сіз мұны өз тәуекеліңізбен жасайсыз.

source: To the maximum extent permitted by applicable law, you agree to defend, hold harmless and indemnify {platform_name} and the {platform_name} Participants, and their respective subsidiaries, affiliates, officers, faculty, students, fellows, governing board members, agents and employees from and against any third-party claims, actions or demands arising out of, resulting from or in any way related to your use of the APIs and any API Content, including any liability or expense arising from any and all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature. In such a case, {platform_name} or one of the {platform_name} Participants will provide you with written notice of such claim, action or demand.
kk_kz: Қолданыстағы заңмен рұқсат етілген ең жоғары деңгейде сіз {platform_name} және қатысушылар {platform_name}, сондай-ақ олардың тиісті еншілес компанияларына, үлестес тұлғаларға, лауазымды тұлғаларға, оқытушыларға, студенттерге, стипендиаттарға, Басқарма мүшелеріне, агенттерге және қызметкерлерге сіздің API және кез келген API мазмұнын пайдаланудан туындайтын немесе қандай да бір жолмен байланысты кез келген шағымдардан, шығындардан, шығыннан (нақты және нақты шығындардан) туындайтын кез келген жауапкершіліктен немесе шығындардан қорғауға, қорғауға және өтеуге келісесіз.сот шешімдері, сот шығындары және адвокаттардың кез-келген түрі мен табиғаты. Мұндай жағдайда {platform_name} немесе қатысушылардың бірі {platform_name} сізге осындай шағым, әрекет немесе талап туралы жазбаша хабарлама жібереді.

source: General Legal Terms
kk_kz: Жалпы Заңды Терминдер

source: The Terms constitute the entire agreement between you and {platform_name} with respect to your use of the APIs and API Content, superseding any prior agreements between you and {platform_name} regarding your use of the APIs and API Content. The failure of {platform_name} to exercise or enforce any right or provision of the Terms shall not constitute a waiver of such right or provision. If any provision of the Terms is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision and the other provisions of the Terms shall remain in full force and effect. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. For any notice provided to you by {platform_name} under these Terms, {platform_name} may notify you via the email address associated with your {platform_name} account.
kk_kz: Шарттар сіз бен {platform_name} арасындағы API мен API мазмұнын пайдалануға қатысты толық келісім болып табылады, ол сіз бен {platform_name} арасындағы API мен API мазмұнын пайдалануға қатысты алдыңғы келісімдерді ауыстырады. {Platform_name} кез-келген құқықты немесе Шарт ережелерін орындау немесе орындау мүмкін еместігі мұндай құқықтан немесе ережеден бас тарту емес. Егер шарттардың қандай да бір ережесін құзыретті юрисдикция соты жарамсыз деп таныса, Тараптар, дегенмен, сот тараптардың Ережеде көрсетілген ниеттерін іске асыру үшін күш салуға тиіс екендігімен және шарттардың басқа да ережелері толық күшінде және іс-әрекетте қалуға тиіс екендігімен келіседі. Шарттар үшінші тараптың немесе қандай да бір агенттіктің, әріптестіктің немесе бірлескен кәсіпорынның бенефициарының ешқандай құқығын туғызбайды. Осы шарттарға сәйкес {platform_name} сізге берілген кез келген хабарлама үшін {platform_name} сіздің {platform_name} есептік жазбаңызбен байланысты электрондық пошта мекенжайы бойынша Сізге хабарлай алады.

source: You agree that the Terms, the APIs, and any claim or dispute arising out of or relating to the Terms or the APIs will be governed by the laws of the Commonwealth of Massachusetts, excluding its conflicts of law provisions. You agree that all such claims and disputes will be heard and resolved exclusively in the federal or state courts located in and serving Cambridge, Massachusetts, U.S.A. You consent to the personal jurisdiction of those courts over you for this purpose, and you waive and agree not to assert any objection to such proceedings in those courts (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Notwithstanding the foregoing, you agree that {platform_name} shall still be allowed to apply for injunctive remedies (or an equivalent type of urgent legal relief) in any jurisdiction.
kk_kz: Сіз шарттар, API интерфейстері және шарттарға немесе API-ге қатысты немесе олармен байланысты кез-келген шағымдар мен даулар Массачусетс штатының заңдарымен реттелетініне келісесіз. Сіз барлық осындай шағымдар мен даулар тек Кембриджде, Массачусетс штатында, АҚШ-та орналасқан және оларға қызмет көрсететін федералды немесе штаттық соттарда қаралып, шешілетініне келісесіз.Сіз осы мақсаттар үшін осы соттардың жеке юрисдикциясымен келісесіз және сіз осы соттарда мұндай сот ісін жүргізуге ешқандай қарсылық білдіруден бас тартасыз және келіспейсіз (тиісті юрисдикцияның немесе форумның орны немесе қолайсыздығы туралы кез-келген қорғауды немесе қарсылықты қоса). Жоғарыда айтылғандарға қарамастан, сіз {platform_name} кез-келген юрисдикцияда (немесе шұғыл құқықтық көмектің балама түріне) тыйым салуға рұқсат етілгенімен келісесіз.

source: Termination
kk_kz: Тоқтату

source: You may stop using the APIs at any time. You agree that {platform_name}, in its sole discretion and at any time, may terminate your use of the APIs or any API Content for any reason or no reason, without prior notice or liability.
kk_kz: Сіз кез-келген уақытта API қолдануды тоқтата аласыз. Сіз {platform_name} өз қалауыңыз бойынша және кез-келген уақытта API немесе кез-келген API мазмұнын кез-келген себеппен немесе себепсіз, алдын-ала ескертусіз немесе жауапкершіліксіз пайдалануды тоқтата алатындығына келісесіз.

source: {platform_name_capitalized} and the {platform_name} Participants reserve the right at any time in their sole discretion to cancel, delay, reschedule or alter the format of any API or API Content offered through {platform_name}, or to cease providing any part or all of the APIs or API Content or related services, and you agree that neither {platform_name} nor any of the {platform_name} Participants will have any liability to you for such an action.
kk_kz: {platform_name_capitalized} және {platform_name} қатысушылары кез-келген уақытта өз қалауы бойынша {platform_name} арқылы ұсынылатын кез-келген API немесе API мазмұнының форматын жою, кейінге қалдыру, көшіру немесе өзгерту немесе API немесе API немесе байланысты қызметтердің кез-келген бөлігін немесе барлығын беруді тоқтату құқығын өзіне қалдырады және сіз {platform_name} немесе {platform_name} қатысушыларының кез-келгені мұндай әрекет үшін сіздің алдыңызда ешқандай жауапкершілік көтермейтініне келісесіз.

source: Upon any termination of the Terms or discontinuation of your access to an API for any reason, your right to use any API and API Content will immediately cease. You will immediately stop using the APIs and delete any cached or stored API Content from Your Application and your networks, systems and servers as soon as reasonably possible. All provisions of the Terms that by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, and limitations of liability. Termination of your access to and use of the APIs and API Content shall not relieve you of any obligations arising or accruing prior to such termination or limit any liability that you otherwise may have to {platform_name}, including without limitation any indemnification obligations contained herein.
kk_kz: Кез-келген шартты тоқтату немесе API-ге кіруді тоқтату кезінде кез-келген себеппен кез-келген API және API мазмұнын пайдалану құқығыңыз дереу тоқтатылады. Сіз дереу API қолдануды тоқтатасыз және кез-келген кэштелген немесе сақталған API мазмұнын қолданбадан, сондай-ақ желілерден, жүйелерден және серверлерден мүмкіндігінше тезірек жоясыз. Өзінің сипаты бойынша бұзылғаннан кейін күшінде қалуы тиіс шарттардың барлық ережелері, меншік құқығы туралы ережелерді, кепілдіктерден бас тартуды және жауапкершілікті шектеуді қоса алғанда, бұзылғаннан кейін күшінде қалуы тиіс. API және мазмұнды пайдалануды тоқтату API сізді осындай тоқтатудан бұрын туындаған немесе туындаған міндеттемелерден босатпайды немесе осы құжатта қамтылған шығындарды өтеу бойынша кез-келген міндеттемелерді қоса алғанда, {platform_name} алдында сізде болуы мүмкін кез-келген жауапкершілікті шектемейді.

source: Edit {catalog_name}
kk_kz: {catalog_name} Редакциялау

source: Download CSV
kk_kz: CSV-ні жүктеу

source: Delete this catalog
kk_kz: Бұл каталогты жойыңыз

source: Update Catalog
kk_kz: Каталогты Жаңарту

source: Catalogs for {username}
kk_kz: {username} үшін каталог

source: Create new catalog:
kk_kz: Жаңа каталог жасау:

source: Create Catalog
kk_kz: каталог жасау:

source: Catalog search
kk_kz: Каталог бойынша іздеу

source: Catalog Search
kk_kz: Каталог бойынша іздеу

source: Enter a username to view catalogs belonging to that user.
kk_kz: Осы пайдаланушыға тиесілі каталогтарды қарау үшін пайдаланушы атын енгізіңіз.

source: Open Calculator
kk_kz: Калькуляторды ашу

source: Enter equation
kk_kz: Теңдеуді енгізіңіз

source: Calculator Input Field
kk_kz: Калькулятор үшін енгізу алабы

source: Hints
kk_kz: Еске түсірулер

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
kk_kz: Еске түсірулер арасында ауысу үшін нұсқағыштармен клавишаларды пайдаланыңыз немесе калькуляторға қайту үшін табуляция клавишасын пайдаланыңыз

source: For detailed information, see {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} in the {guide_link_start}edX Guide for Students{guide_link_end}.
kk_kz: Толық ақпарат алу үшін {math_link_start}математикалық және ғылыми өрнектерді енгізу{math_link_end} оқулықта {guide_link_start}edX студенттерге арналған{guide_link_end}.

source: Tips
kk_kz: Кеңестер

source: Use parentheses () to make expressions clear. You can use parentheses inside other parentheses.
kk_kz: Өрнектерді түсінікті ету үшін жақшаларды () қолданыңыз. Сіз басқа жақшалардың ішінде жақшаларды қолдана аласыз.

source: Do not use spaces in expressions.
kk_kz: Өрнектердегі бос орындарды пайдаланбаңыз.

source: For constants, indicate multiplication explicitly (example: 5*c).
kk_kz: Тұрақты мәндер үшін көбейтуді нақты көрсетіңіз (мысалы: 5*c).

source: For affixes, type the number and affix without a space (example: 5c).
kk_kz: Аффикстер үшін санды енгізіп, бос орынсыз қойыңыз (мысалы: 5C).

source: For functions, type the name of the function, then the expression in parentheses.
kk_kz: Функциялар үшін функцияның атын, содан кейін жақшадағы өрнекті енгізіңіз.

source: To Use
kk_kz: Қолдану

source: Type
kk_kz: Түрі

source: Examples
kk_kz: Мысалдар

source: Numbers
kk_kz: Сандар

source: Integers
kk_kz: Бүтін сандар

source: Fractions
kk_kz: Бөлшектер

source: Decimals
kk_kz: Ондық бөлшек

source: Operators
kk_kz: Операторлар

source: + - * / (add, subtract, multiply, divide)
kk_kz: + - * / (қосу, алу, көбейту, бөлу)

source: ^ (raise to a power)
kk_kz: ^ (күшке дейін көтеріңіз)

source: || (parallel resistors)
kk_kz: || (параллель резисторлар)

source: Constants
kk_kz: Константтар

source: Affixes
kk_kz: Аффикстер

source: Percent sign (%) and metric affixes (d, c, m, u, n, p, k, M, G, T)
kk_kz: Пайыз белгісі ( % ) және метрикалық аффикстер (d, c, m, u, n, p, k, M, G, T)

source: Basic functions
kk_kz: Негізгі функциялар

source: Trigonometric functions
kk_kz: Тригонометриялық функциялар

source: Scientific notation
kk_kz: Экспоненциалды жазба

source: 10^ and the exponent
kk_kz: 10^ және дәреже көрсеткіші

source: e notation
kk_kz: e белгілеу

source: 1e and the exponent
kk_kz: 1e және дәреже көрсеткіші

source: Calculate
kk_kz: Есептеу

source: Result
kk_kz: Нәтиже

source: CCX Coach Dashboard
kk_kz: CCX Coach Басқару тақтасы

source: Name your CCX
kk_kz: CCX деп атаңыз

source: Create a new Custom Course for edX
kk_kz: Создать новый индивидуальный курс

source: Grading Policy
kk_kz: Бағалау Саясаты

source: Batch Enrollment
kk_kz: Топтарды тізімге енгізу

source: Student Grades
kk_kz: Оқушыларды бағалау

source: Please enter a valid CCX name.
kk_kz: Жарамды CCX атауын енгізіңіз.

source: Email Addresses/Usernames
kk_kz: Электрондық Пошта Мекенжайлары/Пайдаланушы Аттары

source: Enter one or more email addresses or usernames separated by new lines or commas.
kk_kz: Жаңа жолдармен немесе үтірлермен бөлінген бір немесе бірнеше электрондық пошта мекенжайларын немесе пайдаланушы аттарын енгізіңіз.

source: Make sure you enter the information carefully. You will not receive notification for invalid usernames or email addresses.
kk_kz: Ақпаратты мұқият енгізгеніңізге көз жеткізіңіз. Жарамсыз пайдаланушы аттары немесе электрондық пошта мекенжайлары туралы хабарлама алмайсыз.

source: Auto Enroll
kk_kz: Тізімге автоматты енгізу

source: If this option is {em_start}checked{em_end}, users who have not yet registered for {platform_name} will be automatically enrolled.
kk_kz: Егер бұл {em_start}параметрі{em_end} орнатылса, {platform_name} үшін әлі тіркелмеген Пайдаланушылар автоматты түрде тіркеледі.

source: If this option is left {em_start}unchecked{em_end}, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
kk_kz: Егер бұл {em_start}параметрі{em_end} орнатылмаған болса, {platform_name} үшін әлі тіркелмеген Пайдаланушылар тіркелмейді, бірақ есептік жазбаны жасағаннан кейін тіркелуге рұқсат етіледі.

source: Checking this box has no effect if 'Unenroll' is selected.
kk_kz: Осы алапта тұрған белгі егер 'Тіркеуді болдырмау' таңдалса есептелмейтін болады.

source: Notify users by email
kk_kz: Электрондық почта бойынша пайдаланушыларды хабардар ету

source: If this option is {em_start}checked{em_end}, users will receive an email notification.
kk_kz: Егер бұл {em_start}параметрі{em_end} орнатылса, пайдаланушылар электрондық пошта арқылы хабарлама алады.

# someone
source: Enroll
kk_kz: Тізімге енгізу

source: Student List Management
kk_kz: Оқушылар тізімін басқару

source: CCX student list management response message
kk_kz: CCX оқушылардың тізімін басқару туралы жауап хабарламасы

source: Revoke access
kk_kz: Қол жеткізуді болдырмау

source: WARNING
kk_kz: Ескерту

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
kk_kz: Тек озық пайдаланушылар үшін. Бағалау саясатындағы қателер курстың көрсетілмеуіне әкелуі мүмкін. Бұл форма сақтамас бұрын саясаттың жарамдылығын тексермейді.

source: Most coaches should not need to make changes to the grading policy.
kk_kz: Көптеген жаттықтырушылар бағалау саясатына өзгерістер енгізудің қажеті жоқ.

source: Save Grading Policy
kk_kz: Бағалауды сақтау саясаты

source: Date format four digit year dash two digit month dash two digit day
kk_kz: Күн форматы төрт таңбалы жыл сызықша екі таңбалы ай сызықша екі таңбалы күн

source: Time format two digit hours colon two digit minutes
kk_kz: Уақыт форматы екі таңбалы сағат қос нүкте екі таңбалы минут

source: Time
kk_kz: Уақыт

source: Set date
kk_kz: Тағайындалған күн

source: You have unsaved changes.
kk_kz: Сізде сақталмаған өзгерістер бар.

source: There was an error saving changes.
kk_kz: Өзгерістерді сақтау кезінде қате пайда болды.

source: Schedule a Unit
kk_kz: Бөлімшені жоспарлаңыз

source: Start Date
kk_kz: Басталу күні

source: format four digit year dash two digit month dash two digit day
kk_kz: формат төрт таңбалы жыл сызықша екі таңбалы ай сызықша екі таңбалы күн

source: yyyy-mm-dd
kk_kz: дд-мм-гггг

source: Start time format two digit hours colon two digit minutes
kk_kz: Басталу уақытының форматы екі таңбалы сағат қос нүкте екі таңбалы минут

source: time
kk_kz: уақыт

source: (Optional)
kk_kz: опция

source: Due Time format two digit hours colon two digit minutes
kk_kz: Жұмыс уақытының форматы екі таңбалы сағат қос нүкте екі таңбалы минут

source: Add Unit
kk_kz: Бірлікті Қосу

source: Add All Units
kk_kz: Барлық Өлшем Бірліктерін Қосыңыз

source: All units have been added.
kk_kz: Барлық бөлімшелер қосылды.

source: View gradebook
kk_kz: Сынақ кітапшасын қарау

source: Download student grades
kk_kz: Оқушылардың бағаларын жүктеу

source: Print or share your certificate:
kk_kz: Сертификатыңызды басып шығарыңыз немесе бөлісіңіз:

source: Click the link to see my certificate.
kk_kz: Менің куәлігімді көру үшін сілтемені нұқыңыз.

source: Post on Facebook
kk_kz: Facebook-тегі хабарлама

source: Share on Twitter
kk_kz: Твиттерде бөлісіңіз

source: Tweet this Accomplishment. Pop up window.
kk_kz: Бұл жетістік туралы Твиттер жазыңыз. Қалқымалы терезе.

source: Add to LinkedIn Profile
kk_kz: LinkedIn профиліне қосу

source: Add to Mozilla Backpack
kk_kz: Mozilla рюкзагына қосу

source: Print Certificate
kk_kz: Сертификатты Басып Шығару

source: {platform_name} Home
kk_kz: {platform_name} Басты бет

source: Noted by
kk_kz: Атап өтілді

source: Supported by the following organizations
kk_kz: Келесі ұйымдардың қолдауымен

source: Awarded to:
kk_kz: Тағайындалады:

source: For tips and tricks on printing your certificate, view the {link_start}Web Certificates help documentation{link_end}.
kk_kz: Сертификатты басып шығару бойынша кеңестер мен амалдарды {link_start} веб-сертификаттардың анықтамалық құжаттамасынан қараңыз.{link_end}

source: Cannot Find Certificate
kk_kz: Сертификат Табылмады

source: We cannot find a certificate with this URL or ID number. If you are trying to validate a certificate, make sure that the URL or ID number is correct. If you are sure that the URL or ID number is correct, contact support.
kk_kz: Біз осы URL немесе сәйкестендіру нөмірі бар куәлікті таба алмаймыз. Егер сіз сертификатты тексергіңіз келсе, URL мекен-жайы немесе сәйкестендіру нөмірі дұрыс көрсетілгеніне көз жеткізіңіз. Егер URL мекен-жайы немесе сәйкестендіру нөмірі дұрыс көрсетілгеніне сенімді болсаңыз, қолдау қызметіне хабарласыңыз.

source: Invalid Certificate Configuration.
kk_kz: Неверная настройка сертификата

source: There is a problem with this certificate.
kk_kz: Бұл сертификатпен проблема туындады.

source: To resolve the problem, your partner manager should verify that the following information is correct.
kk_kz: Мәселені шешу үшін Сіздің серіктес менеджеріңіз төмендегі ақпараттың дұрыстығына көз жеткізуі керек.

source: The institution's logo.
kk_kz: Мекеменің логотипі.

source: The institution that is linked to the course.
kk_kz: Курсқа байланысты мекеме.

source: The course information in the Course Administration tool.
kk_kz: Курсты басқару құралындағы курс туралы ақпарат.

source: If all of the information is correct and the problem persists, contact technical support.
kk_kz: Егер барлық ақпарат дұрыс болса және мәселе шешілмесе, техникалық қолдау қызметіне хабарласыңыз.

source: About edX Certificates
kk_kz: EdX растаған сертификаттар туралы

source: Checkout Cancelled
kk_kz: Платеж отменён

source: Your transaction has been cancelled. If you feel an error has occurred, contact {email}.
kk_kz: Ваша транзакция отменена. Если вы считаете, что произошла ошибка, напишите нам на {email}.

source: Checkout Error
kk_kz: Ошибка оплаты

source: An error has occurred with your payment. <b>You have not been charged.</b> Please try to submit your payment again. If this problem persists, contact {email}.
kk_kz: Во время обработки платежа произошла ошибка. <b>Деньги не были списаны.</b> Пожалуйста, попробуйте совершить платёж ещё раз. Если проблема повторится, обратитесь по {email}.

source: Loading Order Data...
kk_kz: Загрузка данных о заказе...

source: Please wait while we retrieve your order details.
kk_kz: Пожалуйста, подождите, пока мы получаем информации о вашем заказе.

source: Enroll In course | Choose Your Track
kk_kz: Записаться на курс | Выбрать форму обучения

source: Sorry, there was an error when trying to enroll you
kk_kz: Кешіріңіз, сізді тіркеуге тырысқанда қате пайда болды

source: Pursue Academic Credit with the Verified Track
kk_kz: Тексерілген жолмен академиялық кредит алыңыз

source: Pursue Academic Credit with a Verified Certificate
kk_kz: Расталған сертификатпен академиялық кредит алыңыз

source: Become eligible for academic credit and highlight your new skills and knowledge with a verified certificate. Use this valuable credential to qualify for academic credit, advance your career, or strengthen your school applications.
kk_kz: Академиялық кредит алу құқығын алыңыз және расталған сертификат арқылы жаңа дағдыларыңыз бен біліміңізді көрсетіңіз. Осы құнды тіркелгі деректерін академиялық кредит алу, мансапты жоғарылату немесе мектеп бағдарламаларын нығайту үшін пайдаланыңыз.

source: Benefits of the Verified Track
kk_kz: Дәлелденген тректің артықшылықтары
