Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Schedule
kk_kz: Кесте

source: By %(filter_title)s
kk_kz: %(filter_title)s бойынша

source: Welcome to week %(week_num)s of %(course_name)s!
kk_kz: аптаға қош келдіңіз%(week_num)s%(course_name)s

source: With self-paced courses, you learn on your own schedule. We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
kk_kz: Тәуелсіз курстардың көмегімен сіз өз кестеңіз бойынша үйренесіз. Әр апта сайын курспен уақыт өткізуді ұсынамыз. Сіздің назарыңыз ақыр соңында төленеді!

source: Resume your course now
kk_kz: Курсты дәл қазір жалғастырыңыз

source: We hope you're enjoying %(course_name)s! We want to let you know what you can look forward to in week %(week_num)s:
kk_kz: Сізге %(course_name)sұнайды деп үміттенеміз ! Біз сізге осы аптада%(week_num)s не күтуге болатындығын айтқымыз келеді :

source: Welcome to week %(week_num)s
kk_kz: Жаңа аптаға қош келдіңіз%(week_num)s

source: Many %(platform_name)s learners are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
kk_kz: Көптеген %(platform_name)sстуденттері апта сайын көбірек мәселелерді шешеді және пікірталас форумдарына қатысады. Оқуды жалғастыру үшін не істегіңіз келеді?

source: Many %(platform_name)s learners in %(course_name)s are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
kk_kz: Көптеген %(platform_name)sстуденттері %(course_name)s әр апта сайын көбірек мәселелерді шешеді және пікірталас форумдарына қатысады. Оқуды жалғастыру үшін не істегіңіз келеді?

source: Keep up the momentum!
kk_kz: Қарқын алуды жалғастырыңыз!

source: Keep learning
kk_kz: Оқуды жалғастырыңыз

source: Remember when you enrolled in %(course_name)s, and other courses on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
kk_kz: %(platform_name)s-да осы %(course_name)sжәне басқа курстарға жазылғаныңыз есіңізде ме ? Біз мұны жасаймыз және сізде бар екеніне қуаныштымыз! Барлығы не білетінін көруге келіңіз.

source: Remember when you enrolled in %(course_name)s on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
kk_kz: %(platform_name)s-да %(course_name)s-ға қашан жазылғаныңыз есіңізде ме ? Біз мұны жасаймыз және сізде бар екеніне қуаныштымыз! Барлығы не білетінін көруге келіңіз.

source: Keep learning today
kk_kz: Бүгін оқуды жалғастырыңыз

source: Start learning now
kk_kz: Қазір оқуды бастаңыз

source: Keep learning on %(platform_name)s
kk_kz: %(platform_name)s-да Әрі қарай оқуды жалғастырыңыз

source: Keep learning in %(course_name)s
kk_kz: %(course_name)s-да әрі қарай оқуды жалғастырыңыз

source: We hope you are enjoying learning with us so far on %(platform_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
kk_kz: Сіз осы уақытқа дейін бізден %(platform_name)sүйренгенді ұнатасыз деп үміттенеміз ! Расталған сертификат сіздің жаңа біліміңіз бен дағдыларыңызды ерекше атап өтуге мүмкіндік береді.%(platform_name)s сертификаты ресми және оңай таратылады. %(user_schedule_upgrade_deadline_time)sкөмегімен жаңарту

source: We hope you are enjoying learning with us so far in %(first_course_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
kk_kz: Сіз осы уақытқа дейін бізден %(first_course_name)sүйренгенді ұнатасыз деп үміттенеміз ! Расталған сертификат сіздің жаңа біліміңіз бен дағдыларыңызды ерекше атап өтуге мүмкіндік береді.%(platform_name)s Сертификаты ресми және оңай таратылады. %(user_schedule_upgrade_deadline_time)sБҚ жаңарту .

source: You are eligible to upgrade in these courses:
kk_kz: Сіз осы курстарда біліктілікті арттыруға құқылысыз:

source: Example of a verified certificate
kk_kz: Расталған сертификаттың мысалы

source: Upgrade now at
kk_kz: Қазір жаңартыңыз

source: Upgrade to earn a verified certificate on %(platform_name)s
kk_kz: Расталған сертификат алу үшін жаңартыңыз %(platform_name)s

source: Upgrade to earn a verified certificate in %(first_course_name)s
kk_kz: Расталған сертификат алу үшін жаңартыңыз %(first_course_name)s

source: Enable course home page improvements.
kk_kz: Курстың басты бетін жақсартуды қосыңыз.

source: Site theme changed to {site_theme}
kk_kz: Сайт тақырыбы {site_theme} өзгертілді

source: Theme {site_theme} does not exist
kk_kz: {site_theme} тақырыбы жоқ

source: Site theme reverted to the default
kk_kz: Сайт тақырыбы әдепкі тақырыпқа оралды

source: Theming Administration
kk_kz: Тақырыптық әкімшілік

source: Usernames can only contain letters (A-Z, a-z), numerals (0-9), underscores (_), and hyphens (-).
kk_kz: Пайдаланушы атауларында тек әріптер (A-Z, A-z), сандар (0-9), астын сызу белгілері ( _ ) және сызықшалар (- ) болуы керек.

source: Usernames can only contain letters, numerals, and @/./+/-/_ characters.
kk_kz: Пайдаланушы аттарында тек әріптер, сандар және @ / таңбалары болуы мүмкін./+/ -/_.

source: "{email}" is not a valid email address.
kk_kz: "{email}" бұл дұрыс емес электрондық пошта мекенжайы.

source: It looks like {email_address} belongs to an existing account. Try again with a different email address.
kk_kz: {email_address} қолданыстағы есептік жазбаға тиесілі сияқты. Басқа электрондық пошта мекенжайымен әрекетті қайталаңыз.

source: It looks like {username} belongs to an existing account. Try again with a different username.
kk_kz: {username}қолданыстағы есептік жазбаға тиесілі сияқты. Басқа пайдаланушы атымен қайталап көріңіз.

source: Username must be between {min} and {max} characters long.
kk_kz: Пайдаланушы аты {min} - ден {max} таңбаларына дейін болуы керек.

source: Enter a valid email address that contains at least {min} characters.
kk_kz: Кемінде {min} таңбалары бар жарамды электрондық пошта мекенжайын енгізіңіз.

source: Enter your full name.
kk_kz: Введите ваше имя.

source: The email addresses do not match.
kk_kz: Электрондық пошта мекенжайлары бірдей емес.

source: Select your country or region of residence.
kk_kz: Өз еліңізді немесе тұратын жеріңізді таңдаңыз.

source: Select your profession.
kk_kz: Өз мамандығыңызды таңдаңыз.

source: Select your specialty.
kk_kz: Өз мамандығыңызды таңдаңыз.

source: Enter your profession.
kk_kz: Мамандығыңызды жазыңыз

source: Enter your specialty.
kk_kz: Мамандығыңызды жазыңыз

source: Enter your city.
kk_kz: Қалаңызды жазыңыз

source: Tell us your goals.
kk_kz: Мақсаттарыңызды айтыңыз

source: Select the highest level of education you have completed.
kk_kz: Сіз аяқтаған ең жоғары білім деңгейін таңдаңыз.

source: Enter your mailing address.
kk_kz: пошталық мекен-жайыңызды енгізіңіз

source: The '{field_name}' field cannot be edited.
kk_kz: '{field_name}' өрісін өңдеу мүмкін емес.

source: Account creation not allowed.
kk_kz: Есептік жазбаны жасауға рұқсат жоқ.

source: State/Province/Region
kk_kz: Мемлекет / Облыс / Аудан

source: Company
kk_kz: Компания

source: Job Title
kk_kz: лауазымы

source: Mailing address
kk_kz: Почталық мекенжай

source: Tell us why you're interested in {platform_name}
kk_kz: {platform_name} неліктен сізді қызықтыратынын айтыңыз

source: Profession
kk_kz: Мамандық

source: Specialty
kk_kz: Мамандық

source: This account has been temporarily locked due to excessive login failures. Try again later.
kk_kz: Осы есептік жазба жүйеге көптеген сәтсіз кіру әрекеттеріне байланысты уақытша бұғатталды. Кейінірек әрекет етіп көріңіз.

source: Email or password is incorrect.
kk_kz: Электрондық мекенжай немесе пароль дұрыс емес енгізілді

source: Permission Denied
kk_kz: Рұқсат Беруден Бас Тартылды

source: Retirement does not exist!
kk_kz: Зейнетке шығу жоқ!

source: Success
kk_kz: Сәтті

source: Actions
kk_kz: Қолданылу

source: The email address you used to register with {platform_name}
kk_kz: {platform_name} тіркелу үшін пайдаланған электрондық пошта мекенжайы

source: Remember me
kk_kz: Мені есте сақтау

source: This is what you will use to login.
kk_kz: Бұны сіз кіру үшін пайдаланатын боласыз.

source: Confirm Email
kk_kz: Электрондық поштаны растаңыз

source: This name will be used on any certificates that you earn.
kk_kz: Бұл атау сіз тапқан кез-келген сертификатта қолданылады.

source: Public Username
kk_kz: Пайдаланушының жария аты

source: The name that will identify you in your courses. It cannot be changed later.
kk_kz: Сіздің курстарыңызда сізді анықтайтын атау. Оны кейінірек өзгерту мүмкін емес.

source: Highest level of education completed
kk_kz: Аяқталған білімнің жоғары деңгейі

source: Year of birth
kk_kz: Туған жылы

source: Country or Region of Residence
kk_kz: Ел немесе тұратын аймақ

source: The country or region where you live.
kk_kz: Сіз тұратын ел немесе аймақ.

source: Terms of Service and Honor Code
kk_kz: Қызметтерді ұсыну шарттары және ар-намыс кодексі

source: I agree to the {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}
kk_kz: Мен келісемін {platform_name}{terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}

source: You must agree to the {platform_name} {terms_of_service}
kk_kz: Сіз бұған келісуіңіз керек {platform_name} {terms_of_service}

source: By creating an account with {platform_name}, you agree to abide by our {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} and agree to our {privacy_policy_link_start}Privacy Policy{privacy_policy_link_end}.
kk_kz: {platform_name} платформасында тіркелгі жасау арқылы сіз {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} сонымен қатар {privacy_policy_link_start}Жеке деректер саясатын {privacy_policy_link_end} қабылдайсыз.

source: I agree to the {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}
kk_kz: Мен бұған келісемін {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}

source: Delete failed for user preference '{preference_key}'.
kk_kz: "{preference_key} " пайдаланушының қалауы үшін жою мүмкін емес.

source: Preference '{preference_key}' cannot be set to an empty value.
kk_kz: "{preference_key} " артықшылығын бос мәнге орнату мүмкін емес.

source: Invalid user preference key '{preference_key}'.
kk_kz: '{preference_key}' пайдаланушының артықшылық кілті дұрыс емес.

source: Value '{preference_value}' is not valid for user preference '{preference_key}'.
kk_kz: '{preference_value}' мәні '{preference_key}' пайдаланушының қалауы үшін жарамсыз.

source: Value '{preference_value}' not valid for preference '{preference_key}': Not in timezone set.
kk_kz: '{preference_value}' мәні '{preference_key}' пайдаланушының қалауы үшін жарамсыз: Берілген уақыт белдеуінде емес.

source: Value '{preference_value}' is not a valid time zone selection.
kk_kz: '{preference_value}' мәні уақыт белдеуін қолайлы таңдау емес.

source: Save failed for user preference '{key}' with value '{value}'.
kk_kz: '{key}' пайдаланушы қалауы үшін '{value}' мәнімен сақтау мүмкін емес.

source: No data provided for user preference update
kk_kz: Пайдаланушы қалауларын жаңартуға арналған деректер берілмеген

source: Hello %(full_name)s,
kk_kz: Сәлем %(full_name)s,

source: We received a deletion request for your account on %(platform_name)s. We're sorry to see you go!
kk_kz: Біз%(platform_name)s-дағы сіздің есептік жазбаңызды жою туралы сұрау алдық . Сіз кеткеніңіз үшін кешіріңіз!

source: Your account will be deleted shortly. Account deletion, including removal from email lists, may take a few weeks to fully process through our system. If you want to opt-out of emails before then, please unsubscribe from the footer of any email.
kk_kz: Сіздің есептік жазбаңыз жақын арада жойылады. Тіркелгіні жою, соның ішінде электрондық пошта тізімінен жою біздің жүйемізден толық өту үшін бірнеше апта кетуі мүмкін. Егер сіз бұған дейін электрондық поштадан бас тартқыңыз келсе, кез-келген Электрондық поштаның төменгі деректемесінен бас тартыңыз.

source: This is an informational email only. If you did not initiate this request, please contact %(contact_email)s.
kk_kz: Бұл тек ақпараттық электрондық пошта. Егер сіз бұл сұрауды бастамаған болсаңыз, %(contact_email)s хабарласыңыз

source: Best, %(platform_name)s
kk_kz: Құрметпен, %(platform_name)s

source: Your Account Has Been Queued For Deletion
kk_kz: Сіздің Есептік Жазбаңыз Жою Үшін Кезекке Қойылды

source: Superuser creation not allowed
kk_kz: Супер пайдаланушыны құруға жол берілмейді

source: Account modification not allowed.
kk_kz: Есептік жазбаны өзгертуге жол берілмейді.

source: You've successfully logged into your {provider_name} account, but this account isn't linked with an {platform_name} account yet.
kk_kz: Вы успешно вошли в учётную запись {provider_name}, но данная учётная запись пока не связана с учётной записью платформы {platform_name}.

source: Use your {platform_name} username and password to log into {platform_name} below, and then link your {platform_name} account with {provider_name} from your dashboard.
kk_kz: Для входа на платформу «{platform_name}» используйте имя пользователя и пароль {platform_name}, введённые при регистрации, а затем свяжите вашу учётную запись {platform_name} с учётной записью {provider_name} в панели управления.

source: Register
kk_kz: Тіркелу

source: There was an error receiving your login information. Please email us.
kk_kz: Тіркеу ақпаратын алу қатесі орын алды. Бізге жазыңыз.

source: In order to sign in, you need to activate your account.<br /><br />We just sent an activation link to <strong>{email}</strong>. If you do not receive an email, check your spam folders or <a href="{support_url}">contact {platform} Support</a>.
kk_kz: Для входа в систему вам необходимо активировать свою учётную запись.<br /><br />Мы отправили ссылку для активации на адрес <strong>{email}</strong>. Если вы не получили письмо, проверьте папку со спамом или <a href="{support_url}">свяжитесь со службой технической поддержки платформы «{platform}»</a>.

source: Too many failed login attempts. Try again later.
kk_kz: Сәтсәз кіру әрекеттері тым көп. Кейінірек әрекет етіңіз

source: Create Account
kk_kz: Тіркелу

source: Registration using {provider} has timed out.
kk_kz: {provider} арқылы тіркелу уақыты аяқталды.

source: An access_token is required when passing value ({}) for provider.
kk_kz: ({}) Мәнін беру кезінде жеткізушіге кіру кілті қажет.

source: The provided access_token is already associated with another user.
kk_kz: Берілген кіру кілті басқа пайдаланушымен байланысты.

source: The provided access_token is not valid.
kk_kz: Берілген access_token жарамсыз.

source: Dismiss
kk_kz: Қабылдамау

source: The course key for the course we would like to be auto-cohorted.
kk_kz: Біз курс үшін курс кілтін автоматты түрде когорттағымыз келеді

source: Force On
kk_kz: Мәжбүрлеу

source: Force Off
kk_kz: Мәжбүрді Өшіру

source: This value is invalid.
kk_kz: Бұл мәнге жол берілмейді.

source: This field is not editable
kk_kz: Бұл өрісті өңдеу мүмкін емес

source: %(min_score)s is not a valid grade percentage
kk_kz: %(min_score)s бағалаудың рұқсат етілген пайызы болып табылмайды

source: Gating milestone for {usage_key}
kk_kz: {usage_key} үшін тексеру нүктесі

source: License
kk_kz: Лицензия

source: A license defines how the contents of this block can be shared and reused.
kk_kz: Лицензия осы блоктың контентін қалай беруге және қайта пайдалануға болатындығын анықтайды.

source: Category
kk_kz: Категория

source: Week 1
kk_kz: Апта 1

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
kk_kz: Талқылауға арналған санат атауы. Бұл атау курстың пікірталас форумының сол жақ панелінде көрсетіледі.

source: Subcategory
kk_kz: Санатша

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
kk_kz: Талқылауға арналған ішкі санат атауы. Бұл атау курстың пікірталас форумының сол жақ панелінде көрсетіледі.

source: You are not signed in. To view the discussion content, {sign_in_link} or {register_link}, and enroll in this course.
kk_kz: Сіз жүйеге кірген жоқсыз. Талқылау мазмұнын қарау үшін {sign_in_link} немесе {register_link} және осы курсқа жазылыңыз.

source: Enabled As Of
kk_kz: Сәттен Бастап Қосылған

source: Studio Override Enabled
kk_kz: Студияны қайта анықтау қосылды

source: Allow Feature Based Enrollment visibility to be overriden on a per-component basis in Studio.
kk_kz: Студиядағы әр компонент үшін функцияларға негізделген тіркеудің көрінуін қайта анықтауға рұқсат етіңіз.

source: enabled_as_of must be set when enabled is True
kk_kz: enabled_as_of мәні, егер enabled мәні шын болса, орнатылуы керек

source: Partition for segmenting users by access to gated content types
kk_kz: Жабық контент түрлеріне қол жеткізу үшін пайдаланушыларды сегментациялау бөлімі

source: Graded assessments are available to Verified Track learners. Upgrade to Unlock.
kk_kz: Бағалау бағалары тексерілген студенттер үшін қол жетімді. Құлпын ашу үшін жаңартыңыз.

source: Content available only to verified track learners
kk_kz: Контент тек тексерілген студенттерге қол жетімді

source: Verified Track Access
kk_kz: тексерілген бағалау жолы

source: Graded assessments are available to Verified Track learners.
kk_kz: Бағалау бағалары тексерілген студенттер үшін қол жетімді.

source: Upgrade to unlock
kk_kz: Құлпын ашу үшін жаңартыңыз

source: Access expired on {expiration_date}
kk_kz: Қол жеткізу мерзімі {expiration_date} аяқталды

source: Access to {course_name} expired on {expiration_date}
kk_kz: {course_name} кіру мерзімі {expiration_date} ішінде аяқталды

source: Access to the course you were looking for expired on {expiration_date}
kk_kz: Сіз іздеген курсқа кіру мерзімі аяқталды {expiration_date}

source: This learner does not have access to this course. Their access expired on {expiration_date}.
kk_kz: Бұл оқушының бұл курсқа қол жетімділігі жоқ. Оларға қол жеткізу мерзімі аяқталды {expiration_date}.

source: {strong_open}Audit Access Expires {expiration_date}{strong_close}{line_break}You lose all access to this course, including your progress, on {expiration_date}.
kk_kz: {strong_open}аудитке кіру мерзімі аяқталады {expiration_date}{strong_close}{line_break} Сіз осы курсқа, оның ішінде сіздің үлгеріміңізге барлық қол жетімділікті жоғалтасыз {expiration_date}.

source: {line_break}Upgrade by {upgrade_deadline} to get unlimited access to the course as long as it exists on the site. {a_open}Upgrade now{sronly_span_open} to retain access past {expiration_date}{span_close}{a_close}
kk_kz: {line_break}сайтта болған кезде курсқа шексіз қол жеткізу үшін {upgrade_deadline} көмегімен жаңартыңыз. {a_open}қол жетімділікті сақтау үшін{sronly_span_open} қазір жаңартыңыз{expiration_date}{span_close}{a_close}

source: Updates
kk_kz: Обновления

source: Reviews
kk_kz: Отзывы

source: {sign_in_link} or {register_link} and then enroll in this course.
kk_kz: {sign_in_link} немесе {register_link}, содан кейін осы курсқа жазылыңыз.

source: Sign in
kk_kz: Кіру

source: {open_enroll_link}Enroll now{close_enroll_link} to access the full course.
kk_kz: {open_enroll_link}толық курсқа кіру үшін қазір тіркеліңіз{close_enroll_link}.

source: Welcome to {course_display_name}
kk_kz: {course_display_name} Қош келдіңіз

source: To start, set a course goal by selecting the option below that best describes your learning plan. {goal_options_container}
kk_kz: Жұмысты бастау үшін төмендегі опцияны таңдап, курстың мақсатын қойыңыз, ол сіздің оқу жоспарыңызды жақсы сипаттайды {goal_options_container}

source: Set goal to: {choice}
kk_kz: Мақсат қойыңыз:{choice}

source: Set goal to: {goal_text}
kk_kz: Мақсат қойыңыз: {goal_text}

source: Enrollment in {course_title} was not complete.
kk_kz: {course_title} тіркеу аяқталған жоқ.

source: If you have concerns about sharing your data, please contact your administrator at {enterprise_customer_name}.
kk_kz: Егер сіздің деректеріңізді бөлісу туралы күмәніңіз болса, әкімшіңізбен {enterprise_customer_name}.мекен-жайы бойынша хабарласыңыз.

source: We are sorry, you are not authorized to access {platform_name} via this channel. Please contact your learning administrator or manager in order to access {platform_name}.{line_break}{line_break}Error Details:{line_break}{error_message}
kk_kz: Осы арна арқылы{platform_name}- ге кіруге рұқсат берілмегеніңізге өкінеміз. Кіру үшін әкімшіге немесе оқу менеджеріне хабарласыңыз {platform_name}.{line_break}{line_break}:{line_break}Қателер жайлы:{error_message}

source: Thank you for joining {platform_name}. Just a couple steps before you start learning!
kk_kz: {platform_name} - ге қосылғаныңыз үшін рахмет. Оқуды бастамас бұрын бірнеше қадам!

source: Continue
kk_kz: Жалғастыру

source: Course team user does not exist
kk_kz: Такого участника команды курса не существует

source: The groups in this configuration can be mapped to cohorts in the Instructor Dashboard.
kk_kz: Группы в этой конфигурации можно связать с группами пользователей в панели преподавателя.

source: Content Groups
kk_kz: Группы по изучаемому материалу

source: invalid JSON
kk_kz: неверный JSON

source: must have name of the configuration
kk_kz: должно быть указано имя конфигурации

source: must have at least one group
kk_kz: должна быть по меньшей мере одна группа

source: Invalid course update id.
kk_kz: Неверный идентификатор обновления курса.

source: Course update not found.
kk_kz: Обновление учебного курса не найдено.

source: Could not index item: {}
kk_kz: Не удалось проиндексировать элемент: {}

source: General indexing error occurred
kk_kz: Во время индексирования произошла ошибка

source: (Unnamed)
kk_kz: (Без имени)

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
kk_kz: Значение переменной GIT_REPO_EXPORT_DIR не установлено, либо каталог {0} не существует. Пожалуйста, создайте его либо укажите другой каталог в переменной GIT_REPO_EXPORT_DIR

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
kk_kz: Неверная ссылка на хранилище git. Нужна ссылка типа: git@github.com:mitocw/edx4edx_lite.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
kk_kz: При использовании URL с протоколом http вы должны предоставить имя пользователя и пароль в ссылке, например, https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
kk_kz: Невоможно идентифицировать ветку, репозиторий в режиме detached HEAD

source: Unable to update or clone git repository.
kk_kz: Невозможно обновить или клонировать хранилище git.

source: Unable to export course to xml.
kk_kz: Невозможно экспортировать курс в формат xml.

source: Unable to configure git username and password
kk_kz: Невозможно задать имя пользователя и пароль для git

source: Unable to commit changes. This is usually because there are no changes to be committed
kk_kz: Невозможно перенести изменения. Обычно это означает, что изменений для переноса нет

source: Unable to push changes. This is usually because the remote repository cannot be contacted
kk_kz: Невозможно передать изменения. Обычно это означает, что с удалённым хранилищем не удалось связаться

source: Bad course location provided
kk_kz: Указана неверная ссылка на местоположение учебного курса

source: Missing branch on fresh clone
kk_kz: Отсутствует ветка в свежем клоне
