Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Download the {platform_name} mobile app from the Apple App Store
kk_kz: Apple App Store дүкенінен {platform_name} мобильді қосымшасын жүктеңіз

source: Download the {platform_name} mobile app from Google Play
kk_kz: Google Play-ден {platform_name} мобильді қосымшасын жүктеңіз

source: "{course_title}" Course Staff
kk_kz: Член команды курса «{course_title}»

source: CCX Coach
kk_kz: CCX жаттықтырушысы

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
kk_kz: CCX осы курста тек сыртқы қызмет арқылы құрылуы мүмкін. Сізге кіру үшін курс админіне хабарласыңыз.

source: The course is full: the limit is {max_student_enrollments_allowed}
kk_kz: Курс аяқталды: лимит {max_student_enrollments_allowed}

source: You must be a CCX Coach to access this view.
kk_kz: Бұл көрініске қол жеткізу үшін Сіз CCX жаттықтырушысы болуыңыз керек.

source: You must be the coach for this ccx to access this view
kk_kz: Бұл көрініске қол жеткізу үшін сіз осы ccx үшін жаттықтырушы болуыңыз керек

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
kk_kz: Сіз ескірген идентификаторды пайдаланып курстан CCX жасай алмайсыз. Бұл әрекетті шешу үшін студияда осы курсты қайта бастаңыз.

source: created
kk_kz: құрылды

source: regenerated
kk_kz: Қайта құрылған

source: generated
kk_kz: Құрылған

source: All learners
kk_kz: Барлық оқушылар

source: For exceptions
kk_kz: Ерекшеліктер үшін

source: A human-readable description of the example certificate. For example, 'verified' or 'honor' to differentiate between two types of certificates.
kk_kz: Сертификат мысалының оқылатын сипаттамасы. Мысалы, сертификаттардың екі түрін ажырату үшін "тексерілген" немесе "үздік".

source: A unique identifier for the example certificate. This is used when we receive a response from the queue to determine which example certificate was processed.
kk_kz: Сертификат мысалы үшін бірегей идентификатор. Бұл сертификаттың қай үлгісі өңделгенін анықтау үшін кезектен жауап алған кезде қолданылады.

source: An access key for the example certificate. This is used when we receive a response from the queue to validate that the sender is the same entity we asked to generate the certificate.
kk_kz: Мысал сертификатына қол жеткізу кілті. Бұл жіберушінің сертификат жасауды сұраған объект екенін растау үшін кезектен жауап алған кезде қолданылады.

source: The full name that will appear on the certificate.
kk_kz: Сертификатта көрсетілетін толық аты.

source: The template file to use when generating the certificate.
kk_kz: Сертификат жасау кезінде қолданылатын үлгі файлы.

source: The status of the example certificate.
kk_kz: Сертификат үлгісінің мәртебесі.

source: The reason an error occurred during certificate generation.
kk_kz: Себеп - куәлікті жасау кезінде қате пайда болған

source: The download URL for the generated certificate.
kk_kz: Ссылка для скачивания сертификата

source: Name of template.
kk_kz: Үлгі атауы.

source: Description and/or admin notes.
kk_kz: Сипаттамасы және / немесе администраторлық ескертулер.

source: Django template HTML.
kk_kz: Шаблон Django HTML

source: Organization of template.
kk_kz: Шаблонды ұйымдастыру.

source: The course mode for this template.
kk_kz: Осы үлгі үшін курс режимі.

source: On/Off switch.
kk_kz: Қосу/өшіру түймесі

source: Description of the asset.
kk_kz: Активтің сипаттамасы.

source: Asset file. It could be an image or css file.
kk_kz: Активтер файлы. Бұл сурет немесе css файлы болуы мүмкін.

source: Asset's unique slug. We can reference the asset in templates using this value.
kk_kz: Активтің ерекше оқтары. Осы мәнді пайдаланып шаблондардағы ресурсқа сілтеме жасай аламыз.

source: user is not given.
kk_kz: пайдаланушы берілмеген.

source: user '{user}' does not exist
kk_kz: '{user}' Пайдаланушысы жоқ

source: Course id '{course_id}' is not valid
kk_kz: Идентификатор курса '{course_id}' недействителен.

source: The course does not exist against the given key '{course_key}'
kk_kz: Курса с ключом '{course_key}' не существует

source: User {username} does not exist
kk_kz: Пайдаланушы {username} жоқ

source: {course_key} is not a valid course key
kk_kz: {course_key} жарамды курс кілті емес

source: The course {course_key} does not exist
kk_kz: Курс {course_key} жоқ

source: User {username} is not enrolled in the course {course_key}
kk_kz: Пайдаланушы {username} курсында тіркелмеген {course_key}

source: An unexpected error occurred while regenerating certificates.
kk_kz: Сертификаттарды қалпына келтіру кезінде күтпеген қате орын алды.

source: An {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
kk_kz: {cert_type} сертификаты оқушының {platform_name} белгілеген Ар-намыс кодексін сақтауға келіскенін және оның нұсқауларына сәйкес осы курс үшін барлық қажетті тапсырмаларды орындағанын білдіреді.

source: A {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines. A {cert_type} certificate also indicates that the identity of the learner has been checked and is valid.
kk_kz: {cert_type} сертификаты оқушының {platform_name} белгілеген Ар-намыс кодексін сақтауға келіскенін және оның нұсқауларына сәйкес осы курс үшін барлық қажетті тапсырмаларды орындағанын білдіреді. {cert_type} сертификаты сонымен қатар оқушының жеке басы тексерілгенін және жарамды екенін көрсетеді.

source: An {cert_type} certificate demonstrates a high level of achievement in a program of study, and includes verification of the student's identity.
kk_kz: {cert_type} сертификаты оқу бағдарламасындағы жетістіктердің жоғары деңгейін көрсетеді және оқушының жеке басын тексеруді қамтиды.

source: {month} {day}, {year}
kk_kz: {day} {month} {year} года

source: This is a valid {platform_name} certificate for {user_name}, who participated in {partner_short_name} {course_number}
kk_kz: Бұл жарамды сертификат {platform_name} {user_name} үшін {partner_short_name} {course_number}

source: {partner_short_name} {course_number} Certificate | {platform_name}
kk_kz: {partner_short_name} {course_number} Сетификат I {platform_name}

source: successfully completed, received a passing grade, and was awarded this {platform_name} {certificate_type} Certificate of Completion in
kk_kz: успешно завершил, получил проходной балл, и был удостоен Сертификата {certificate_type} об окончании курса на {platform_name}

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
kk_kz: {platform_name} студенттердің курстық іс-шараларды {platform_name} орындағаны үшін берілетін сертификаттар арқылы жетістіктерді растайды

source: All rights reserved
kk_kz: Барлық құқықтар қорғалған

source: Invalid Certificate
kk_kz: Жарамсыз Сертификат

source: Certificate Validation
kk_kz: Сертификатты тексеру

source: About {platform_name} Accomplishments
kk_kz: Жетістіктер туралы {platform_name}

source: Issued On:
kk_kz: Шығарылды:

source: Certificate ID Number
kk_kz: Сертификаттың сәйкестендіру нөмірі

source: About {platform_name} Certificates
kk_kz: {platform_name} Сертификаттың сәйкестендіру нөмірі

source: How {platform_name} Validates Student Certificates
kk_kz: {platform_name} Оқушылардың сертификаттарын қалай тексереді

source: Certificates issued by {platform_name} are signed by a gpg key so that they can be validated independently by anyone with the {platform_name} public key. For independent verification, {platform_name} uses what is called a "detached signature"&quot;".
kk_kz: {platform_name} берген сертификаттарға gpg кілті қол қояды, сондықтан оларды кез-келген {platform_name} ашық кілт пайдаланушысы тексере алады. Тәуелсіз тексеру үшін {platform_name} "detached signature"&quot;" деп аталады.

source: Validate this certificate for yourself
kk_kz: Осы сертификатты өзіңіз тексеріңіз

source: {platform_name} offers interactive online classes and MOOCs.
kk_kz: {platform_name} интерактивті онлайн сабақтар мен MOOC ұсынады.

source: About {platform_name}
kk_kz: {platform_name} туралы

source: Learn more about {platform_name}
kk_kz: {platform_name} туралы көбірек біліңіз

source: Learn with {platform_name}
kk_kz: {platform_name} бірге үйреніңіз

source: Work at {platform_name}
kk_kz: {platform_name} жұмыс жаса

source: Contact {platform_name}
kk_kz: Байланыс {platform_name}

source: {platform_name} acknowledges the following student accomplishment
kk_kz: {platform_name} оқушының келесі жетістігін растайды

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
kk_kz: Курс предоставлен {partner_short_name} по инициативе {partner_long_name}.

source: a course of study offered by {partner_short_name}.
kk_kz: {partner_short_name} ұсынған оқу курсы.

source: I completed the {course_title} course on {platform_name}.
kk_kz: Мен {course_title} курсын {platform_name} бойынша аяқтадым.

source: I completed a course at {platform_name}. Take a look at my certificate.
kk_kz: Я окончил курс на {platform_name}. Взгляните на мой сертификат!

source: More Information About {user_name}'s Certificate:
kk_kz: Сертификат туралы қосымша ақпарат {user_name}:

source: {fullname}, you earned a certificate!
kk_kz: {fullname}, сіз сертификат алдыңыз!

source: Congratulations! This page summarizes what you accomplished. Show it off to family, friends, and colleagues in your social and professional networks.
kk_kz: Құттықтаймын! Бұл бетте сіз қол жеткізген нәрселер туралы қысқаша айтылады. Мұны отбасыңызға, достарыңызға және әріптестеріңізге Әлеуметтік және кәсіби желілерде көрсетіңіз.

source: More about {fullname}'s accomplishment
kk_kz: {fullname} жетістіктері туралы толығырақ

source: Username
kk_kz: Пайдаланушының аты

source: Grade
kk_kz: Баға

source: Percent
kk_kz: В процентах

source: Opened by this number of students
kk_kz: Количество открывавших слушателей

source: subsections
kk_kz: подразделы

source: Count of Students
kk_kz: Количество слушателей

source: Percent of Students
kk_kz: Процент слушателей

source: Score
kk_kz: Ұпайлар

source: problems
kk_kz: задания

source: {course_id} is not a valid course key.
kk_kz: {course_id} жарамды курс кілті емес.

source: Course {course_id} does not exist.
kk_kz: Курс {course_id} жоқ.

source: Use the checkout page hosted by the E-Commerce service.
kk_kz: Электрондық коммерция қызметінде орналастырылған тексеру парағын пайдаланыңыз.

source: Path to course(s) checkout page hosted by the E-Commerce service.
kk_kz: Электрондық коммерция қызметінде орналастырылған курсқа(курстарға) тапсырыс беру бетіне жол.

source: Cache Time To Live
kk_kz: Кэштің Өмір Сүру Уақыты

source: Specified in seconds. Enable caching by setting this to a value greater than 0.
kk_kz: Секундтарда көрсетілген. Бұл үшін 0-ден үлкен мәнді орнату арқылы кэштеуді қосыңыз.

source: Path to order receipt page.
kk_kz: Тапсырысты алу бетіне жол.

source: Automatically approve valid refund requests, without manual processing
kk_kz: Автоматически утверждать корректные запросы на возврат, без ручной обработки.

source: [Refund] User-Requested Refund
kk_kz: [Refund] пайдаланушының сауалы бойынша ақшаны қайтару

source: A refund request has been initiated for {username} ({email}). To process this request, please visit the link(s) below.
kk_kz: Қайтару сұранысы {username} ({email}) үшін басталды. Бұл сұрауды өңдеу үшін төмендегі сілтемеге (сілтемелерге) өтіңіз.

source: Receipt
kk_kz: Квитанция

source: Payment Failed
kk_kz: Платёж не выполнен

source: There was a problem with this transaction. You have not been charged.
kk_kz: С этой операцией возникла проблема. Денежные средства не были сняты с вашего счёта.

source: Make sure your information is correct, or try again with a different card or another form of payment.
kk_kz: Удостоверьтесь в правильности введённой информации, попробуйте воспользоваться другой картой или оплатить другим способом.

source: A system error occurred while processing your payment. You have not been charged.
kk_kz: Во время обработки вашего платежа возникла ошибка. Денежные средства не были сняты с вашего счёта.

source: Please wait a few minutes and then try again.
kk_kz: Пожалуйста, попробуйте ещё раз через несколько минут.

source: For help, contact {payment_support_link}.
kk_kz: Обратитесь за помощью по адресу {payment_support_link}.

source: An error occurred while creating your receipt.
kk_kz: При создании квитанции об оплате произошла ошибка.

source: If your course does not appear on your dashboard, contact {payment_support_link}.
kk_kz: Если курс не появится на вашей панели управления, напишите {payment_support_link}.

source: Earn a certificate
kk_kz: Сертификат алыңыз

source: Complete the course
kk_kz: Курсты аяқтау

source: Explore the course
kk_kz: Курсты оқыңыз

source: Not sure yet
kk_kz: Әлі сенімді емеспін

source: Wiki
kk_kz: Вики

source: This is the wiki for **{organization}**'s _{course_name}_.
kk_kz: Бұл мыналарға арналған Вики**{organization}**'s _{course_name}_.

source: Course page automatically created.
kk_kz: Курстың беті автоматты түрде құрылды.

source: Welcome to the {platform_name} Wiki
kk_kz: {platform_name} викиге қош келдіңіз

source: Visit a course wiki to add an article.
kk_kz: Бапты қосу үшін курстың вики бетіне кіріңіз.

source: Course has not started
kk_kz: Курс әлі басталған жоқ

source: Course does not start until {}
kk_kz: Курс {} дейін басталмайды

source: You have unfulfilled milestones
kk_kz: Сізде орындалмаған кезеңдер бар

source: You do not have access to this course
kk_kz: Сіз бұл курсқа кіре алмайсыз

source: You do not have access to this course on a mobile device
kk_kz: Мобильді құрылғыда бұл курсқа кіру мүмкін емес

source: Upgrade to Verified
kk_kz: Повысить до уровня «Подтверждённый сертификат»

source: {relative} ago - {absolute}
kk_kz: {relative} бұрын - {absolute}

source: in {relative} - {absolute}
kk_kz: {relative} - {absolute}

source: Course Starts
kk_kz: Курс начнётся

source: Don't forget to add a calendar reminder!
kk_kz: Күнтізбеге еске салғышты қосуды ұмытпаңыз!

source: Course starts in {time_remaining_string} on {course_start_date}.
kk_kz: Курс {time_remaining_string} {course_start_date} басталады.

source: Course starts in {time_remaining_string} at {course_start_time}.
kk_kz: Курс {time_remaining_string} {course_start_time} басталады.

source: Course End
kk_kz: Курстың аяқталуы

source: To earn a certificate, you must complete all requirements before this date.
kk_kz: Для получения сертификата вам необходимо выполнить все требования к указанному сроку.

source: After this date, course content will be archived.
kk_kz: После этой даты содержание курса будет перенесено в архив.

source: This course is archived, which means you can review course content but it is no longer active.
kk_kz: Бұл курс мұрағатталған, яғни сіз курстың мазмұнын көре аласыз, бірақ ол енді белсенді емес.

source: This course is ending in {time_remaining_string} on {course_end_date}.
kk_kz: Бұл курс {time_remaining_string} - де {course_end_date} - де аяқталады.

source: This course is ending in {time_remaining_string} at {course_end_time}.
kk_kz: Бұл курс {time_remaining_string} {course_end_time} ішінде аяқталады.

source: Certificate Available
kk_kz: Сертификат Қол Жетімді

source: Day certificates will become available for passing verified learners.
kk_kz: Күндізгі сертификаттар тексерілген оқушылардан өту үшін қол жетімді болады.

source: If you have earned a certificate, you will be able to access it {time_remaining_string} from now. You will also be able to view your certificates on your {learner_profile_link}.
kk_kz: Егер сіз сертификат алсаңыз, оған осы сәттен бастап {time_remaining_string} қол жеткізе аласыз. Сондай-ақ, куәліктеріңізді {learner_profile_link} сілтемесінен көре аласыз.

source: Learner Profile
kk_kz: Оқушының профилі

source: We are working on generating course certificates.
kk_kz: Біз курстар туралы сертификаттар жасаумен айналысамыз.

source: Upgrade to Verified Certificate
kk_kz: Повысить до уровня «Подтверждённый сертификат»

source: Verification Upgrade Deadline
kk_kz: Тексеруді жаңартудың соңғы мерзімі

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate.
kk_kz: Расталған сертификат алу арқылы жаңа біліміңіз бен дағдыларыңызды көрсету мүмкіндігін жіберіп алмаңыз.

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
kk_kz: Сіз әлі де расталған сертификатқа ауысуға құқығыңыз бар! Осы курста алған біліміңіз бен дағдыларыңызды атап өту үшін оны жалғастырыңыз.

source: by {date}
kk_kz: {date} бойынша

source: Don't forget, you have {time_remaining_string} left to upgrade to a Verified Certificate.
kk_kz: Тексерілген сертификатқа жаңарту үшін сізде {time_remaining_string} қалғанын ұмытпаңыз.

source: Don't forget to upgrade to a verified certificate by {localized_date}.
kk_kz: {localized_date} көмегімен расталған сертификатқа өтуді ұмытпаңыз.

source: In order to qualify for a certificate, you must meet all course grading requirements, upgrade before the course deadline, and successfully verify your identity on {platform_name} if you have not done so already.{button_panel}
kk_kz: Сертификат алу үшін сіз курсты бағалауға қойылатын барлық талаптарға сай болуыңыз керек, курсты өту мерзіміне дейін жаңартуыңыз керек және егер сіз әлі жасамаған болсаңыз, {platform_name} - де жеке басыңызды сәтті растауыңыз керек.{button_panel}

source: Upgrade ({upgrade_price})
kk_kz: Жаңарту ({upgrade_price})

source: Learn More
kk_kz: Толығырақ оқу

source: Retry Verification
kk_kz: Растау Әрекетін Қайталаңыз

source: Verify My Identity
kk_kz: Менің Жеке Куәлігімді Растаңыз

source: Missed Verification Deadline
kk_kz: Өткізіп Алған Растау Мерзімі

source: Unfortunately you missed this course's deadline for a successful verification.
kk_kz: Өкінішке орай, сіз сәтті растау үшін осы курсты аяқтаудың мерзімін өткізіп алдыңыз.

source: You must successfully complete verification before this date to qualify for a Verified Certificate.
kk_kz: Расталған сертификат алу үшін сіз осы күнге дейін тексеруден сәтті өтуіңіз керек.

source: There is no user with the username or email address "{user_identifier}" enrolled in this course.
kk_kz: Бұл курста осы курста тіркелген пайдаланушы аты немесе "{user_identifier}" электрондық пошта мекенжайы жоқ.

source: This type of component cannot be shown while viewing the course as a specific student.
kk_kz: Курсты белгілі бір студент ретінде қарау кезінде компоненттің бұл түрін көрсету мүмкін емес.

source: Number of days a learner has to upgrade after content is made available
kk_kz: Количество дней после даты выпуска содержимого курса, в течение которых слушателю необходимо подать заявку на подтверждённый сертификат.

source: Disable the dynamic upgrade deadline for this course run.
kk_kz: Осы курс үшін динамикалық жаңарту мерзімін өшіріңіз.

source: Disable the dynamic upgrade deadline for this organization.
kk_kz: Осы ұйым үшін динамикалық жаңарту мерзімін өшіріңіз.

source: Syllabus
kk_kz: Оқыту бағдарламасы

source: Progress
kk_kz: Алға басу

source: Textbooks
kk_kz: Учебники

source: You are not signed in. To see additional course content, {sign_in_link} or {register_link}, and enroll in this course.
kk_kz: Сіз жүйеге кірген жоқсыз. Курстың қосымша мазмұнын көру үшін {sign_in_link} немесе {register_link} және осы курсқа жазылыңыз.

source: sign in
kk_kz: кіру

source: register
kk_kz: тіркелу

source: Your enrollment: Audit track
kk_kz: Сіздің тіркелуіңіз: бақылау жолы

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
kk_kz: Сіз осы курс үшін аудит жолымен жазыласыз. Аудит жолында сертификат кірмейді.

source: Your enrollment: Honor track
kk_kz: Сіздің тіркелуіңіз: Үздік жолы

source: You are enrolled in the honor track for this course. The honor track does not include a certificate.
kk_kz: Сіз осы курстың құрметті жолына жазыласыз. Құрметті жолға сертификат кірмейді.

source: We're working on it...
kk_kz: Біз осы бағытта жұмыс істеп жатырмыз...

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
kk_kz: Біз сіздің сертификатыңызды жасаймыз. Сіз өзіңіздің курстарыңызда жұмыс істеуді жалғастыра аласыз және оларға сілтеме дайын болған кезде осы жерде және бақылау тақтасында пайда болады.

source: Your certificate has been invalidated
kk_kz: Сіздің сертификатыңыз жарамсыз деп танылды

source: Please contact your course team if you have any questions.
kk_kz: Егер сізде сұрақтар туындаса, курс тобына хабарласыңыз.

source: Congratulations, you qualified for a certificate!
kk_kz: Құттықтаймыз, сіз сертификат алдыңыз!

source: You've earned a certificate for this course.
kk_kz: Сіз осы курсқа сертификат алдыңыз.

source: Certificate unavailable
kk_kz: Сертификат қолжетімсіз

source: You have not received a certificate because you do not have a current {platform_name} verified identity.
kk_kz: Сізде сертификат болған жоқ, өйткені сізде {platform_name} расталған жеке тұлға жоқ.

source: Your certificate is available
kk_kz: Сіздің сертификатыңыз қол жетімді

source: To see course content, {sign_in_link} or {register_link}.
kk_kz: Курс мазмұнын көру үшін {sign_in_link} немесе {register_link}.

source: You must be enrolled in the course to see course content. {enroll_link_start}Enroll now{enroll_link_end}.
kk_kz: Для доступа к содержимому необходима запись на курс. {enroll_link_start}Запишитесь сейчас{enroll_link_end}.

source: You must be enrolled in the course to see course content.
kk_kz: Курстың мазмұнымен танысу үшін сіз курсқа қабылдануыңыз керек.

source: Invalid location.
kk_kz: Дұрыс емес орын.

source: User {username} has never accessed problem {location}
kk_kz: {username} пайдаланушы {location} тапсырмасын қараған жоқ

source: You must be signed in to {platform_name} to create a certificate.
kk_kz: Сертификат жасау үшін {platform_name} атауымен кіру керек.

source: Course is not valid
kk_kz: Курс жарамсыз

source: Your certificate will be available when you pass the course.
kk_kz: Курсты аяқтаған кезде сіздің сертификатыңыз қол жетімді болады.

source: Certificate has already been created.
kk_kz: Сертификат уже создан

source: Certificate is being created.
kk_kz: Создание сертификата
