Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: New Team Member Information
kk_kz: Информация о новом члене команды

source: User's Email Address
kk_kz: Адрес электронной почты пользователя

source: Provide the email address of the user you want to add as Staff
kk_kz: Введите электронный адрес пользователя, которого вы хотите добавить в качестве сотрудника

source: Add User
kk_kz: Добавить пользователя

source: Add Team Members to This Course
kk_kz: Добавить членов команды в этот курс

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
kk_kz: Благодаря возможности добавлять новых участников в команду, создание курсов становится коллективным процессом. Пользователи должны быть зарегистрированы в {studio_name} и иметь активную учётную запись.

source: Add a New Team Member
kk_kz: Добавить нового члена команды

source: Course Team Roles
kk_kz: Роли внутри команды учебного курса

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
kk_kz: Члены команды курса, или сотрудники, являются соавторами курса. Им предоставляется достаточно прав для создания и редактирования всех материалов курса.

source: Admins are course team members who can add and remove other course team members.
kk_kz: Администраторы – это члены команды курса, которые могут добавлять и удалять других членов команды.

source: All course team members can access content in Studio, the LMS, and Insights, but are not automatically enrolled in the course.
kk_kz: Всем членам команды курса становится доступно содержимое курса в Studio, LMS и Insights, но они автоматически не записываются на курс.

source: Transferring Ownership
kk_kz: Передача права на собственность

source: Every course must have an Admin. If you are the Admin and you want to transfer ownership of the course, click <strong>Add admin access</strong> to make another user the Admin, then ask that user to remove you from the Course Team list.
kk_kz: У каждого курса должен быть администратор. Если вы являетесь администратором и хотите передать управление курсом другому пользователю, сделайте его администратором, нажав <strong>«Предоставить доступ администратора»</strong>, а затем попросите этого пользователя удалить вас из списка «Команда курса».

source: Library User Access
kk_kz: Доступ пользователя к библиотеке

source: User Access
kk_kz: Доступ для пользователей

source: Grant Access to This Library
kk_kz: Открыть доступ к этой библиотеке

source: Provide the email address of the user you want to add
kk_kz: Введите электронный адрес пользователя, которого вы хотите добавить

source: Add More Users to This Library
kk_kz: Добавить пользователей этой библиотеки

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
kk_kz: Открыть доступ к библиотеке другим членам команды вашего курса. У новых пользователей библиотеки должна быть активная учётная запись {studio_name}.

source: Add a New User
kk_kz: Добавить нового пользователя

source: Library Access Roles
kk_kz: Роли прав доступа к библиотеке

source: There are three access roles for libraries: User, Staff, and Admin.
kk_kz: Права доступа к библиотекам группируются в три роли: пользователь, сотрудник и администратор.

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
kk_kz: Пользователи библиотек могут просматривать их содержимое, ссылаться на компоненты из библиотеки или использовать компоненты в своих курсах, но не могут изменять содержимое библиотеки.

source: Library Staff are content co-authors. They have full editing privileges on the contents of a library.
kk_kz: Сотрудники – соавторы материалов библиотеки. Они обладают неограниченным правом изменять содержимое библиотеки.

source: Library Admins have full editing privileges and can also add and remove other team members. There must be at least one user with the Admin role in a library.
kk_kz: Администраторы библиотеки обладают неограниченным правом редактирования, а также могут добавлять или удалять других членов команды. По крайней мере один из пользователей должен иметь права Администратора в библиотеке.

source: Sign Up
kk_kz: Зарегистрироваться

source: Sign Up for {studio_name}
kk_kz: Регистрация в {studio_name}

source: Already have a {studio_name} Account? Sign in
kk_kz: Уже зарегистрированы в {studio_name}? Войдите

source: Ready to start creating online courses? Sign up below and start creating your first {platform_name} course today.
kk_kz: Готовы приступить к созданию онлайн-курсов? Зарегистрируйтесь и начните создавать свой первый курс {platform_name} уже сегодня.

source: Required Information to Sign Up for {studio_name}
kk_kz: Информация, необходимая для регистрации в {studio_name}

source: This will be used in public discussions with your courses and in our edX101 support forums
kk_kz: Это будет использоваться в публичных обсуждениях ваших курсов и на нашем форуме поддержки

source: Your Location
kk_kz: Ваше местонахождение

source: Preferred Language
kk_kz: Предпочтительный язык

source: I agree to the {a_start} Terms of Service {a_end}
kk_kz: Я принимаю {a_start} Условия предоставления услуг {a_end}

source: Create My Account &amp; Start Authoring Courses
kk_kz: Создать учётную запись и начать разработку курсов

source: Common {studio_name} Questions
kk_kz: Основные вопросы о {studio_name}

source: Who is {studio_name} for?
kk_kz: Для кого существует {studio_name}?

source: {studio_name} is for anyone that wants to create online courses that leverage the global {platform_name} platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
kk_kz: {studio_name} —для тех, кто хочет создавать онлайн-курсы на платформе {platform_name}. Чаще всего наши пользователи – преподаватели, тьюторы, ассистенты, персонал курса и члены учебных групп.

source: How technically savvy do I need to be to create courses in {studio_name}?
kk_kz: Какой уровень технической подготовки необходим для создания курсов в {studio_name}?

source: {studio_name} is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
kk_kz: {studio_name} разработана для использования практически любым человеком, знакомым с основными сетевыми средами (Wordpress, Moodle и др.). Знание программирования не требуется, но для некоторых расширенных функций могут пригодиться технические навыки. Мы всегда рады помочь вам, так что не бойтесь начать прямо сейчас!

source: I've never authored a course online before. Is there help?
kk_kz: Я раньше никогда не создавал онлайн-курсы. Могу ли я рассчитывать на помощь?

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
kk_kz: Безусловно. Мы создали онлайн-курс, edX101, в котором приведены основные рекомендации: от видеосъёмки и создания упражнений до основ ведения онлайн-курсов. Кроме того, мы всегда готовы помочь, просто напишите нам.

source: Schedule & Details Settings
kk_kz: Расписание и обзор курса

source: Schedule & Details
kk_kz: Расписание и обзор курса

source: Basic Information
kk_kz: Основная информация

source: The nuts and bolts of your course
kk_kz: Гайки и болты вашего курса

source: This field is disabled: this information cannot be changed.
kk_kz: Это поле недоступно: данная информация не может быть изменена.

source: Course Summary Page
kk_kz: Страница с описанием курса

source: (for student enrollment and access)
kk_kz: (для зачисления и перехода к курсу)

source: Enroll in {course_display_name}
kk_kz: Записаться на курс {course_display_name}

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
kk_kz: Курс «{course_display_name}», организованный {platform_name}, открыт для записи. Пожалуйста, перейдите на страницу курса по адресу {link_for_about_page}, чтобы записаться.

source: Send a note to students via email
kk_kz: Отправить письмо слушателям по электронной почте

source: Invite your students
kk_kz: Пригласить слушателей

source: Promoting Your Course with {platform_name}
kk_kz: Пусть все узнают о вашем курсе на {platform_name}

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
kk_kz: Страница с кратким описанием вашего курса будет доступна, только когда курс будет объявлен. Для редактирования и предпросмотра этой страницы, следуйте инструкциям своего методиста.

source: Course Credit Requirements
kk_kz: Требования для получения зачёта на курсе

source: Steps required to earn course credit
kk_kz: Что нужно сделать для получения зачёта

source: Minimum Grade
kk_kz: Минимальная оценка

source: Successful Proctored Exam
kk_kz: Наблюдаемое испытание успешно сдано

source: Proctored Exam {number}
kk_kz: Наблюдаемое испытание {number}

source: ID Verification
kk_kz: Подтверждение личности

source: In-Course Reverification {number}
kk_kz: Повторное подтверждение личности {number}

source: Course Pacing
kk_kz: Обучение на курсе

source: Set the pacing for this course
kk_kz: Задать порядок обучения на курсе

source: Instructor-Paced
kk_kz: По определённому расписанию

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
kk_kz: Курсы с определённым расписанием проходят по расписанию, заданному автором курса. Вы можете задать даты выпуска для материалов курса и сроки сдачи заданий.

source: Self-Paced
kk_kz: Свободное расписание

source: Self-paced courses do not have release dates for course content or due dates for assignments. Learners can complete course material at any time before the course end date.
kk_kz: Курсы, обучение на которых проходит в произвольном темпе, не устанавливают дат выпуска содержимого курса и сроков сдачи заданий. Слушатели могут работать с материалами курса в любое время до даты окончания курса.

source: Course Schedule
kk_kz: Расписание курса

source: Dates that control when your course can be viewed
kk_kz: Даты, определяющие доступность вашего курса для просмотра.

source: First day the course begins
kk_kz: Первый день курса

source: Course Start Time
kk_kz: Время начала курса

source: Last day your course is active
kk_kz: Последний день вашего курса

source: Course End Time
kk_kz: Время окончания курса

source: Certificates Available Date
kk_kz: Дата выпуска сертификатов

source: Enrollment Start Date
kk_kz: Дата начала регистрации

source: First day students can enroll
kk_kz: Первый день регистрации слушателей

source: Enrollment Start Time
kk_kz: Время начала регистрации

source: Enrollment End Date
kk_kz: Дата окончания регистрации

source: Last day students can enroll.
kk_kz: Последний день регистрации слушателей

source: Contact your edX partner manager to update these settings.
kk_kz: Свяжитесь с вашим менеджером edX для обновления этих настроек.

source: Enrollment End Time
kk_kz: Время окончания регистрации

source: Course Details
kk_kz: Информация о курсе

source: Provide useful information about your course
kk_kz: Предоставьте полезную информацию о курсе

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language. It is also used to localize the 'From:' field in bulk emails.
kk_kz: Укажите здесь язык обучения на курсе. Это поможет пользователям найти курсы, которые преподаются на определённом языке. Также язык курса используется для локализации поля «От:» в рассылках.

source: Introducing Your Course
kk_kz: Ознакомление с вашим курсом

source: Information for prospective students
kk_kz: Информация для абитуриентов

source: Course Title
kk_kz: Название курса

source: Displayed as title on the course details page. Limit to 50 characters.
kk_kz: Заголовок на странице «Информация о курсе». Не более 50 символов.

source: Course Subtitle
kk_kz: Подзаголовок курса

source: Displayed as subtitle on the course details page. Limit to 150 characters.
kk_kz: Подзаголовок на странице «Информация о курсе». Не более 150 символов.

source: Course Duration
kk_kz: Продолжительность курса

source: Displayed on the course details page. Limit to 50 characters.
kk_kz: Отображается на странице «Информация о курсе». Не более 50 символов.

source: Course Description
kk_kz: Описание курса

source: Displayed on the course details page. Limit to 1000 characters.
kk_kz: Отображается на странице «Информация о курсе». Не более 1000 символов.

source: Course Short Description
kk_kz: Краткое описание курса

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
kk_kz: Появляется на странице каталога курсов, когда слушатели набирают название курса. Не более 150 символов.

source: Course Overview
kk_kz: Обзор курса

source: HTML Code Editor
kk_kz: Редактор HTML

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
kk_kz: Вводная информация, требования, часто задаваемые вопросы, которые появятся на {a_link_start}странице «Описание курса»{a_link_end} (в формате HTML)

source: Course Card Image
kk_kz: Изображение для "визитной карточки" курса

source: You can manage this image along with all of your other {a_link_start}files and uploads{a_link_end}
kk_kz: Вы можете управлять этим изображением, а также остальными {a_link_start}загруженными файлами{a_link_end}

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
kk_kz: У вашего курса в настоящее время нет изображения. Пожалуйста, загрузите его (формат JPEG или PNG, минимально рекомендуемые размеры: 375 пикселей в ширину и 200 пикселей в высоту)

source: Your course image URL
kk_kz: Ссылка URL на изображение курса

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
kk_kz: Пожалуйста, введите действительный путь к вашему изображению курса и его имя (примечание: поддерживаются только форматы JPEG и PNG)

source: Upload Course Card Image
kk_kz: Загрузить изображение для «визитной карточки» курса

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
kk_kz: Изображение для вашего курса отсутствует. Пожалуйста, загрузите его (формат JPEG или PNG, рекомендуемые размеры: не менее 1440 пикселей в ширину и 400 пикселей в высоту)

source: Your banner image URL
kk_kz: URL-адрес изображения для заголовка курса

source: Please provide a valid path and name to your banner image (Note: only JPEG or PNG format supported)
kk_kz: Пожалуйста, введите корректные путь и название изображения для заголовка вашего курса (примечание: поддерживаются только форматы JPEG и PNG)

source: Upload Course Banner Image
kk_kz: Загрузить изображение для заголовка курса

source: Video Thumbnail Image
kk_kz: Миниатюра видео

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
kk_kz: Изображение-миниатюра для ознакомительного видео к Вашему курсу отсутствует. Пожалуйста, загрузите его (формат JPEG или PNG, рекомендуемые размеры - не менее 375 пикселей в ширину и 200 пикселей в высоту)

source: Your video thumbnail image URL
kk_kz: Ссылка на миниатюру видео

source: Please provide a valid path and name to your video thumbnail image (Note: only JPEG or PNG format supported)
kk_kz: Пожалуйста, введите корректные путь и наименование изображения-миниатюры к видео (примечание: поддерживаются только форматы JPEG и PNG)

source: Upload Video Thumbnail Image
kk_kz: Загрузить миниатюру видео

source: Course Introduction Video
kk_kz: Введение в курс (видео)

source: Delete Current Video
kk_kz: Удалить текущее видео

source: your YouTube video's ID
kk_kz: идентификатор вашего видео на YouTube

source: Enter your YouTube video's ID (along with any restriction parameters)
kk_kz: Введите ID вашего видео на YouTube (вместе с параметрами проигрывателя)

source: Learning Outcomes
kk_kz: Результаты обучения

source: Add the learning outcomes for this course
kk_kz: Добавить результаты обучения для этого курса

source: Add Learning Outcome
kk_kz: Добавить результат обучения

source: Add details about the instructors for this course
kk_kz: Добавить информацию о преподавателях курса

source: Add Instructor
kk_kz: Добавить преподавателя

source: Expectations of the students taking this course
kk_kz: Ожидания слушателей этого курса

source: Hours of Effort per Week
kk_kz: Еженедельная нагрузка в часах

source: Time spent on all course work
kk_kz: Вся нагрузка курса

source: Prerequisite Course
kk_kz: Обязательный предыдущий курс

source: Course that students must complete before beginning this course
kk_kz: Курс, который слушатели должны окончить перед началом этого курса

source: set pre-requisite course
kk_kz: установить обязательный предыдущий курс

source: Require students to pass an exam before beginning the course.
kk_kz: Назначить вступительное испытание перед началом курса.

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
kk_kz: Теперь вы можете просматривать и редактировать вступительное испытание к курсу {link_start}Course Outline{link_end}.

source: Grade Requirements
kk_kz: Проходной балл

source: The score student must meet in order to successfully complete the entrance exam.
kk_kz: Количество баллов, которое должен набрать слушатель для успешного прохождения вступительного испытания.

source: Course Content License
kk_kz: Лицензия на содержание курса

source: Select the default license for course content
kk_kz: Выберите лицензию по умолчанию для содержания курса

source: How are these settings used?
kk_kz: Как использовать эти параметры?

source: Your course's schedule determines when students can enroll in and begin a course.
kk_kz: Расписание определяет, когда слушатели смогут зарегистрироваться и начать прохождение курса.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
kk_kz: Остальная информация с этой страницы появится на странице «О курсе». Она включает в себя обзор курса, изображение курса, вступительное видео и приблизительные временные рамки.

source: Your policy changes have been saved.
kk_kz: Ваши изменения сохранены.

source: There was an error saving your information. Please see below.
kk_kz: При сохранении вашей информации произошла ошибка. Подробности см. ниже.

source: Manual Policy Definition
kk_kz: Ручные настройки

source: {strong_start}Warning{strong_end}: Do not modify these policies unless you are familiar with their purpose.
kk_kz: {strong_start}Предупреждение{strong_end}: не изменяйте эти настройки, если вы не знакомы с их назначением.

source: Show Deprecated Settings
kk_kz: Показать устаревшие настройки

source: What do advanced settings do?
kk_kz: Для чего нужны расширенные настройки?

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
kk_kz: Расширенные настройки определяют функциональность отдельного курса. На этой странице вы можете вручную редактировать правила, заданные парами ключей и значений в формате JSON, определяющие настройки данного курса.

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
kk_kz: Любые настройки, которые вы изменяете здесь, переопределяют все установки, заданные в иных частях {studio_name}. Не изменяйте настройки, если вам неизвестны их назначение и синтаксическая конструкция.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (") around the string. Do not use single quotation marks (').
kk_kz: {em_start}Примечание:{em_end} при вводе строковых значений настроек обязательно помещайте их внутри двойных кавычек ("). Не используйте одинарные кавычки (').

source: Grading Settings
kk_kz: Настройки оценивания

source: Overall Grade Range
kk_kz: Общие пределы оценок

source: Your overall grading scale for student final grades
kk_kz: Ваша общая оценочная шкала для итоговой оценки слушателей

source: Add grade
kk_kz: Добавить оценку

source: Credit Eligibility
kk_kz: Условия получения зачёта

source: Settings for course credit eligibility
kk_kz: Настройки критериев для получения зачёта

source: Minimum Credit-Eligible Grade:
kk_kz: Проходной балл для получения зачёта:

source: Must be greater than or equal to the course passing grade
kk_kz: Должен быть выше или равен проходному баллу на курсе

source: Grading Rules &amp; Policies
kk_kz: Правила оценивания

source: Deadlines, requirements, and logistics around grading student work
kk_kz: Сроки, требования и организация оценивания проверочных работ

source: Grace Period on Deadline:
kk_kz: Льготный период для срока сдачи:

source: Leeway on due dates
kk_kz: Допустимое отставание от установленных сроков

source: Assignment Types
kk_kz: Типы заданий

source: Categories and labels for any exercises that are gradable
kk_kz: Категории и метки для любых оцениваемых упражнений

source: New Assignment Type
kk_kz: Назначение нового типа

source: What can I do on this page?
kk_kz: Что можно сделать на этой странице?

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
kk_kz: С помощью слайдера на общей шкале оценок вы можете установить зачётную – зачёт/незачёт – или пятибальную – 5...1 – систему оценивания, а также количество баллов, необходимое для получения каждой оценки.

source: You can specify whether your course offers students a grace period for late assignments.
kk_kz: Вы можете указать, разрешается ли на вашем курсе сдавать задания с опозданием в течение льготного периода.

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
kk_kz: Вы можете определить типы заданий, например, домашние задания, лабораторные работы и экзамены, и указать, какую часть оценки составляют задания каждого типа.

source: Expand or Collapse
kk_kz: Развернуть/свернуть

source: Access Settings
kk_kz: Настройки доступа

source: Set Access
kk_kz: Установить доступ

source: This block contains multiple components.
kk_kz: Этот блок содержит несколько компонентов.

source: New Textbook
kk_kz: Новый учебник

source: Why should I break my textbook into chapters?
kk_kz: Зачем разбивать учебник на главы?
