Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Here you can see what extensions have been granted on particular units or for a particular student.
kk_kz: Здесь вы можете просмотреть, какие продления были предоставлены для определённого задания или определённого обучающегося.

source: Choose a graded unit and click the button to obtain a list of all students who have extensions for the given unit.
kk_kz: Выберите оцениваемый блок и нажмите на кнопку для получения списка обучающихся, для которых продлены сроки сдачи задания.

source: List all students with due date extensions
kk_kz: Тапсырудың кеңейтілген мерзімдерімен барлық студенттердің тізімі

source: Specify a student to see all of that student's extensions.
kk_kz: Осы оқушының барлық кеңейтімдерін көру үшін оқушыны көрсетіңіз.

source: List date extensions for student
kk_kz: Студент үшін оған дейін мерзімдер ұзартылған күндердің тізімін көрсету

source: Resetting extensions
kk_kz: Мерзімдерді ұзартуды ысыру

source: Resetting a problem's due date rescinds a due date extension for a student on a particular unit. This will revert the due date for the student back to the problem's original due date.
kk_kz: Сброс дополнительного срока отменяет продление срока сдачи задания. При этом крайняя дата сдачи возвращается к изначально заданной.

source: Reset due date for student
kk_kz: Оқушы үшін тапсыру мерзімін ысыру

source: Generate Registration Code Modal
kk_kz: Создайте регистрационный код

source: * Required Information
kk_kz: * Қажетті ақпарат

source: The organization that purchased enrollments in the course
kk_kz: Курсқа қабылдауды сатып алған ұйым

source: Organization Contact
kk_kz: Ұйым байланыстары

source: Organization Contact Name
kk_kz: Ұйымның байланыс аты

source: The primary contact at the organization
kk_kz: Ұйымдағы негізгі байланыс

source: Invoice Recipient
kk_kz: Шот-фактураны алушы

source: The contact who should receive the invoice
kk_kz: Шот - фактураны алу керек Байланыс адамы

source: Organization Billing Address
kk_kz: Ұйымның шот-фактурасының мекен-жайы

source: Address Line 1
kk_kz: Адрестік жол 1

source: Address Line 2
kk_kz: Адрестік жол 2

source: Address Line 3
kk_kz: Адрестік жол 3

source: State/Province
kk_kz: Мемлекет / Облыс / Аудан

source: Zip
kk_kz: Индекс

source: Unit Price
kk_kz: Бірлік бағасы

source: The price per enrollment purchased
kk_kz: Сатып алынған тіркеу бағасы

source: Number of Enrollment Codes
kk_kz: Тіркеу кодтарының саны

source: The total number of enrollment codes to create
kk_kz: Жасау үшін тіркеу кодтарының жалпы саны

source: Course Team Internal Reference
kk_kz: Курс бойынша топтың ішкі анықтамасы

source: Internal reference information for the sale
kk_kz: Сатуға арналған ішкі анықтамалық ақпарат

source: Customer Reference
kk_kz: Клиентке сілтеме

source: Customer's purchase order or other reference information
kk_kz: Клиентті сатып алуға тапсырыс немесе басқа анықтамалық ақпарат

source: Send me a copy of the invoice
kk_kz: Маған шот-фактураның көшірмесін жіберіңіз

source: For analytics about your course, go to {link_start}{analytics_dashboard_name}{link_end}.
kk_kz: Курс туралы аналитикалық ақпарат алу үшін сілтемеге өтіңіз {link_start}{analytics_dashboard_name}{link_end}.

source: Instructor Dashboard
kk_kz: Оқытушының үстелі

source: View Course in Studio
kk_kz: Studio Курсты қарау

source: Enrollment Code Status
kk_kz: Тіркеу кодының мәртебесі

source: Change the status of an enrollment code.
kk_kz: Тіркеу кодының күйін өзгертіңіз.

source: Enrollment Code
kk_kz: Қабылдау коды

source: Find Enrollment Code
kk_kz: Тіркеу Кодын Табыңыз

source: Enter email addresses and/or usernames separated by new lines or commas.
kk_kz: Жаңа жолдармен немесе үтірлермен бөлінген электрондық пошта мекенжайларын және/немесе пайдаланушы аттарын енгізіңіз.

source: You will not get notification for emails that bounce, so please double-check spelling.
kk_kz: Сіз келмеген хаттар туралы хабарламаларды алмайсыз, сондықтан, жазылуын екі рет тексеріңіз.

source: Enter the reason why the students are to be manually enrolled or unenrolled.
kk_kz: Оқушыларды қолмен қабылдау немесе қабылдамау себебін енгізіңіз.

source: This cannot be left blank and will be recorded and presented in Enrollment Reports.
kk_kz: Оны бос қалдыруға болмайды және тіркеу туралы есептерде жазылады және ұсынылады.

source: Therefore, please give enough detail to account for this action.
kk_kz: Сондықтан бұл әрекетті түсіндіру үшін жеткілікті түрде егжей-тегжейлі хабарлаңыз.

source: Reason
kk_kz: Себеп

source: Register/Enroll Students
kk_kz: Студенттерді Тіркеу/Қабылдау

source: To register and enroll a list of users in this course, choose a CSV file that contains the following columns in this exact order: email, username, name, and country. Please include one student per row and do not include any headers, footers, or blank lines.
kk_kz: Осы курста пайдаланушылар тізімін тіркеу және тіркеу үшін келесі бағандардан тұратын CSV файлын таңдаңыз: электрондық пошта мекенжайы, пайдаланушы аты, аты және ел. Жолда бір оқушыны көрсетіңіз және жоғарғы, төменгі деректеме немесе бос жолдарды қоспаңыз.

source: Upload a CSV for bulk enrollment
kk_kz: Жаппай тіркеу үшін CSV файлын жүктеңіз

source: Upload CSV
kk_kz: CSV жүктеу

source: Batch Beta Tester Addition
kk_kz: Пакеттік Бета-Тестерді Қосу

source: Note: Users must have an activated {platform_name} account before they can be enrolled as beta testers.
kk_kz: Ескерту.Пайдаланушылар бета-тестерлер ретінде тіркелмес бұрын белсендірілген {platform_name} есептік жазбасы болуы керек.

source: If this option is {em_start}checked{em_end}, users who have not enrolled in your course will be automatically enrolled.
kk_kz: Егер бұл параметр {em_start} {em_end} орнатылса, курсқа жазылмаған пайдаланушылар автоматты түрде жазылады.

source: Checking this box has no effect if 'Remove beta testers' is selected.
kk_kz: Отметка этого поля не будет иметь эффекта, если выбрано «Удаление бета-тестеров»

source: Add beta testers
kk_kz: Бета тестерлерді қосу

source: Remove beta testers
kk_kz: Бета тестерлерді жою

source: Course Team Management
kk_kz: Курс тобын басқару

source: Select a course team role:
kk_kz: Курс тобының рөлін таңдаңыз:

source: Getting available lists...
kk_kz: Қолжетімді тізімдерді алу...

source: Staff cannot modify these lists. To manage course team membership, a course Admin must give you the Admin role to add Staff or Beta Testers, or the Discussion Admin role to add discussion moderators and TAs.
kk_kz: Қызметкерлер бұл тізімдерді өзгерте алмайды. Курс командасының мүшелігін басқару үшін курс әкімшісі сізге қызметкерлерді немесе бета-тестерлерді қосу үшін Әкімші рөлін немесе талқылау модераторлары мен TAS қосу үшін талқылау әкімшісінің рөлін ұсынуы керек.

source: Course team members with the Staff role help you manage your course. Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Staff also have access to your course in Studio and Insights. You can only give course team roles to enrolled users.
kk_kz: Қызметкерлер рөлі бар Курс тобының мүшелері Сіздің курсыңызды басқаруға көмектеседі. Қызметкерлер студенттерді қабылдай және қабылдай алмайды, сонымен қатар олардың бағаларын өзгерте алады және курстың барлық мәліметтеріне қол жеткізе алады. Қызметкерлер студиядағы курсқа және Ақпаратқа қол жеткізе алады. Сіз тек тіркелген пайдаланушыларға курс командасындағы рөлдерді тағайындай аласыз.

source: Add Staff
kk_kz: Персоналды қосу

source: Admin
kk_kz: Әкімші

source: Course team members with the Admin role help you manage your course. They can do all of the tasks that Staff can do, and can also add and remove the Staff and Admin roles, discussion moderation roles, and the beta tester role to manage course team membership. You can only give course team roles to enrolled users.
kk_kz: Әкімші рөлі бар Курс тобының мүшелері Сіздің курсыңызды басқаруға көмектеседі. Олар қызметкерлер орындай алатын барлық тапсырмаларды орындай алады, сонымен қатар қызметкерлер мен әкімшінің рөлдерін, талқылау модераторының рөлдерін және курс тобының мүшелігін басқарудағы бета-тестердің рөлін қоса және алып тастай алады. Сіз тек тіркелген пайдаланушыларға курс командасындағы рөлдерді тағайындай аласыз.

source: Add Admin
kk_kz: Админді Қосу

source: Beta Testers
kk_kz: Beta тестерлер

source: Beta Testers can see course content before other learners. They can make sure that the content works, but have no additional privileges. You can only give course team roles to enrolled users.
kk_kz: Бета-тестерлер курстың мазмұнын басқа оқушыларға қарағанда ертерек көре алады. Олар мазмұнның жұмыс істейтініне көз жеткізе алады, бірақ қосымша артықшылықтары жоқ. Сіз тек тіркелген пайдаланушыларға курс командасындағы рөлдерді тағайындай аласыз.

source: Add Beta Tester
kk_kz: Бета Тестерді қосу

source: Discussion Admins
kk_kz: Талқылау әкімшілері

source: Discussion Admins can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They can also add and remove the discussion moderation roles to manage course team membership. Only enrolled users can be added as Discussion Admins.
kk_kz: Талқылау әкімшілері кез-келген хабарламаны өңдей немесе жоя алады, дұрыс емес жалаушаларды жоя алады, тақырыптарды жауып, қайта ашады, жауаптарды мақұлдайды және барлық топтардағы хабарламаларды көре алады. Олардың лауазымдары "штаттық" деп белгіленген. Сондай-ақ, олар курс тобының мүшелігін басқару үшін талқылау модераторының рөлдерін қосып, жоя алады. Талқылау әкімшілері ретінде тек тіркелген пайдаланушыларды қосуға болады.

source: Add Discussion Admin
kk_kz: Талқылау Әкімшісін қосу

source: Discussion Moderators
kk_kz: Талқылау модераторлары

source: Discussion Moderators can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They cannot manage course team membership by adding or removing discussion moderation roles. Only enrolled users can be added as Discussion Moderators.
kk_kz: Талқылау модераторлары кез-келген хабарламаны өңдей немесе жоя алады, дұрыс емес жалаушаларды жоя алады, тақырыптарды жауып, қайта ашады, жауаптарды мақұлдайды және барлық топтардағы хабарламаларды көре алады. Олардың лауазымдары "штаттық" деп белгіленген. Олар талқылау модераторының рөлдерін қосу немесе жою арқылы курс тобының мүшелігін басқара алмайды. Талқылау модераторлары ретінде тек тіркелген пайдаланушыларды қосуға болады.

source: Add Moderator
kk_kz: Модераторды қосу

source: Group Community TA
kk_kz: Ta топтық қауымдастығы

source: Group Community TAs are members of the community who help course teams moderate discussions. Group Community TAs see only posts by learners in their assigned group. They can edit or delete posts, clear flags, close and re-open threads, and endorse responses, but only for posts by learners in their group. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Group Community TAs.
kk_kz: Топтық қоғамдастықтың ТАС-бұл курс топтарына пікірталастарды модерациялауға көмектесетін қауымдастық мүшелері. Топтық қауымдастық әкімшілері тек тағайындалған топтағы оқушылардың хабарламаларын көреді. Олар редакциялауға немесе жоюға хабар түсіруге, жалаушалар, жабуға және қайта ашуға тақырыптар мен мақұлдауға және жауаптар, бірақ тек хабарларды оқушылардың топта. Олардың хабарламалары "TA қауымдастығы"деп белгіленген. Топтық қоғамдастық мүшелері ретінде тек тіркелген студенттерді қосуға болады.

source: Add Group Community TA
kk_kz: TA тобының қауымдастығын қосыңыз

source: Community TAs are members of the community who help course teams moderate discussions. They can see posts by learners in their assigned cohort or enrollment track, and can edit or delete posts, clear flags, close or re-open threads, and endorse responses. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Community TAs.
kk_kz: Тас қоғамдастықтары-бұл курс топтарына пікірталастарды модерациялауға көмектесетін қауымдастық мүшелері. Олар оқушылардың хабарларын тағайындалған топта немесе қабылдау тізімінде көре алады, сонымен қатар хабарламаларды өңдей немесе жоя алады, құсбелгілерді алып тастайды, тақырыптарды жабады немесе қайта ашады және жауаптарды мақұлдайды. Олардың хабарламалары "TA қауымдастығы"деп белгіленген. TAS қауымдастығы ретінде тек тіркелген студенттерді қосуға болады

source: Add Community TA
kk_kz: Қоғамдастық топ басын қосу

source: CCX Coaches
kk_kz: CCX жаттықтырушылары

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
kk_kz: CCX жаттықтырушылары Осы курстың негізінде өз курстарын құра алады, оларды студенттерге Осы курстың материалдары негізінде жеке нұсқаулар беру үшін қолдана алады.

source: Add CCX Coach
kk_kz: CCX жаттықтырушысын қосыңыз

source: There is no data available to display at this time.
kk_kz: В настоящий момент данных для вывода нет.

source: Use Reload Graphs to refresh the graphs.
kk_kz: Нажмите «Обновить графики», чтобы перезагрузить их.

source: Reload Graphs
kk_kz: Обновить графики

source: Subsection Data
kk_kz: Данные по подразделу

source: Each bar shows the number of students that opened the subsection.
kk_kz: Каждый столбик показывает количество обучающихся, открывавших подраздел.

source: You can click on any of the bars to list the students that opened the subsection.
kk_kz: Вы можете щёлкнуть по любому столбику, чтобы получить список обучающихся, открывавших подраздел.

source: You can also download this data as a CSV file.
kk_kz: Вы также можете скачать эти данные в файле формата CSV.

source: Download Subsection Data for all Subsections as a CSV
kk_kz: Скачать данные по всем подразделам в формате CSV

source: Grade Distribution Data
kk_kz: Информация о распределении оценок

source: Each bar shows the grade distribution for that problem.
kk_kz: Каждый столбик показывает распределение оценок за отдельное задание.

source: You can click on any of the bars to list the students that attempted the problem, along with the grades they received.
kk_kz: Вы можете щёлкнуть по любому из столбцов, чтобы получить список обучающихся, выполнивших задание, а также список полученных ими оценок.

source: Download Problem Data for all Problems as a CSV
kk_kz: Скачать данные по всем заданиям в формате CSV

source: Grade Distribution per Problem
kk_kz: Распределение оценок за задания

source: Download Student Opened as a CSV
kk_kz: Скачать данные слушателя в формате CSV

source: Download Student Grades as a CSV
kk_kz: Скачать оценки слушателя в формате CSV

source: This is a partial list, to view all students download as a csv.
kk_kz: Это неполный список. Скачайте файл в формате CSV для просмотра данных всех студентов.

source: There are no problems in this section.
kk_kz: В этом разделе нет заданий.

source: Send to:
kk_kz: Жіберу:

source: Myself
kk_kz: Маған

source: Staff and Administrators
kk_kz: Қызметкерлер мен администраторлар

source: All Learners
kk_kz: Барлық оқып-үйренушілер

source: Cohort:
kk_kz: Группа:

source: (Learners not explicitly assigned to a cohort)
kk_kz: (Когортқа анық жатқызылмаған оқушылар)

source: Learners in the {track_name} Track
kk_kz: Оқушылар {track_name} тректегі

source: Subject:
kk_kz: Тема:

source: (Maximum 128 characters)
kk_kz: (Ең көбі 128 таңба)

source: Message:
kk_kz: Хабардың мәтіні:

source: We recommend sending learners no more than one email message per week. Before you send your email, review the text carefully and send it to yourself first, so that you can preview the formatting and make sure embedded images and links work correctly.
kk_kz: Біз оқушыларға аптасына бір ғана электрондық пошта хабарламасын жіберуді ұсынамыз. Электрондық поштаны жібермес бұрын, мәтінді мұқият қарап шығыңыз және алдымен пішімдеуді қарап, кірістірілген суреттер мен сілтемелер дұрыс жұмыс істейтініне көз жеткізу үшін оны өзіңізге жіберіңіз

source: CAUTION!
kk_kz: САҚ БОЛЫҢЫЗ!

source: When you select Send Email, your email message is added to the queue for sending, and cannot be cancelled.
kk_kz: Электрондық поштаны жіберуді таңдағанда, сіздің электрондық пошта хабарламаңыз жіберу кезегіне қосылады және оны жою мүмкін емес.

source: Send Email
kk_kz: Электрондық почтаға хабарды жіберу

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
kk_kz: Осы әрекеттер фондық режимде өтеді, және белсенді тапсырмалардың мәртебесі төмендегі кестеде пайда болады. Осы тапсырма үшін жіберілген барлық тапсырмалар үшін мәртебені көру үшін осы бастырманы басыңыз:

source: Email Task History
kk_kz: Жіберілген Хабарлар

source: To see the content of previously sent emails, click this button:
kk_kz: Бұрын жіберілген электрондық пошталардың мазмұнын көру үшін осы батырманы басыңыз:

source: Show Sent Email History
kk_kz: Жіберілген электрондық пошта хабарламаларының тарихын көрсету

source: To read a sent email message, click its subject.
kk_kz: Жіберілген электрондық поштаны оқу үшін оның тақырыбын нұқыңыз

source: To see the status for all email tasks submitted for this course, click this button:
kk_kz: Осы курсқа жіберілген барлық электрондық пошта тапсырмаларының күйін көру үшін мына батырманы басыңыз:

source: Show Email Task History
kk_kz: Жіберілген Хабарларды көрсету

source: Set Course Mode Price
kk_kz: Курс Режимінің Бағасын Белгілеңіз

source: Please enter Course Mode detail below
kk_kz: Төменде курс режимі туралы толық ақпаратты енгізіңіз

source: Set Price
kk_kz: Белгіленген Баға

source: Allowance Section
kk_kz: Үстемеақылар бөлімі

source: Student Special Exam Attempts
kk_kz: Студенттер үшін арнайы емтихан әрекеттері

source: View gradebook for enrolled learners
kk_kz: Қабылданған оқушылар үшін сынақ кітапшасын қарау

source: Note: This feature is available only to courses with a small number of enrolled learners.
kk_kz: Ескерту. Бұл функция студенттер саны аз курстарда ғана қол жетімді.

source: View Gradebook
kk_kz: Просмотр оценок

source: View a specific learner's enrollment status
kk_kz: Белгілі бір оқушының қабылдау мәртебесін қарау

source: Learner's {platform_name} email address or username *
kk_kz: {platform_name} Электрондық пошта мекенжайы немесе оқушының пайдаланушы аты *

source: Learner email address or username
kk_kz: Электрондық пошта мекенжайы немесе оқушының пайдаланушы аты

source: View Enrollment Status
kk_kz: Тіркеу Күйін Қарау

source: View a specific learner's grades and progress
kk_kz: Белгілі бір оқушының бағалары мен үлгерімін қарау

source: Learner's {platform_name} email address or username
kk_kz: {platform_name} оқушының Электрондық пошта мекенжайы немесе пайдаланушы аты

source: View Progress Page
kk_kz: Прогресс Бетін Қарау

source: Adjust a learner's grade for a specific problem
kk_kz: Белгілі бір проблема үшін оқушының бағасын реттеңіз

source: Location of problem in course
kk_kz: Мәселенің курста орналасуы

source: Example
kk_kz: Мысал

source: Problem location
kk_kz: Мәселенің орналасуы

source: Attempts
kk_kz: Әрекеттер

source: Allow a learner who has used up all attempts to work on the problem again.
kk_kz: Рұқсат етіңіз оқушыға, ол пайдаланылған барлық әрекеттері, қайтадан ойластыру проблема.

source: Reset Attempts to Zero
kk_kz: Нөлге дейін қалпына келтіру әрекеттері

source: Rescore
kk_kz: Қайта бағалау

source: For the specified problem, rescore the learner's responses. The 'Rescore Only If Score Improves' option updates the learner's score only if it improves in the learner's favor.
kk_kz: Көрсетілген мәселе үшін оқушының жауаптарын қайталаңыз. "Нәтижелер жақсарған жағдайда ғана қайта бағалау" опциясы оқушының бағасын оқушының пайдасына жақсарған жағдайда ғана жаңартады.

source: Score Override
kk_kz: Ұпайларды қайта анықтау

source: For the specified problem, override the learner's score.
kk_kz: Көрсетілген мәселе үшін оқушының бағасын қайта анықтаңыз.

source: New score for problem, out of the total points available for the problem
kk_kz: Мәселе үшін жаңа балл, проблема үшін қол жетімді ұпайлардың жалпы санынан

source: Override Learner's Score
kk_kz: Оқушының бағасын қайта анықтау

source: Problem History
kk_kz: Мәселелер тарихы

source: Task Status
kk_kz: Тапсырманың жай-күйі

source: Show the status for the rescoring tasks that you submitted for this learner and problem.
kk_kz: Осы оқушыға жіберген қайталанатын тапсырмалардың мәртебесін және проблемаларын көрсетіңіз.

source: Show Task Status
kk_kz: Тапсырма Күйін Көрсету

source: Adjust a learner's entrance exam results
kk_kz: Оқушының түсу емтихандарының нәтижелерін түзету

source: Allow the learner to take the exam again.
kk_kz: Оқушыға емтиханды қайтадан тапсыруға рұқсат етіңіз

source: Allow Skip
kk_kz: Пропуск вступительного испытания

source: Waive the requirement for the learner to take the exam.
kk_kz: Студенттің емтихан тапсыруын талап етуден бас тартыңыз.

source: Let Learner Skip Entrance Exam
kk_kz: Оқушыға Қабылдау Емтиханын Өткізіп Жіберіңіз

source: Rescore any responses that have been submitted. The 'Rescore All Problems Only If Score Improves' option updates the learner's scores only if it improves in the learner's favor.
kk_kz: Барлық жіберілген жауаптарды қайталаңыз. "Барлық мәселелерді бағалау жақсарған жағдайда ғана шешу" опциясы оқушының ұпайларын оқушының пайдасына жақсарған жағдайда ғана жаңартады.

source: Rescore All Problems
kk_kz: Барлық Мәселелерді Қалпына Келтіріңіз

source: Rescore All Problems Only If Score Improves
kk_kz: Бағалау Жақсарған Жағдайда Ғана Барлық Мәселелерді Шешіңіз

source: Entrance Exam History
kk_kz: Түсу емтихандарының тарихы

source: For the entire entrance exam, permanently and completely delete the learner's answers and scores from the database.
kk_kz: Барлық қабылдау емтихандары үшін мәліметтер базасынан оқушылардың жауаптары мен бағаларын біржола және толығымен алып тастаңыз.

source: Show the status for the rescoring tasks that you submitted for this learner and entrance exam.
kk_kz: Осы оқушыға және қабылдау емтиханына жіберген қайталанатын тапсырмалардың мәртебесін көрсетіңіз.

source: Adjust all enrolled learners' grades for a specific problem
kk_kz: Барлық қабылданған оқушылардың бағаларын нақты мәселеге сәйкес реттеңіз

source: Allows all learners to work on the problem again.
kk_kz: Барлық оқушыларға тағы да проблема бойынша жұмыс істеуге мүмкіндік береді.

source: Rescore submitted responses. The 'Rescore Only If Scores Improve' option updates a learner's score only if it improves in the learner's favor.
kk_kz: Rescore жауаптарды ұсынды. "Нәтижелер жақсарған жағдайда ғана қайта бағалау" опциясы оқушының бағасын оқушының пайдасына жақсарған жағдайда ғана жаңартады.

source: Rescore All Learners' Submissions
kk_kz: Оқушылар Ұсынған Барлық Материалдарды Тексеруді Қайталаңыз

source: Rescore Only If Scores Improve
kk_kz: Нәтижелер Жақсарған Жағдайда Ғана Бағалауды Қайталаңыз

source: Show the status for the tasks that you submitted for this problem.
kk_kz: Осы мәселені шешу үшін жіберген тапсырмалардың күйін көрсетіңіз.

source: My Courses
kk_kz: Менің курстарым

source: Program Details
kk_kz: Бағдарлама толығырақ

source: Send me a text with the link
kk_kz: Маған шот-фактураның көшірмесін жіберіңіз

source: Change Preferred Language
kk_kz: Тіл артықшылықтарын өзгерту

source: Please choose your preferred language
kk_kz: Тіл артықшылықтарын баптаңыз

source: Save Language Settings
kk_kz: Тіл артықшылықтарын сақтау

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
kk_kz: Сізге қажетті тілді таба алмадыңыз ба? {link_start} Аудармашы-еріктілер болыңыз!{link_end}
