Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Explore Courses
kk_kz: Курстарды зерттеу

source: Global
kk_kz: Ғаламдық

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The course team needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
kk_kz: {p_tag}қазіргі уақытта сізде тең-теңімен бағалау жоқ. Құрдастарының бағалауы үшін: {ul_tag} {li_tag}сізге тең-теңімен бағалау мәселесіне жауап жіберу керек.{end_li_tag} {li_tag}курс тобы бағалау критерийлерін жақсы түсінуге көмектесетін эсселерді бағалауы керек .{end_li_tag} {li_tag}бағалауды күтетін материалдар болуы керек.{end_li_tag} {end_ul_tag} {end_p_tag}

source: Peer Grading
kk_kz: Басқа студенттердің бағалауы

source: Here is a list of problems that need to be peer graded for this course.
kk_kz: Міне, осы курс үшін бағалануы керек мәселелердің тізімі

source: Problem Name
kk_kz: Міндеттің атауы

source: Due date
kk_kz: Мерзімі

source: Graded
kk_kz: Оценено

source: Available
kk_kz: Қолжетімді

source: Required
kk_kz: Талап етіледі

source: No due date
kk_kz: Мерзімінде емес

source: The due date has passed, and peer grading for this problem is closed at this time.
kk_kz: Мерзімі өтті. Осы міндет үшін пайдаланушылардың бағалауы қазіргі уақытта жабық.

source: The due date has passed, and peer grading is closed at this time.
kk_kz: Мерзімі өтті және пайдаланушылардың бағалауы қазіргі уақытта жабық.

source: Learning to Grade
kk_kz: Бағалауға оқыту

source: Hide Question
kk_kz: Сұрақты жасыру

source: Student Response
kk_kz: Студенттің жауабы

source: Written Feedback
kk_kz: Жазба пікір

source: Please include some written feedback as well.
kk_kz: Қандай да бір жазбаша пікірді қосыңыз

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
kk_kz: Предложенный материал содержит что-то излишне откровенное, оскорбительное или (как у меня есть основания полагать) плагиат.

source: How did I do?
kk_kz: Мен қалай орындадым?

source: Ready to grade!
kk_kz: Бағалауға дайынмын!

source: You have finished learning to grade, which means that you are now ready to start grading.
kk_kz: Бағалау жүйесімен танысу аяқталды. Енді сіз оларды қою үшін дайынсыз.

source: Start Grading!
kk_kz: Бағалауды бастау!

source: Learning to grade
kk_kz: Обучение оцениванию

source: You have not yet finished learning to grade this problem.
kk_kz: Сіз осы міндетті бағалауды оқуды әлі аяқамадыңыз

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
kk_kz: Енді Сізге оқытушылармен бағаланған эссенің сериясы көрсетілетін болады, және Сізді өздігінен баллдарды қоюды сұрайды

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
kk_kz: Сіз оқытушы сияқты баллдарды қоя алғаннан кейін, Сіз өз оқушыларыңызды бағалауға дайын боласыз.

source: Start learning to grade
kk_kz: Бағалауға оқытуды бастау

source: Are you sure that you want to flag this submission?
kk_kz: Сіз осы материалды белгілегіңіз келетініне сенімдісіз бе?

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
kk_kz: Сіз жіберілген құжатты белгілейін деп жатырсыз. Сіз ашық, қорлаушы немесе плагиат (шамамен) қамтылатын жіберілген деректерді ғана белгілеуіңіз тиіс. Егер жіберілген деректер мәселеге сәйкес болмаса немесе дұрыс емес болса, сіз оларды нөл баллмен бағалауыңыз және белгілеудің орнына пікірмен ілестіруіңіз қажет.

source: Remove Flag
kk_kz: Белгіні алып тастау

source: Keep Flag
kk_kz: Белгіні қалдыру

source: Go Back
kk_kz: Қайту

source: {start_strong}{application_name}{end_strong} would like to access your data with the following permissions:
kk_kz: {start_strong}{application_name}{end_strong} запрашивает доступ к вашим данным с правом на следующие операции:

source: Read your user ID
kk_kz: Просмотр вашего идентификатора

source: Read your user profile
kk_kz: Просмотр данных вашего профиля

source: Read your email address
kk_kz: Просмотр вашего электронного адреса

source: Read the list of courses in which you are a staff member.
kk_kz: Просмотр списка курсов, сотрудником которых вы являетесь.

source: Read the list of courses in which you are an instructor.
kk_kz: Просмотр списка курсов, которые вы преподаёте.

source: To see if you are a global staff user
kk_kz: Просмотр статуса сотрудника платформы

source: Manage your data: {permission}
kk_kz: Управление вашими данными: {permission}

source: Account Activation Info
kk_kz: Есептік жазбаны іске қосу туралы ақпарат

source: Your Password Reset is Complete
kk_kz: Сіздің пароліңіз өзгертілген болатын

source: Password Reset Complete
kk_kz: Құпиясөзді Қалпына Келтіру Аяқталды

source: Your password has been reset. {start_link}Sign-in to your account.{end_link}
kk_kz: Сіздің пароль қалпына келтірілді. {start_link}есептік жазбаңызға кіріңіз.{end_link}

source: Reset Your {platform_name} Password
kk_kz: Құпия сөзді қалпына келтіріңіз {platform_name}

source: Invalid Password Reset Link
kk_kz: Құпия Сөзді Қалпына Келтіру Сілтемесі

source: Password reset successful
kk_kz: Пароль ойдағыдай ысырылды

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
kk_kz: Біз e-mail нұсқаулықтарды жібердік, Сіз көрсеткен e-mail мекенжайына парольді қалай орнату керек. Сіз оларды жақын арада аласыз.

source: Billing Details
kk_kz: Детали выписки счёта

source: You can proceed to payment at any point in time. Any additional information you provide will be included in your receipt.
kk_kz: Вы можете перейти к оформлению платежа в любой момент. Предоставляемая вами дополнительная информация будет включена в чек.

source: Purchasing Organizational Details
kk_kz: Покупка организационных деталей

source: Purchasing organization
kk_kz: Закупочная организация

source: Purchase order number (if any)
kk_kz: Номер заказа (если таковые имеются)

source: Additional Receipt Recipient
kk_kz: Дополнительный получатель чека

source: If no additional billing details are populated the payment confirmation will be sent to the user making the purchase.
kk_kz: Если никакие дополнительные платёжные реквизиты не заполнены, подтверждение оплаты будет отправлено пользователю, совершившему платёж.

source: Payment processing occurs on a separate secure site.
kk_kz: Обработка платежей происходит на отдельном защищённом сайте.

source: Your Shopping cart is currently empty.
kk_kz: Ваша корзина пуста.

source: Payment
kk_kz: Платеж

source: Download CSV Reports
kk_kz: Скачать отчёты в формате CSV

source: Download CSV Data
kk_kz: Скачать данные в формате CSV

source: There was an error in your date input. It should be formatted as YYYY-MM-DD
kk_kz: Ошибка при вводе даты. Дата должна быть указана в формате ГГГГ-ММ-ДД

source: These reports are delimited by start and end dates.
kk_kz: Отчёты формируются в рамках заданных дат начала и окончания.

source: Start Date:
kk_kz: Дата начала:

source: End Date:
kk_kz: Дата окончания:

source: These reports are delimited alphabetically by university name. i.e., generating a report with 'Start Letter' A and 'End Letter' C will generate reports for all universities starting with A, B, and C.
kk_kz: Отчёты формируются по названиям университетов в алфавитном порядке, т. е. создание отчёта «с буквы A» и «до буквы C» сформирует отчёты для всех организаций, начинающихся с A, B и C.

source: Start Letter:
kk_kz: С буквы:

source: End Letter:
kk_kz: До буквы:

source: Payment Error
kk_kz: Ошибка при оплате

source: There was an error processing your order!
kk_kz: Произошла ошибка при обработке вашего заказа!

source: Thank you for your purchase!
kk_kz: Спасибо за покупку!

source: View Dashboard
kk_kz: Посмотреть панель управления

source: You have successfully been enrolled for {course_names}. The following receipt has been emailed to {receipient_emails}
kk_kz: Вы были успешно зачислены на {course_names}. Квитанция была отправлена {receipient_emails}

source: You have successfully purchased <b>{number} course registration code</b> for {course_names}.
kk_kz: Вы успешно приобрели <b>{number} код регистрации</b> для курсов {course_names}.

source: The following receipt has been emailed to {receipient_emails}
kk_kz: Следующая квитанция отправлена на адрес {receipient_emails}

source: Please send each professional one of these unique registration codes to enroll into the course. The confirmation/receipt email you will receive has an example email template with directions for the individuals enrolling.
kk_kz: Пожалуйста, перешлите каждому специалисту один из этих уникальных кодов регистрации для записи на курс. Письмо с подтверждением/квитанцией, которое вы получите, содержит шаблона электронного письма с указаниями по индивидуальной записи на курс.

source: Enrollment Link
kk_kz: Ссылка регистрации

source: Used
kk_kz: Пайдаланылған

source: Invalid
kk_kz: Недействительно

source: Date of purchase
kk_kz: Дата покупки

source: Print Receipt
kk_kz: Распечатать квитанцию

source: Billed To Details
kk_kz: Детали выписки счёта

source: Purchase Order Number
kk_kz: Номер заказа на покупку:

source: Company Contact Name
kk_kz: Имя контактного лица в организации:

source: Company Contact Email
kk_kz: Электронный адрес компании

source: Recipient Name
kk_kz: Имя получателя

source: Recipient Email
kk_kz: Электронный адрес получателя

source: Card Type
kk_kz: Тип карты

source: Credit Card Number
kk_kz: Номер кредитной карты

source: Address 1
kk_kz: Адрес 1

source: Address 2
kk_kz: Адрес 2

source: State
kk_kz: Жай-күйі

source: Registration for:
kk_kz: Регистрация для:

source: Price per student:
kk_kz: Цена для слушателя:

source: Discount Applied:
kk_kz: Скидка применяется:

source: Students
kk_kz: Слушатели

source: Note: items with strikethough like <del>this</del> have been refunded.
kk_kz: Примечание: зачёркнутые наименования, как <del>это</del>, были возвращены.

source: Confirm Enrollment
kk_kz: Подтвердить регистрацию

source: {site_name} - Confirm Enrollment
kk_kz: {site_name} – подтверждение записи на курс

source: {course_number} {course_title} Cover Image
kk_kz: {course_number} {course_title} Изображение для титульного листа

source: Confirm your enrollment for: {span_start}course dates{span_end}
kk_kz: Подтвердить регистрацию на: {span_start}course dates{span_end}

source: You've clicked a link for an enrollment code that has already been used. Check your {link_start}course dashboard{link_end} to see if you're enrolled in the course, or contact your company's administrator.
kk_kz: Вы перешли по ссылке уже использованного кода для зачисления на курс. Посмотрите на своей {link_start}панели управления{link_end}, записаны ли вы на данный курс, или свяжитесь с администратором вашего предприятия.

source: You have successfully enrolled in {course_name}. This course has now been added to your dashboard.
kk_kz: Вы успешно зарегистрировались на курс {course_name}. Курс был добавлен на вашу панель управления.

source: You're already enrolled for this course. Visit your {link_start}dashboard{link_end} to see the course.
kk_kz: Вы уже записаны на этот курс. Чтобы просмотреть список своих курсов, перейдите к {link_start}панели управления{link_end}.

source: The course you are enrolling for is full.
kk_kz: Курс, на который вы пытаетесь записаться, переполнен.

source: The course you are enrolling for is closed.
kk_kz: Курс, на который вы пытаетесь записаться, уже окончен.

source: There was an error processing your redeem code.
kk_kz: При обработке вашего кода активации возникла ошибка.

source: You're about to activate an enrollment code for {course_name} by {site_name}. This code can only be used one time, so you should only activate this code if you're its intended recipient.
kk_kz: Вы собираетесь активировать код регистрации на курс {course_name} на сайте {site_name}. Этот код может быть использован только один раз, так что вы должны активировать его только в том случае, если вы – предполагаемый получатель.

source: Activate Course Enrollment
kk_kz: Активировать запись на курс

source: {course_names} has been removed because the enrollment period has closed.
kk_kz: Курс {course_names} удалён из корзины, поскольку на него закрылась запись.

source: Cover Image
kk_kz: Изображение курса

source: Students:
kk_kz: Слушатели:

source: Input quantity and press enter.
kk_kz: Задайте количество и нажмите клавишу «Ввод».

source: Increase
kk_kz: Увеличить

source: Decrease
kk_kz: Уменьшить

source: Remove
kk_kz: Удалить

source: Discount or activation code
kk_kz: Скидочный или активационный код

source: discount or activation code
kk_kz: скидочный или активационный код

source: Apply
kk_kz: Применить

source: code has been applied
kk_kz: Код применён

source: TOTAL:
kk_kz: ВСЕГО:

source: After this purchase is complete, a receipt is generated with relative billing details and registration codes for students.
kk_kz: После завершения покупки будет сгенерирована квитанция с данными о произведённом платеже и регистрационными кодами для слушателей.

source: After this purchase is complete, {username} will be enrolled in this course.
kk_kz: После подтверждения оплаты {username} будет зачислен на этот курс.

source: Empty Cart
kk_kz: Корзина пуста

source: Shopping cart
kk_kz: Корзина

source: {platform_name} - Shopping Cart
kk_kz: {platform_name} – Корзина

source: Confirmation
kk_kz: Подтверждение

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} or let us know about any pages that may have been moved at {email}.
kk_kz: Страница, которую вы искали, не найдена. Вернитесь к {link_start}главной странице{link_end} или сообщите нам о страницах, которые могли быть перемещены, по адресу {email}.

source: This page left intentionally blank. Feel free to add your own content.
kk_kz: Бұл бет әдейі бос қалады. Өз мазмұныңызды қосудан тартынбаңыз.

source: Our system indicates that you are trying to access this {platform_name} course from a country or region currently subject to U.S. economic and trade sanctions.Unfortunately, because {platform_name} is required to comply with export controls,we cannot allow you to access this course at this time.
kk_kz: Наша система показывает, что вы пытаетесь получить доступ к данному курсу {platform_name} из страны или региона, который в настоящее время подпадает под экономические и торговые санкции США. К сожалению, {platform_name} необходимо соблюдать требования экспортного контроля, и мы не можем предоставить вам доступ к этому курсу в данный момент.

source: FAQ
kk_kz: Сұрақ – жауап

source: Jobs
kk_kz: Бос орындар

source: In the Press
kk_kz: Баспасөз басылымы

source: Currently the {platform_name} servers are down
kk_kz: Қазіргі уақытта {platform_name} серверлері қолжетімсіз

source: Our staff is currently working to get the site back up as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
kk_kz: Наши сотрудники постараются восстановить доступ к сайту как можно скорее. Пожалуйста, отправьте нам сообщение на адрес {tech_support_email}, чтобы сообщить о возникших проблемах или неполадках.

source: There has been a 500 error on the {platform_name} servers
kk_kz: {platform_name} серверлеріндегі 500 қателік

source: Please wait a few seconds and then reload the page. If the problem persists, please email us at {email}.
kk_kz: Подождите несколько секунд, а затем перезагрузите страницу. Если проблема повторяется, пожалуйста, свяжитесь с нами по адресу {email}.

source: Currently the {platform_name} servers are overloaded
kk_kz: Қазіргі уақытта {platform_name} серверлердің жүктемесі шамадан көп

source: Account Settings
kk_kz: Аккаунт параметрлері

source: Please Wait
kk_kz: күте тұрыңыз

source: Sign in or Register
kk_kz: Жүйеге кіріңіз немесе тіркеліңіз

source: Student Support
kk_kz: Студенттерді Қолдау

source: Student Support: Certificates
kk_kz: Студенттерді қолдау: сертификаттар

source: Contact {platform_name} Support
kk_kz: Қолдау қызметіне хабарласыңыз {platform_name}

source: Student Support: Enrollment
kk_kz: Студенттерді қолдау: оқуға қабылдау

source: Student Support: Feature Based Enrollments
kk_kz: Студенттерді Қолдау: Функцияларға Негізделген Қабылдау

source: Is Enabled
kk_kz: Қосулы

source: No results found
kk_kz: Нәтижелер табылған жоқ

source: Student Support: Manage User
kk_kz: Студенттерді қолдау: Пайдаланушыларды басқару

source: About to refund this order:
kk_kz: Чтобы вернуть этот заказ:

source: Order Id:
kk_kz: Номер заказа:

source: Enrollment:
kk_kz: Зачисление:

source: enrolled
kk_kz: Тіркелген

source: unenrolled
kk_kz: отчислено

source: Cost:
kk_kz: Стоимость:

source: CertificateItem Status:
kk_kz: Статус сертификата:

source: Order Status:
kk_kz: Статус заказа:

source: Fulfilled Time:
kk_kz: Время выполнения:

source: Refund Request Time:
kk_kz: Время запроса о возврате средств:

source: User Survey
kk_kz: Пайдаланушы сауалнамасы

source: Pre-Course Survey
kk_kz: Курс алды зерттеу

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
kk_kz: Сіз курсты келесі форманы толтырғаннан кейін бастай аласыз. Міндетті өрістер Жұлдызшамен белгіленген (*). Бұл ақпарат тек {platform_name} пайдалануға арналған. Бұл сіздің қоғамдық профиліңізге ешқандай қатысы жоқ.

source: You are missing the following required fields:
kk_kz: Сізге келесі қажетті өрістер жетіспейді:

source: Cancel and Return to Dashboard
kk_kz: Болдырмау және бақылау тақтасына қайтару

source: Why do I need to complete this information?
kk_kz: Неліктен мен бұл ақпаратты толтыруым керек?

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
kk_kz: Біз қазіргі және болашақ студенттер үшін курсты жақсарту үшін Сіз берген ақпаратты пайдаланамыз. Сіздің нақты қажеттіліктеріңіз туралы неғұрлым көп білетін болсақ, біз сіздің курсыңызды ұмытылмас ете аламыз.

source: Who can I contact if I have questions?
kk_kz: Егер менде сұрақтар туындаса, мен кімге жүгіне аламын?

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
kk_kz: Егер сізде осы курс немесе осы форма туралы сұрақтарыңыз болса, сіз {link_start}{mail_to_link}{link_end} арқылы байланыса аласыз.

source: Skeleton Page
kk_kz: Қаңқа Беті

source: Search the course
kk_kz: Курс бойынша іздеу

source: Start Course
kk_kz: Курсты бастау

source: Have questions?
kk_kz: Мәселелер бар ма?

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
kk_kz: {a_end} біздің сертификаттар туралы кәдімгі мәселелерді қарау үшін біздің FAQ {a_start} оқыңыз.

source: Re-Verify for {course_name}
kk_kz: {course_name} үшін тексеруді қайталаңыз

source: Verification Deadline Has Passed
kk_kz: Тексерудің Соңғы Мерзімі Аяқталды

source: Upgrade Deadline Has Passed
kk_kz: Жаңарту Мерзімі Өтті

source: The verification deadline for {course_name} was {{date}}. Verification is no longer available.
kk_kz: {course_name} үшін тексерудің соңғы мерзімі {{date}} болды. Тексеру енді қол жетімді емес.

source: The deadline to upgrade to a verified certificate for this course has passed.
kk_kz: Осы курстың расталған сертификатын алу мерзімі аяқталды.

source: Upgrade Your Enrollment For {course_name}.
kk_kz: Тіркеуді {course_name} бойынша жаңартыңыз.

source: Receipt For {course_name}
kk_kz: Квитанция об оплате за {course_name}

source: Verify For {course_name}
kk_kz: {course_name} болуын тексеріңіз

source: Enroll In {course_name}
kk_kz: {course_name} жазылыңыз

source: Technical Requirements
kk_kz: Қажетті техникалық құралдар

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}webcam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
kk_kz: Шолғыштың {strong_start}{a_start}ең соңғы мүмкін нұсқасына жаңартылғанына көз жеткізіңіз{a_end}{strong_end}. Сонымен қатар, сіздің веб-камераңыздың {strong_start}қосылғанына, қосылғанына және веб-шолғышта жұмыс істей алатындығына көз жеткізіңіз (әдетте шолғыш параметрлерінде реттеледі).{strong_end}

source: Re-Verification
kk_kz: үшін қайта анықтау

source: Identity Verification
kk_kz: Жеке басын тексеру

source: You have already submitted your verification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
kk_kz: Вы уже отправили свои личные данные для подтверждения. По завершении проверки появится соответствующее сообщение на вашей панели управления (обычно это занимает 1-2 дня).

source: You cannot verify your identity at this time.
kk_kz: Қазіргі уақытта сіз өзіңіздің жеке басыңызды растай алмайсыз.

source: Return to Your Dashboard
kk_kz: Басқару үстеліне қайту

source: This website uses cookies to ensure you get the best experience on our website. If you continue browsing this site, we understand that you accept the use of cookies.
kk_kz: Бұл веб-сайт Біздің веб-сайтта ең жақсы тәжірибе алу үшін cookie файлдарын пайдаланады. Егер сіз осы сайтты қарауды жалғастырсаңыз, біз сіздің cookie файлдарын пайдаланумен келісетініңізді түсінеміз.

source: Got it!
kk_kz: Түсіндім!

source: Learn more
kk_kz: Үйрету көп

source: Changes
kk_kz: Өзгерістер

source: {span_start}active{span_end}
kk_kz: {span_start}активный{span_end}

source: Course Wiki
kk_kz: Вики курса

source: Add article
kk_kz: Бапты қосу

source: Preview Language Setting
kk_kz: Таңдалған тілді алдын-ала қарау

source: Language Code
kk_kz: Тіл коды

source: e.g. en for English
kk_kz: мысалы, en ағылшын тіліне арналған

source: Preview Theme
kk_kz: Алдын ала қарау тақырыбы

source: All Rights Reserved
kk_kz: Барлық құқықтары қорғалған

source: Attribution
kk_kz: Атрибуция

source: Noncommercial
kk_kz: Коммерциялық емес

source: No Derivatives
kk_kz: Туынды қаржы құралдары жоқ

source: Share Alike
kk_kz: Үлесі бірдей

source: Creative Commons licensed content, with terms as follow:
kk_kz: Creative Commons лицензиялық мазмұны келесі шарттарда:

source: Some Rights Reserved
kk_kz: Кейбір құқықтар қорғалған

source: Important Course Dates
kk_kz: Важные даты курса

source: Goal:
kk_kz: Мақсаты:

source: Edit your course goal:
kk_kz: Курстың мақсатын өзгертіңіз

source: Upgrade ({price})
kk_kz: ({price}) Жаңарту

source: Expand All
kk_kz: Барлығын үлкейту

source: Prerequisite:
kk_kz: Бөлме:

source: {subsection_format} due {{date}}
kk_kz: {subsection_format} дейін {{date}}

source: Learn About Verified Certificates
kk_kz: Тексерілген Сертификаттар Туралы Біліңіз

source: {platform_name} Verified Certificate
kk_kz: {platform_name} Расталған Сертификат

source: Why upgrade?
kk_kz: Неге жаңарту керек?

source: Official proof of completion
kk_kz: Аяқталғанын ресми растау

source: Easily shareable certificate
kk_kz: Оңай таратылатын сертификат

source: Proven motivator to complete the course
kk_kz: Курсты өту үшін дәлелденген мотиватор
