Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: If set, the sequence content is hidden for non-staff users after the due date has passed.
kk_kz: Егер берілген болса, контент реттілігі белгіленген мерзім аяқталғаннан кейін қызметкер емес пайдаланушылар үшін жасырылады.

source: Is Entrance Exam
kk_kz: Бұл Қабылдау Емтиханы

source: Tag this course module as an Entrance Exam. Note, you must enable Entrance Exams for this course setting to take effect.
kk_kz: Курстың осы модулін қабылдау емтиханы ретінде белгілеңіз. Курстың осы параметрінің күшіне енуі үшін қабылдау емтихандарын қосу керек екенін ескеріңіз.

source: Is Time Limited
kk_kz: Уақыт Шектеулі Ме

source: This setting indicates whether students have a limited time to view or interact with this courseware component.
kk_kz: Бұл параметр студенттердің оқу құралының осы компонентімен танысуға немесе өзара әрекеттесуге шектеулі уақыты бар-жоғын көрсетеді.

source: Time Limit in Minutes
kk_kz: минутпен уақыт шектеу

source: The number of minutes available to students for viewing or interacting with this courseware component.
kk_kz: Оқушыларға оқу құралының осы компонентімен танысуға немесе өзара әрекеттесуге болатын минуттар саны.

source: Is Proctoring Enabled
kk_kz: Прокторинг Қосылған Ба

source: This setting indicates whether this exam is a proctored exam.
kk_kz: Бұл параметр берілген емтиханның кейінге қалдырылған емтихан екенін көрсетеді.

source: Software Secure Review Rules
kk_kz: Бағдарламалық жасақтаманы қауіпсіз қарау ережелері

source: This setting indicates what rules the proctoring team should follow when viewing the videos.
kk_kz: Бұл параметр бейнені қарау кезінде прокторинг командасы қандай ережелерді сақтау керектігін көрсетеді.

source: Is Practice Exam
kk_kz: Практикалық Емтихан ба

source: This setting indicates whether this exam is for testing purposes only. Practice exams are not verified.
kk_kz: Бұл параметр берілген емтихан тек тестілеу мақсатына арналғанын көрсетеді. Практикалық емтихандар тексерілмейді.

source: This subsection is unlocked for learners when they meet the prerequisite requirements.
kk_kz: Бұл бөлім студенттерге қажетті талаптарға сай болған кезде ашылады.

source: This exam is hidden from the learner.
kk_kz: Бұл емтихан оқушыдан жасырылған.

source: Because the course has ended, this assignment is hidden from the learner.
kk_kz: Курс аяқталғаннан кейін бұл тапсырма оқушыдан жасырылады.

source: Because the due date has passed, this assignment is hidden from the learner.
kk_kz: Орындалу мерзімі өткен соң, бұл тапсырма оқушыдан жасырылады.

source: This section is a prerequisite. You must complete this section in order to unlock additional content.
kk_kz: Бұл бөлім міндетті шарт болып табылады. Қосымша мазмұнды ашу үшін сіз осы бөлімді толтыруыңыз керек.

source: A list summarizing what students should look forward to in this section.
kk_kz: Бұл бөлімде студенттер не күтуі керек екенін қорытындылайтын тізім.

source: Group ID {group_id}
kk_kz: Топ идентификаторы {group_id}

source: Not Selected
kk_kz: Таңдалған жоқ

source: The display name for this component. (Not shown to learners)
kk_kz: Осы компонент үшін көрсетілетін атау. (Оқушыларға көрсетілмейді)

source: Content Experiment
kk_kz: Контентпен тәжірибе

source: The list of group configurations for partitioning students in content experiments.
kk_kz: Мазмұнды эксперименттерде оқушыларды бөлуге арналған топтық конфигурациялардың тізімі.

source: The configuration defines how users are grouped for this content experiment. Caution: Changing the group configuration of a student-visible experiment will impact the experiment data.
kk_kz: Конфигурация пайдаланушылардың осы мазмұнды эксперимент үшін қалай топтастырылғанын анықтайды. Назар аударыңыз: оқушыларға көрінетін эксперименттің топтық конфигурациясын өзгерту эксперимент деректеріне әсер етеді.

source: Group Configuration
kk_kz: Топ конфигурациясы

source: Which child module students in a particular group_id should see
kk_kz: Белгілі бір топтағы оқушылар қандай балалар модульдерін көруі керек

source: The experiment is not associated with a group configuration.
kk_kz: Эксперимент топтың конфигурациясымен байланысты емес.

source: Select a Group Configuration
kk_kz: Топ конфигурациясын таңдаңыз

source: The experiment uses a deleted group configuration. Select a valid group configuration or delete this experiment.
kk_kz: Экспериментте қашықтағы топтың конфигурациясы қолданылады. Жарамды топ конфигурациясын таңдаңыз немесе осы тәжірибені жойыңыз.

source: The experiment uses a group configuration that is not supported for experiments. Select a valid group configuration or delete this experiment.
kk_kz: Эксперимент эксперимент үшін Қолдау көрсетілмейтін топтық конфигурацияны қолданады. Жарамды топ конфигурациясын таңдаңыз немесе осы тәжірибені жойыңыз.

source: The experiment does not contain all of the groups in the configuration.
kk_kz: Экспериментте конфигурациядағы барлық топтар жоқ.

source: Add Missing Groups
kk_kz: Жоқ Топтарды Қосу

source: The experiment has an inactive group. Move content into active groups, then delete the inactive group.
kk_kz: Экспериментте белсенді емес топ бар. Мазмұнды белсенді топтарға жылжытыңыз, содан кейін белсенді емес топты жойыңыз.

source: This content experiment has issues that affect content visibility.
kk_kz: Бұл мазмұн экспериментінде мазмұнның көрінуіне әсер ететін мәселелер бар.

source: External Discussion
kk_kz: Сыртқы Талқылау

source: Home
kk_kz: Негізгі бет

source: Course
kk_kz: Курс

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
kk_kz: Youtube сервисінен {youtube_id} үшін субтитрлер алу мүмкін емес. {status_code}.

source: We support only SubRip (*.srt) transcripts format.
kk_kz: SubRip (*.srt) субтитрлерінің форматы ғана қолдау табады.

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
kk_kz: SubRip субтитрлерін іске қосу кезінде әлдене дұрыс болмады. Ішкі хабар{error_message}

source: Something wrong with SubRip transcripts file during parsing.
kk_kz: SubRip субтитрлерін іске қосу кезінде әлдене дұрыс болмады.

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
kk_kz: {exception_message}: Жүктелген стенограммаларды табу мүмкін болмады: {user_filename}

source: Language is required.
kk_kz: Тілді білу қажет.

source: Basic
kk_kz: Базалық

source: There is no transcript file associated with the {lang} language.
kk_kz: Нет субтитров для языка {lang}.

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
kk_kz: Сіздің бейне жазбаңыздың URL-ы. Бұл YouTube URL-ы немесе Интернетте басқа жерде орналасқан .mp4, .ogg, әлде .webm бейне файлына сілтеме болуы мүмкін.

source: Default Video URL
kk_kz: Әдепкі бейне URL

source: Component Display Name
kk_kz: Көрсетілетін компонент атауы

source: Current position in the video.
kk_kz: Бейнедегі ағымдағы позиция.

source: Optional, for older browsers: the YouTube ID for the normal speed video.
kk_kz: Ескі браузерлер үшін міндетті емес: қалыпты жылдамдықтағы бейнелер үшін YouTube идентификаторы.

source: YouTube ID
kk_kz: YouTube идентификаторы

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
kk_kz: Ескі браузерлер үшін міндетті емес: жылдамдығы бар бейнелер үшін YouTube идентификаторы .75x.

source: YouTube ID for .75x speed
kk_kz: Идентификатор YouTube для скорости 0.75x.

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
kk_kz: Қосымша, ескі браузерлер үшін: 1,25 x бейне үшін YouTube идентификаторы.

source: YouTube ID for 1.25x speed
kk_kz: Идентификатор YouTube для скорости 1.25x.

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
kk_kz: Қосымша, ескі браузерлер үшін: 1,5x бейне үшін YouTube идентификаторы.

source: YouTube ID for 1.5x speed
kk_kz: Идентификатор YouTube для скорости 1.5x.

source: Time you want the video to start if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
kk_kz: Егер сіз бүкіл бейнені ойнатқыңыз келмесе, бейнені іске қосқыңыз келетін уақыт. Жеке мобильді қосымшада қолдау көрсетілмейді: толық бейне файл ойнатылады. HH:MM:SS ретінде пішімделеді. Максималды мәні- 23:59:59.

source: Video Start Time
kk_kz: Бейненің басталу уақыты

source: Time you want the video to stop if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
kk_kz: Егер сіз бүкіл бейнені ойнатқыңыз келмесе, бейненің тоқтауын қалайтын уақыт. Жеке мобильді қосымшада қолдау көрсетілмейді: толық бейне файл ойнатылады. HH:MM:SS ретінде пішімделеді. Максималды мәні-23: 59: 59.

source: Video Stop Time
kk_kz: Бейне Тоқтату Уақыты

source: The external URL to download the video.
kk_kz: Внешняя ссылка URL для скачивания видео.

source: Download Video
kk_kz: Бейне файлды жүктеу

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
kk_kz: Егер студенттерге edX бейне ойнатқышын қолдана алмаса немесе YouTube-ке кіре алмаса, осы бейненің нұсқаларын әртүрлі форматта жүктеуге рұқсат етіңіз. Бейне файлдардың URL өрісіне кем дегенде бір YouTube емес URL мекенжайын қосу керек.

source: Video Download Allowed
kk_kz: Бейне Жүктеуге Рұқсат Етілген

source: The URL or URLs where you've posted non-YouTube versions of the video. Each URL must end in .mpeg, .mp4, .ogg, or .webm and cannot be a YouTube URL. (For browser compatibility, we strongly recommend .mp4 and .webm format.) Students will be able to view the first listed video that's compatible with the student's computer. To allow students to download these videos, set Video Download Allowed to True.
kk_kz: YouTube-тен басқа бейне нұсқаларын орналастырған URL немесе URL мекен-жайы. Әр URL мекен-жайы аяқталуы керек .mpeg, .mp4, .ogg немесе .webm және YouTube URL мекенжайы бола алмайды. (Браузермен үйлесімділік үшін .mp4 және .webm пішімі.) Оқушылар аталған бейнелердің алғашқысын оқушының компьютерімен үйлесімді көре алады. Оқушыларға бұл бейнелерді жүктеуге мүмкіндік беру үшін "бейнелерді жүктеуге рұқсат етілген" мәнін Рас етіп орнатыңыз.

source: Video File URLs
kk_kz: Бейне файлдардың URL мекенжайлары

source: By default, students can download an .srt or .txt transcript when you set Download Transcript Allowed to True. If you want to provide a downloadable transcript in a different format, we recommend that you upload a handout by using the Upload a Handout field. If this isn't possible, you can post a transcript file on the Files & Uploads page or on the Internet, and then add the URL for the transcript here. Students see a link to download that transcript below the video.
kk_kz: Әдепкі бойынша студенттер транскриптті форматта жүктей алады .srt немесе .txt, егер транскриптті жүктеуге рұқсат етілсе, True мәні орнатылады. Егер сіз жүктелетін транскриптті басқа форматта бергіңіз келсе, қорапты пайдаланып үлестірмелі материалды жүктеуді ұсынамыз. Егер бұл мүмкін болмаса, шифрлау файлын файлдар мен жүктеулер бетінде немесе Интернетте жариялауға болады, содан кейін мұнда шифрлау үшін URL мекенжайын қосуға болады. Студенттер бұл транскриптті бейненің астына жүктеу сілтемесін көреді.

source: Downloadable Transcript URL
kk_kz: Жүктелетін транскрипт URL мекенжайы

source: Allow students to download the timed transcript. A link to download the file appears below the video. By default, the transcript is an .srt or .txt file. If you want to provide the transcript for download in a different format, upload a file by using the Upload Handout field.
kk_kz: Оқушыларға уақытша транскрипт жүктеуге рұқсат етіңіз. Бейне астында файлды жүктеу сілтемесі пайда болады. Әдепкі бойынша, транскрипт-бұл файл .srt немесе .txt. Егер сіз жүктеу үшін транскриптті басқа форматта бергіңіз келсе, "үлестіру материалын жүктеу"өрісін пайдаланып файлды жүктеңіз.

source: Download Transcript Allowed
kk_kz: Транскриптті Жүктеуге Рұқсат Етілген

source: The default transcript for the video, from the Default Timed Transcript field on the Basic tab. This transcript should be in English. You don't have to change this setting.
kk_kz: Негізгі қойындысындағы әдепкі уақыт декодтау өрісіндегі бейнелер үшін әдепкі декодтау. Бұл транскрипт ағылшын тілінде болуы керек. Бұл параметрді өзгерту қажет емес.

source: Default Timed Transcript
kk_kz: Әдепкі уақытша декодтау

source: Specify whether the transcripts appear with the video by default.
kk_kz: Транскрипттердің әдепкі бейнемен бірге көрсетілетінін белгілеңіз.

source: Show Transcript
kk_kz: Транскриптті Көрсету

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
kk_kz: Әр түрлі тілдердегі транскрипттерді қосыңыз. Тілді көрсету үшін төменде басыңыз және декодтау srt. форматындағы транскрипт файлын жүктеңіз.

source: Transcript Languages
kk_kz: Транскрипт тілдері

source: Preferred language for transcript.
kk_kz: Транскрипт үшін таңдаулы тіл.

source: Preferred language for transcript
kk_kz: Транскрипт үшін таңдаулы тіл

source: Transcript file format to download by user.
kk_kz: Пайдаланушының жүктеуі үшін транскрипт файл пішімі.

source: SubRip (.srt) file
kk_kz: Субтитр (.srt) файлы

source: Text (.txt) file
kk_kz: Тексттік (.txt) файл

source: The last speed that the user specified for the video.
kk_kz: Пайдаланушы Бейне үшін көрсеткен соңғы жылдамдық.

source: The default speed for the video.
kk_kz: Бейне үшін әдепкі жылдамдық.

source: Specify whether YouTube is available for the user.
kk_kz: YouTube қолданушыға қол жетімді екенін көрсетіңіз.

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
kk_kz: Бұл бейнені сүйемелдеу үшін таратылымды жүктеңіз. Оқушылар бейненің астындағы "үлестірме материалды Жүктеу" түймесін басу арқылы үлестірме материалды жүктей алады.

source: Upload Handout
kk_kz: Үлестірме Материалды Жүктеу

source: Specify whether access to this video is limited to browsers only, or if it can be accessed from other applications including mobile apps.
kk_kz: Көрсетіңіз, қандай қол жеткізу бұл бейне тек браузерлері немесе оған қол жеткізуге болады басқа да қосымшаларды қоса алғанда, мобильдік қосымшалар.

source: Video Available on Web Only
kk_kz: Бейне тек Интернетте қол жетімді

source: If you were assigned a Video ID by edX for the video to play in this component, enter the ID here. In this case, do not enter values in the Default Video URL, the Video File URLs, and the YouTube ID fields. If you were not assigned a Video ID, enter values in those other fields and ignore this field.
kk_kz: Егер edX сізге осы компоненттегі бейнені ойнату үшін бейне идентификаторын тағайындаса, оны осы жерге енгізіңіз. Бұл жағдайда мәндерді әдепкі бейне URL мекен-жайына, бейне файлдардың URL мекен-жайына және YouTube идентификатор өрістеріне енгізбеңіз. Егер сізге бейне идентификаторы берілмесе, басқа өрістерге мәндерді енгізіп, сол өрісті елемеңіз.

source: Date of the last view of the bumper
kk_kz: Бампердің соңғы қаралған күні

source: Do not show bumper again
kk_kz: Енді бампер көрсетпеңіз

source: Instructions
kk_kz: Нұсқаулықтар

source: Add instructions to help learners understand how to use the word cloud. Clear instructions are important, especially for learners who have accessibility requirements.
kk_kz: Оқушыларға бұлт сөзін қалай қолдану керектігін түсінуге көмектесетін нұсқаулар қосыңыз. Нақты нұсқаулар, әсіресе қол жетімділік талаптары бар Студенттер үшін маңызды.

source: Inputs
kk_kz: Кіру

source: The number of text boxes available for learners to add words and sentences.
kk_kz: Оқушыларға сөздер мен сөйлемдерді қосу үшін қол жетімді мәтін өрістерінің саны.

source: Maximum Words
kk_kz: Сөздердің Максималды Саны

source: The maximum number of words displayed in the generated word cloud.
kk_kz: Жасалған бұлтта көрсетілген сөздердің максималды саны.

source: Show Percents
kk_kz: Пайыздарды Көрсету

source: Statistics are shown for entered words near that word.
kk_kz: Статистика осы сөздің жанына енгізілген сөздер үшін көрсетіледі.

source: Whether this learner has posted words to the cloud.
kk_kz: Бұл оқушы сөздерді бұлтқа жіберді ме

source: Student answer.
kk_kz: Студенттің жауабы.

source: All possible words from all learners.
kk_kz: Барлық оқушылардан барлық мүмкін сөздер.

source: Top num_top_words words for word cloud.
kk_kz: Сөз бұлтына арналған ең жақсы сөздер num_top_words.

source: Email Change
kk_kz: Электрондық поштаны өзгерту

source: We received a request to change the e-mail associated with your %(platform_name)s account from %(old_email)s to %(new_email)s. If this is correct, please confirm your new e-mail address by visiting:
kk_kz: Біз сіздің %(platform_name)sесептік жазбаңызбен байланысты электрондық пошта мекенжайын %(old_email)s%(new_email)sөзгерту туралы сұрау алдық. Егер бұл дұрыс болса, кіру арқылы жаңа электрондық пошта мекенжайын растаңыз:

source: Confirm Email Change
kk_kz: Электрондық Поштаның Өзгеруін Растаңыз

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the %(platform_name)s web site.
kk_kz: Егер сіз бұл туралы сұрамасаңыз, сізге ештеңе жасаудың қажеті жоқ; сіз енді бізден электрондық пошта хабарламаларын ала алмайсыз. Бұл электрондық поштаға жауап бермеңіз; егер сізге көмек қажет болса, %(platform_name)sвеб-сайттағы анықтама бөлімін қараңыз.

source: Request to change %(platform_name)s account e-mail
kk_kz: %(platform_name)s Есептік жазбаның электрондық поштасын өзгерту туралы сұрау

source: Password Reset
kk_kz: Парольді ысыру

source: You're receiving this e-mail because you requested a password reset for your user account at %(platform_name)s.
kk_kz: Сіз бұл электрондық поштаны аласыз, өйткені сіз өзіңіздің пайдаланушы%(platform_name)s есептік жазбаңызға парольді қалпына келтіруді сұрадыңыз

source: However, there is currently no user account associated with your email address: %(email_address)s.
kk_kz: Алайда, қазіргі уақытта пайдаланушы тіркелгісі сіздің электрондық пошта мекенжайыңызбен байланысты емес:%(email_address)s

source: If you did not request this change, you can ignore this email.
kk_kz: Егер сіз бұл өзгерісті сұрамасаңыз, сіз бұл электрондық поштаны елемеуіңіз мүмкін.

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
kk_kz: Егер Сіз парольді ауыстыруға өтінім бермеген болсаңыз, Сіз осы хабарға назар аудармасаңыз болады – Сіздің пароль әлі өзгертілген жоқ.

source: Change my Password
kk_kz: Сменить пароль

source: Please go to the following page and choose a new password:
kk_kz: Келесі бетке өтіңіз және жаңа парольді таңдаңыз:

source: Thanks for using our site!
kk_kz: Біздің сайтты пайдаланғаныңыз үшін рахмет!

source: The %(platform_name)s Team
kk_kz: %(platform_name)s тобы

source: Password reset on %(platform_name)s
kk_kz: Сброс пароля на платформе «%(platform_name)s»

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
kk_kz: Курсты аяқтады "{course_name}" ({course_mode}, {start_date} - {end_date})

source: Completed the course "{course_name}" ({course_mode})
kk_kz: Курсты аяқтады "{course_name}" ({course_mode})

source: The badge image must be square.
kk_kz: Белгішенің суреті төртбұрышты болуы керек.

source: The badge image file size must be less than 250KB.
kk_kz: Белгішенің кескін файлының өлшемі 250 КБ-тан аз болуы керек.

source: This value must be all lowercase.
kk_kz: Данное значение должно находиться в нижнем регистре.

source: The course mode for this badge image. For example, "verified" or "honor".
kk_kz: Бұл белгішенің кескініне арналған курс режимі. Мысалы, "тексерілген" немесе "үздік".

source: Badge images must be square PNG files. The file size should be under 250KB.
kk_kz: Бейдждердің суреттері төртбұрышты PNG файлдары болуы керек. Файл өлшемі 250 КБ аспауы керек.

source: Set this value to True if you want this image to be the default image for any course modes that do not have a specified badge image. You can have only one default image.
kk_kz: Егер сіз көрсетілген белгіше кескіні жоқ кез-келген курс режимдерінің әдепкі кескіні болуын қаласаңыз, бұл мәнді шын мәніне орнатыңыз. Сізде тек бір әдепкі сурет болуы мүмкін.

source: There can be only one default image.
kk_kz: Әдепкі бойынша тек бір сурет болуы мүмкін.

source: On each line, put the number of completed courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
kk_kz: Әр жолда 'openedx__course' беру компоненті бар сіз жасаған белгішелер класының белгішесі, үтірі және белгішесі үшін өткен курстардың санын көрсетіңіз. Мысалы: 3, enrolled_3_courses

source: On each line, put the number of enrolled courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
kk_kz: Әр жолда белгішемен марапаттау үшін тіркелген курстардың санын, үтірді және сіз жасаған 'openedx__course'.компоненті бар белгішелер класының атауын көрсетіңіз. Мысалы: 3, enrolled_3_courses

source: Each line is a comma-separated list. The first item in each line is the slug of a badge class you have created that has an issuing component of 'openedx__course'. The remaining items in each line are the course keys the learner needs to complete to be awarded the badge. For example: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second
kk_kz: Әр жол үтірмен бөлінген тізім болып табылады. Әр жолдағы бірінші элемент-сіз жасаған 'openedx__course' беру компоненті бар белгішелер класының оқы. Әр жолдағы қалған элементтер-бұл оқушы белгішені алу үшін толтыруы керек курс кілттері. Мысалы: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second

source: Please check the syntax of your entry.
kk_kz: Жазбаның синтаксисін тексеріңіз.

source: Take free online courses at edX.org
kk_kz: Тегін онлайн курстардан өтіңіз edX.org

source: © {org_name}. All rights reserved except where noted. EdX, Open edX and their respective logos are trademarks or registered trademarks of edX Inc.
kk_kz: © {org_name}. Все права защищены. EdX, Open edX и соответствующие логотипы являются зарегистрированными торговыми марками или торговыми марками edX Inc.

source: Powered by Open edX
kk_kz: Open edX негізінде

source: Blog
kk_kz: Блог

source: Contact Us
kk_kz: Бізбен хабарласыңыз

source: Help Center
kk_kz: Анықтама орталығы

source: Media Kit
kk_kz: Медиафайлдар пакеті

source: Donate
kk_kz: Қайырымдылық жасау

source: {platform_name} for Business
kk_kz: {platform_name} Бизнес үшін

source: News
kk_kz: Жаңалықтар

source: Contact
kk_kz: Байланыс

source: Careers
kk_kz: Вакансии

source: Terms of Service & Honor Code
kk_kz: Қызмет Көрсету Шарттары және Ар-намыс Кодексі

source: Privacy Policy
kk_kz: Құпиялылық саясаты

source: Accessibility Policy
kk_kz: Қолжетімділік саясаты

source: Sitemap
kk_kz: Сайт картасы

source: Terms of Service
kk_kz: Қызметтерді көрсету шарттары

source: Affiliates
kk_kz: Бөлімшелер

source: Trademark Policy
kk_kz: Тауар таңбаларына қатысты саясат
