Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: To access the APIs, you will need to create an {platform_name} user account for your application (not for personal use). This account will provide you with access to our API request page at {request_url}. On that page, you must complete the API request form including a description of your proposed uses for the APIs. Any account and registration information that you provide to {platform_name} must be accurate and up to date, and you agree to inform us promptly of any changes. {platform_name_capitalized} will review your API request form and, upon approval in {platform_name}'s sole discretion, will provide you with instructions for obtaining your API shared secret and client ID.
kk_kz: API-ге кіру үшін сізге қолданба үшін {platform_name} пайдаланушы тіркелгісін жасау керек (жеке пайдалану үшін емес). Бұл есептік жазба сізге API сұрау бетіне {request_url} мекен-жайы бойынша кіруге мүмкіндік береді. Бұл бетте сіз API сұрауының формасын, соның ішінде сіз ұсынатын API пайдалану әдістерінің сипаттамасын толтыруыңыз керек. Сіз {platform_name} берген кез-келген есептік жазба мен тіркеу туралы ақпарат дәл және өзекті болуы керек және сіз кез-келген өзгерістер туралы бізге дереу хабарлауға келісесіз. {platform_name_capitalized} сіздің API сұрау формаңызды қарастырады және өз қалауыңыз бойынша бекітілгеннен кейін {platform_name} сізге API және Клиент идентификаторының жалпы құпиясын алуға нұсқау береді.

source: Permissible Use
kk_kz: Рұқсат Етілген Пайдалану

source: You agree to use the APIs solely for the purpose of delivering content that is accessed through the APIs (the "API Content") to your own website, mobile site, app, blog, email distribution list, or social media property ("Your Application") or for another commercial use that you described in your request for access and that {platform_name} has approved on a case-by-case basis. {platform_name_capitalized} may monitor your use of the APIs for compliance with the Terms and may deny your access or shut down your integration if you attempt to go around or exceed the requirements and limitations set by {platform_name}. Your Application or other approved use of the API or the API Content must not prompt your end users to provide their {platform_name} username, password or other {platform_name} user credentials anywhere other than on the {platform_name} website at {platform_url}.
kk_kz: Сіз API-ді тек API ("мазмұн API") арқылы қол жеткізуге болатын мазмұнды жеке веб-сайтыңызға, мобильді веб-сайтыңызға, қосымшаңызға, блогыңызға, электрондық пошта тарату тізіміне немесе әлеуметтік желілердегі меншікке ("сіздің қосымшаңыз") немесе сіз өзіңіздің {platform_name} қол жеткізу сұрауыңызда сипаттаған және {platform_name} әр нақты жағдайда мақұлдаған басқа коммерциялық мақсатта пайдалану үшін пайдалануға келісесіз. {platform_name_capitalized} сіздің API пайдалануыңызды шарттарға сәйкестігін қадағалай алады және егер сіз {platform_name} белгілеген талаптар мен шектеулерді айналып өтуге немесе асып кетуге тырыссаңыз, кіруден бас тартуы немесе интеграцияны жабуы мүмкін. Сіздің қосымшаңыз немесе басқа мақұлданған API немесе API мазмұнын пайдалану соңғы пайдаланушылардан {platform_name} веб-сайтынан басқа жерде {platform_name} мекен-жайы бойынша {platform_url} пайдаланушының атын, паролін немесе басқа тіркелгі деректерін сұрамауы керек.

source: Prohibited Uses and Activities
kk_kz: Пайдалануға және қызметке тыйым салынған түрлері

source: {platform_name_capitalized} shall have the sole right to determine whether or not any given use of the APIs is acceptable, and {platform_name} reserves the right to revoke API access for any use that {platform_name} determines at any time, in its sole discretion, does not benefit or serve the best interests of {platform_name}, its users and its partners.
kk_kz: {platform_name_capitalized} кез-келген нақты API қолдану қолайлы ма, жоқ па, соны анықтауға айрықша құқығы бар және {platform_name} кез-келген пайдалану үшін API-ге кіруді кері қайтарып алу құқығын өзіне қалдырады.{platform_name}кез-келген уақытта өз қалауы бойынша анықтайды, ешқандай пайда әкелмейді немесе {platform_name}, оның пайдаланушылары мен серіктестерінің мүдделеріне жауап бермейді.

source: The following activities are not acceptable when using the APIs (this is not an exhaustive list):
kk_kz: API қолдану кезінде келесі әрекеттер жарамсыз (бұл толық тізім емес):

source: collecting or storing the names, passwords, or other credentials of {platform_name} users;
kk_kz: пайдаланушылардың аттарын, парольдерін немесе басқа тіркелгі деректерін жинау немесе сақтау {platform_name} ;

source: scraping or similar techniques to aggregate or otherwise create permanent copies of API Content;
kk_kz: API мазмұнының тұрақты көшірмелерін біріктіру немесе басқаша жасау үшін тазарту немесе ұқсас әдістер;

source: violating, misappropriating or infringing any copyright, trademark rights, rights of privacy or publicity, confidential information or any other right of any third party;
kk_kz: кез келген авторлық құқықты, тауар таңбаларына құқықтарды, жеке өмірге немесе жариялылыққа құқықтарды, құпия ақпаратты немесе кез келген үшінші тараптың кез келген басқа да құқықтарын бұзу, заңсыз иемдену немесе бұзу;

source: altering or editing any content or graphics in the API Content;
kk_kz: API мазмұнындағы кез-келген контентті немесе графиканы өзгерту немесе өңдеу;

source: altering or removing any trademark, copyright or other proprietary or legal notices contained in, or appearing on, the APIs or any API Content;
kk_kz: API-де немесе кез-келген API мазмұнында бар немесе пайда болатын кез-келген сауда белгілерін, авторлық құқықты немесе басқа мүліктік немесе заңды хабарламаларды өзгерту немесе жою;

source: sublicensing, re-distributing, renting, selling or leasing access to the APIs or your client secret to any third party;
kk_kz: клиенттің API немесе құпиясын кез келген үшінші тарапқа сублицензиялау, қайта тарату, жалға беру, сату немесе жалға беру;

source: distributing any virus, Trojan horse, spyware, adware, malware, bot, time bomb, worm, or other harmful or malicious component; or
kk_kz: кез-келген вирустың, трояндық жылқының, шпиондық бағдарламаның, жарнамалық бағдарламаның, зиянды бағдарламаның, боттың, уақыт бомбасының, құрттың немесе басқа зиянды немесе зиянды компоненттің таралуы; немесе

source: using the APIs for any purpose which or might overburden, impair or disrupt the {platform_name} platform, servers or networks.
kk_kz: платформаны, серверлерді немесе желілерді {platform_name} шамадан тыс жүктейтін, нашарлататын немесе бұзатын кез-келген мақсат үшін API қолдану.

source: Usage and Quotas
kk_kz: Пайдалану және квоталар

source: {platform_name_capitalized} reserves the right, in its discretion, to impose reasonable restrictions and limitations on the number and frequency of calls made by you or Your Application to the APIs. You must not attempt to circumvent any restrictions or limitations imposed by {platform_name}.
kk_kz: {platform_name_capitalized} сіз немесе сіздің API қосымшаңыз орындайтын қоңыраулардың саны мен жиілігіне ақылға қонымды шектеулер мен шектеулер қою құқығын өзіне қалдырады. Сіз {platform_name} орнатқан шектеулер мен шектеулерді айналып өтпеуіңіз керек.

source: Compliance
kk_kz: Келісім

source: You agree to comply with all applicable laws, regulations, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, copyright, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with {platform_name}. You will only access (or attempt to access) an API by the means described in the documentation of that API. You will not misrepresent or mask either your identity or Your Application's identity when using the APIs.
kk_kz: Сіз барлық қолданыстағы заңдарды, ережелерді және үшінші тараптардың құқықтарын (соның ішінде деректерді немесе бағдарламалық жасақтаманы, құпиялылықты, авторлық құқықты және жергілікті заңдарды импорттауға немесе экспорттауға қатысты заңдарды) орындауға келісесіз. Сіз API-ді заңсыз әрекеттерді немесе үшінші тұлғалардың құқықтарын бұзуды ынталандыру немесе көтермелеу үшін пайдаланбайсыз.сіз {platform_name} көмегімен қызмет көрсетудің басқа шарттарын бұзбайсыз. Сіз API-ге тек осы API құжаттамасында сипатталған құралдар арқылы қол жеткізе аласыз (немесе кіруге тырысасыз). API пайдалану кезінде сіз өзіңіздің жеке басыңызды немесе қолданбаңыздың жеке басын бұрмаламайсыз немесе жасырмайсыз.

source: Ownership
kk_kz: Меншік

source: You acknowledge and agree that the APIs and all API Content contain valuable intellectual property of {platform_name} and its partners. The APIs and all API Content are protected by United States and foreign copyright, trademark, and other laws. All rights in the APIs and the API Content, if not expressly granted, are reserved. By using the APIs or any API Content, you do not acquire ownership of any rights in the APIs or API Content. You must not claim or attempt to claim ownership in the APIs or any API Content or misrepresent yourself or your company or your Application as being the source of any API Content. You may not modify, create derivative works of, or attempt to use, license, or in any way exploit any API Content in whole or in part on your own behalf or on behalf of any third party. You may not distribute or modify the APIs or any API Content (including adaptation, editing, excerpting, or creating derivative works).
kk_kz: Сіз API және барлық API мазмұнында құнды зияткерлік меншік {platform_name} және оның серіктестері бар екенін мойындайсыз және келісесіз. API және барлық API мазмұны АҚШ және басқа елдердің авторлық құқық, сауда белгілері және басқа заңдармен қорғалған. Барлық API құқықтары мен API мазмұны, егер олар тікелей берілмеген болса, қорғалған. API немесе кез-келген API мазмұнын қолдана отырып, сіз API немесе API мазмұнына меншік құқығын ала алмайсыз. Сіз API немесе кез-келген API мазмұнына ие болуға немесе өзіңізді, компанияңызды немесе қосымшаңызды кез-келген API мазмұнының көзі ретінде жалған түрде көрсетуге тырыспауыңыз керек. Сіз өзіңіздің атыңыздан немесе үшінші тараптың атынан кез-келген API мазмұнын толығымен немесе ішінара өзгертуге, туынды жұмыс жасауға немесе пайдалануға, лицензиялауға немесе қандай да бір жолмен пайдалануға құқығыңыз жоқ. Сіз API немесе кез-келген API мазмұнын таратуға немесе өзгертуге құқығыңыз жоқ (бейімдеу, өңдеу, шығару немесе туынды жұмыс жасау).

source: All names, logos and seals ("Trademarks") that appear in the APIs, API Content, or on or through the services made available on or through the APIs, if any, are the property of their respective owners. You may not remove, alter, or obscure any copyright, Trademark, or other proprietary rights notices incorporated in or accompanying the API Content. If any {platform_name} Participant (as hereinafter defined) or other third party revokes access to API Content owned or controlled by that {platform_name} Participant or third party, including without limitation any Trademarks, you must ensure that all API Content pertaining to that {platform_name} Participant or third party is deleted from Your Application and your networks, systems and servers as soon as reasonably possible. "{platform_name_capitalized} Participants" means MIT, Harvard, and the other entities providing information, API Content or services for the APIs, the course instructors and their staffs.
kk_kz: API-де, API-де немесе API-де қол жетімді қызметтерде немесе олар арқылы пайда болатын барлық атаулар, логотиптер мен басып шығарулар ("сауда белгілері") олардың тиісті иелерінің меншігі болып табылады. API мазмұнына кіретін немесе онымен бірге жүретін авторлық құқықтар, сауда белгілері немесе басқа меншік құқықтары туралы хабарландыруларды жоюға, өзгертуге немесе жасыруға құқығыңыз жоқ. Егер қандай да бір қатысушы {платформа_name} (төменде анықталғандай) немесе басқа үшінші тарап осы мүше {платформа_name} немесе үшінші тарап басқаратын API мазмұнына кіруді болдырмаса, соның ішінде кез-келген сауда белгілері болса, сіз осы мүшеге қатысты барлық API мазмұнын қамтамасыз етуіңіз керек {платформа_name} немесе үшінші тарап сіздің Қосымшаңыздан және желілеріңізден, жүйелеріңізден және серверлеріңізден мүмкіндігінше тезірек жойылуын қамтамасыз етуіңіз керек. "{platform_name_capitalized} қатысушылар " Массачусетс технологиялық институтын, Гарвардты және API-ге, курс оқытушыларына және олардың қызметкерлеріне ақпарат, API мазмұны немесе қызмет көрсететін басқа ұйымдарды білдіреді.

source: To the extent that you submit any content to {platform_name} in connection with your use of the APIs or any API Content, you hereby grant to {platform_name} a worldwide, non-exclusive, transferable, assignable, sub licensable, fully paid-up, royalty-free, perpetual, irrevocable right and license to host, transfer, display, perform, reproduce, modify, distribute, re-distribute, relicense and otherwise use, make available and exploit such content, in whole or in part, in any form and in any media formats and through any media channels (now known or hereafter developed).
kk_kz: Сіз API немесе кез-келген API мазмұнын пайдалануға байланысты қандай-да бір мазмұнды {platform_name} жібересіз, осы арқылы сіз {platform_name} бүкіл әлем бойынша, ерекше емес, берілетін, тағайындалған, сублицензияланатын, толық төленген, ақысыз, мерзімсіз, қайтарылмайтын құқық және орналастыруға, беруге, көрсетуге, орындауға, көбейтуге, өзгертуге, таратуға, қайта таратуға, реликке және басқа да пайдалануға, осындай мазмұнды толық немесе ішінара, кез-келген нысанда және кез-келген медиа-сайтта, кез-келген және кез-келген медиа арналар арқылы (қазір белгілі немесе болашақта дамыған).

source: Privacy
kk_kz: Құпиялық

source: You agree to comply with all applicable privacy laws and regulations and to be transparent with respect to any collection and use of end user data. You will provide and adhere to a privacy policy for Your Application that clearly and accurately describes to your end users what user information you collect and how you may use and share such information (including for advertising) with {platform_name} and other third parties.
kk_kz: Сіз барлық қолданылатын құпиялылық туралы заңдар мен ережелерді сақтауға келісесіз және соңғы пайдаланушы деректерін жинауға және пайдалануға қатысты ашық боласыз. Сіз өзіңіздің соңғы пайдаланушыларыңызға қандай пайдаланушы туралы ақпаратты жинайтындығыңызды және осындай ақпаратты (соның ішінде жарнама үшін) {platform_name} және басқа үшінші тараптарды қалай пайдалануға және жіберуге болатындығын нақты және дәл сипаттайтын қолданбаңызға құпиялылық саясатын бересіз және сақтайсыз.

source: Right to Charge
kk_kz: Тапсыру құқығы

source: Certain access to the APIs may be provided free of charge, but {platform_name} reserves the right to charge fees for future use or access to the APIs.
kk_kz: API-ге белгілі бір қол жетімділік тегін берілуі мүмкін, бірақ {platform_name} болашақта API пайдалану немесе кіру үшін ақы алу құқығын өзіне қалдырады.

source: {platform_name_capitalized} reserves the right to modify the Terms at any time without advance notice. Any changes to the Terms will be effective immediately upon posting on this page, with an updated effective date. By accessing or using the APIs after any changes have been made, you signify your agreement on a prospective basis to the modified Terms and all of the changes. Be sure to return to this page periodically to ensure familiarity with the most current version of the Terms.
kk_kz: {platform_name_capitalized} алдын ала ескертусіз кез келген уақытта шарттарды өзгерту құқығын өзіне қалдырады. Шарттардағы кез келген өзгерістер күшіне ену күні Жаңартылған осы бетте жарияланғаннан кейін дереу күшіне енеді. Кез-келген өзгертулер енгізілгеннен кейін API-ге кіру немесе пайдалану арқылы сіз болашақта өзгертілген шарттар мен барлық өзгерістермен келісіміңізді растайсыз. Шарттардың ең соңғы нұсқасымен танысу үшін осы бетке мезгіл-мезгіл оралуды ұмытпаңыз.

source: {platform_name_capitalized} may also update or modify the APIs from time to time without advance notice. These changes may affect your use of the APIs or the way your integration interacts with the API. If we make a change that is unacceptable to you, you should stop using the APIs. Continued use of the APIs means you accept the change.
kk_kz: {platform_name_capitalized} сонымен қатар алдын-ала ескертусіз кейде API жаңарта немесе өзгерте алады. Бұл өзгерістер сіздің API пайдалануыңызға немесе интеграцияның API-мен өзара әрекеттесуіне әсер етуі мүмкін. Егер сіз үшін қолайсыз өзгерістер енгізсек, API қолдануды тоқтату керек. API-ді одан әрі пайдалану өзгерістерді қабылдағаныңызды білдіреді.

source: Confidentiality
kk_kz: Құпиялық

source: Your credentials (such as client secret and IDs) are intended to be used solely by you. You will keep your credentials confidential and prevent and discourage others from using your credentials. Your credentials may not be embedded in open source projects.
kk_kz: Сіздің тіркелгі деректеріңіз (мысалы, клиенттің құпиясы және идентификаторлар) тек сіз пайдалануға арналған. Сіз өзіңіздің тіркелгі деректеріңізді құпия сақтайсыз және басқаларға сіздің тіркелгі деректеріңізді пайдалануға жол бермейсіз. Сіздің тіркелгі деректеріңіз ашық бастапқы жобаларға енбеуі мүмкін.

source: In the event that {platform_name} provides you with access to information specific to {platform_name} and/or the APIs that is either marked as "Confidential" or which a reasonable person would assume to be confidential or proprietary given the terms of its disclosure ("Confidential Information"), you agree to use this information only to use and build with the APIs. You may not disclose the Confidential Information to anyone without {platform_name}'s prior written consent, and you agree to protect the Confidential Information from unauthorized use and disclosure in the same way that you would protect your own confidential information. Confidential Information does not include information that you independently developed, that was rightfully given to you by a third party without any confidentiality obligation, or that becomes public through no fault of your own. You may disclose Confidential Information when compelled to do so by law if you provide {platform_name} with reasonable prior notice, unless a court orders that {platform_name} not receive notice.
kk_kz: Егер {platform_name} сізге {platform_name}және/немесе API-ге қатысты ақпаратқа қол жеткізуге мүмкіндік берсе, ол "құпия" деп белгіленген немесе оны ашу шарттарын ескере отырып, ақылды адам құпия немесе жеке деп санайтын болса ("құпия ақпарат"), сіз бұл ақпаратты тек API көмегімен пайдалану және құру үшін пайдалануға келісесіз. Сіз {platform_name} алдын-ала жазбаша келісімінсіз кез-келген адамға құпия ақпаратты ашуға құқығыңыз жоқ және сіз құпия ақпаратты рұқсатсыз пайдаланудан және {platform_name} ашудан өз құпия ақпаратыңызды қорғайтындай етіп қорғауға келісесіз. Құпия ақпаратқа сіз дербес әзірлеген, құпиялылықты қамтамасыз ету бойынша қандай да бір міндеттемелерсіз үшінші тарап сізге құқық бойынша берген немесе сіздің кінәсіз көпшілікке қолжетімді болатын ақпарат кірмейді. Егер сіз {platform_name} ақылға қонымды болса, сіз осы Заңға мәжбүр болсаңыз, құпия ақпаратты аша аласыз

source: Disclaimer of Warranty / Limitation of Liabilities
kk_kz: Кепілдіктен бас тарту / Жауапкершілікті шектеу

source: THE APIS AND ANY INFORMATION, API CONTENT OR SERVICES MADE AVAILABLE ON OR THROUGH THE APIS ARE PROVIDED "AS IS" AND "AS AVAILABLE" WITHOUT WARRANTY OF ANY KIND (EXPRESS, IMPLIED OR OTHERWISE), INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, EXCEPT INSOFAR AS ANY SUCH IMPLIED WARRANTIES MAY NOT BE DISCLAIMED UNDER APPLICABLE LAW.
kk_kz: API ЖӘНЕ API-ДЕ НЕМЕСЕ API АРҚЫЛЫ ҚОЛ ЖЕТІМДІ КЕЗ-КЕЛГЕН АҚПАРАТ, API МАЗМҰНЫ НЕМЕСЕ ҚЫЗМЕТТЕР КЕЗ-КЕЛГЕН КЕПІЛДІКСІЗ (АНЫҚ, БОЛЖАНАТЫН НЕМЕСЕ БАСҚА), СОНЫҢ ІШІНДЕ КЕЗ-КЕЛГЕН КЕПІЛДІКСІЗ, БЕЛГІЛІ БІР МАҚСАТҚА ЖАРАМДЫ ЖӘНЕ ҚҰҚЫҚТАРДЫ БҰЗБАЙТЫН КЕЗ-КЕЛГЕН КЕПІЛДІКТЕРДІ ҚОСПАҒАНДА, "СОЛ СИЯҚТЫ" ЖӘНЕ "ҚОЛ ЖЕТІМДІ" БОЛЫП ТАБЫЛАДЫ.ҚОЛДАНЫСТАҒЫ ЗАҢНАМАҒА СӘЙКЕС КЕЗ-КЕЛГЕН КЕПІЛДІКТЕРДЕН БАС ТАРТУ МҮМКІН ЕМЕС.

source: {platform_name} AND THE {platform_name} PARTICIPANTS DO NOT WARRANT THAT THE APIS WILL OPERATE IN AN UNINTERRUPTED OR ERROR-FREE MANNER, THAT THE APIS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE APIS OR API CONTENT PROVIDED WILL MEET YOUR NEEDS OR EXPECTATIONS. {platform_name} AND THE {platform_name} PARTICIPANTS ALSO MAKE NO WARRANTY ABOUT THE ACCURACY, COMPLETENESS, TIMELINESS, OR QUALITY OF THE APIS OR ANY API CONTENT, OR THAT ANY PARTICULAR API CONTENT WILL CONTINUE TO BE MADE AVAILABLE.
kk_kz: {platform_name}және қатысушы лар {platform_name} API интерфейстерінің үздіксіз немесе қатесіз жұмыс істейтініне, API ИНТЕРФЕЙСТЕРІНДЕ вирустар немесе басқа зиянды компоненттер жоқ екеніне немесе берілген API немесе API мазмұны сіздің қажеттіліктеріңізге немесе ҮМІТТЕРІҢІЗГЕ сәйкес келетініне кепілдік бермейді. {платформа_name} және қатысушылар {платформа_name} сонымен қатар API немесе кез-келген API мазмұнының дәлдігі, толықтығы, уақтылығы немесе сапасы туралы, сондай-ақ белгілі бір API мазмұны әлі де қол жетімді болатынына кепілдік бермейді.

source: USE OF THE APIS, AND THE API CONTENT AND ANY SERVICES OBTAINED FROM OR THROUGH THE APIS, IS AT YOUR OWN RISK. YOUR ACCESS TO OR DOWNLOAD OF INFORMATION, MATERIALS OR DATA THROUGH THE APIS IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH INFORMATION, MATERIALS OR DATA, UNLESS OTHERWISE EXPRESSLY PROVIDED FOR IN THE {platform_name} PRIVACY POLICY.
kk_kz: API-ДІ, СОНДАЙ-АҚ API МАЗМҰНЫН ЖӘНЕ API-МЕН НЕМЕСЕ ОЛАР АРҚЫЛЫ АЛЫНҒАН КЕЗ-КЕЛГЕН ҚЫЗМЕТТІ ПАЙДАЛАНУ СІЗДІҢ ЖЕКЕ ТӘУЕКЕЛІҢІЗГЕ БАЙЛАНЫСТЫ. Егер Құпиялылық саясатында өзгеше көзделмесе, сіздің ақпаратқа, материалдарға немесе деректерге API арқылы қол жеткізуіңіз немесе жүктеуіңіз өз қалауыңыз бен тәуекеліңізге қарай жүзеге асырылады және сіз өзіңіздің меншігіңізге (соның ішінде сіздің компьютер жүйеңізге) келтірілген залал немесе осындай ақпаратты, материалдарды немесе деректерді жүктеу немесе пайдалану нәтижесі болып табылатын деректердің жоғалуы үшін жалғыз жауапты боласыз {platform_name}.

source: TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AGREE THAT NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL BE LIABLE TO YOU FOR ANY LOSS OR DAMAGES, EITHER ACTUAL OR CONSEQUENTIAL, ARISING OUT OF OR RELATING TO THE TERMS, OR YOUR (OR ANY THIRD PARTY'S) USE OF OR INABILITY TO USE THE APIS OR ANY API CONTENT, OR YOUR RELIANCE UPON INFORMATION OBTAINED FROM OR THROUGH THE APIS, WHETHER YOUR CLAIM IS BASED IN CONTRACT, TORT, STATUTORY OR OTHER LAW.
kk_kz: БАРЫНША МҮМКІН ДӘРЕЖЕДЕ, рұқсат ЕТІЛГЕН ҚОЛДАНЫСТАҒЫ ЗАҢНАМАСЫНА сәйкес, СІЗ КЕЛІСЕСІЗ, БҰЛ БІРДЕ - {platform_name}, БІРДЕ-БІРЕУІ ҚАТЫСУШЫЛАРДЫҢ {platform_name} тартылмайды ЖАУАПКЕРШІЛІКТІ СІЗДІҢ алдыңызда, КЕЗ келген ШЫҒЫНДАР НЕМЕСЕ ЗАЛАЛ үшін, НАҚТЫ НЕМЕСЕ ЖАНАМА, ТУЫНДАЙТЫН НӘТИЖЕСІНДЕ НЕМЕСЕ оған БАЙЛАНЫСТЫ ШАРТТАРМЕН, НЕМЕСЕ СІЗДІҢ (НЕМЕСЕ КЕЗ келген ҮШІНШІ ТАРАП) ПАЙДАЛАНУ НЕМЕСЕ ПАЙДАЛАНУ мүмкін ЕМЕСТІГІНЕ API НЕМЕСЕ КЕЗ келген МАЗМҰН API, НЕМЕСЕ СІЗДІҢ СЕНІМІН АЛЫНҒАН АҚПАРАТҚА НЕМЕСЕ API ҚАРАМАСТАН, ҚҰРЫЛҒАН, СІЗДІҢ ШАҒЫМ-талап КЕЛІСІМШАРТТА құқық БҰЗУШЫЛЫҚ ЗАҢНАМАЛЫҚ НЕМЕСЕ ӨЗГЕ ДЕ ЗАҢДА КӨРСЕТІЛГЕН.
