Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
kk_kz: Егер сіз расталған сертификат алғыңыз келсе, бірақ төлемді төлей алмасаңыз, қазір өтініш беріңіз. Қаржылық көмек шектеулі және барлық тиісті үміткерлерге берілмеуі мүмкін екенін ескеріңіз.

source: In order to be eligible for edX Financial Assistance, you must demonstrate that paying the Verified Certificate fee would cause you economic hardship. To apply, you will be asked to answer a few questions about why you are applying and how the Verified Certificate will benefit you.
kk_kz: EdX қаржылық көмегін алуға құқылы болу үшін Сіз расталған сертификат үшін ақы төлеу сізге экономикалық қиындықтар тудыратынын көрсетуіңіз керек. Өтініш беру үшін сізден неліктен өтініш бергеніңіз және расталған сертификат сізге қалай пайда әкелетіні туралы бірнеше сұрақтарға жауап беру сұралады.

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
kk_kz: Егер Сіздің өтінішіңіз мақұлданса, біз сізге жеке басыңызды тексеру туралы нұсқаулар береміз edx.org осылайша сіз edX курсын аяқтау үшін жұмыс жасай аласыз.

source: EdX is committed to making it possible for you to take high quality courses from leading institutions regardless of your financial situation, earn a Verified Certificate, and share your success with others.
kk_kz: EdX сізге қаржылық жағдайыңызға қарамастан жетекші оқу орындарында жоғары сапалы курстардан өтуге, расталған сертификат алуға және өз жетістіктеріңізді басқалармен бөлісуге мүмкіндік береді.

source: Sincerely, Anant
kk_kz: Шынайылықпен, Anant

source: Back to Student FAQs
kk_kz: Назад к разделу «Вопросы и ответы»

source: Apply for Financial Assistance
kk_kz: Қаржылық көмекке жүгіну

source: {platform_name} Home Page
kk_kz: {platform_name} Басты бет

source: Options Menu
kk_kz: Опциялар мәзірі

source: {begin_strong}Warning:{end_strong} Your browser is not fully supported. We strongly recommend using {chrome_link} or {ff_link}.
kk_kz: {begin_strong}ескерту: {end_strong} сіздің шолғышыңызға толық қолдау көрсетілмейді. Біз {chrome_link} немесе {ff_link} қолдануды ұсынамыз.

source: Programs
kk_kz: Бағдарламалар

source: Profile
kk_kz: Профиль

source: Discover New
kk_kz: Жаңаны Ашыңыз

source: Sysadmin
kk_kz: Сисадмин

source: Shopping Cart
kk_kz: Корзина

source: Supplemental Links
kk_kz: Қосымша Сілтемелер

source: How it Works
kk_kz: Бұл қалай жұмыс істейді

source: Schools
kk_kz: Университеттер

source: Resume your last course
kk_kz: Соңғы курсты жалғастырыңыз

source: Add Coupon Code
kk_kz: Купон Кодын Қосу

source: Enter information about the coupon code below.
kk_kz: Купон коды туралы ақпаратты төменде енгізіңіз.

source: Discount Percentage
kk_kz: Жеңілдік пайызы

source: Add expiration date
kk_kz: Жарамдылық мерзімін қосыңыз

source: Example Certificates
kk_kz: Сертификат Мысалдары

source: Generate example certificates for the course.
kk_kz: Создать образец Сертификата курса.

source: Generate Example Certificates
kk_kz: Сертификат Мысалдарын Жасау

source: Status:
kk_kz: Мәртебе:

source: Generating example {name} certificate
kk_kz: Үлгі сертификатын жасау {name}

source: Error generating example {name} certificate: {error}
kk_kz: Қате жасау мысалы {name} сертификаты:{error}

source: View {name} certificate
kk_kz: Сертификатты қарау {name}

source: Refresh Status
kk_kz: Жаңарту күйі

source: Student-Generated Certificates
kk_kz: Оқушылар берген сертификаттар

source: Disable Student-Generated Certificates
kk_kz: Оқушылар Жасаған Сертификаттарды Өшіру

source: Enable Student-Generated Certificates
kk_kz: Оқушылар Жасаған Сертификаттарды Қосу

source: You must successfully generate example certificates before you enable student-generated certificates.
kk_kz: Оқушылар жасаған сертификаттарды қоспас бұрын сіз сертификаттардың мысалдарын сәтті жасауыңыз керек.

source: Generate Certificates
kk_kz: Сертификаттар Жасау

source: Course certificate generation requires an activated web certificate configuration.
kk_kz: Курс сертификатын жасау үшін веб-куәліктің конфигурациясы қажет.

source: When you are ready to generate certificates for your course, click Generate Certificates. You do not need to do this if you have set the certificate mode to on-demand generation.
kk_kz: Курс үшін сертификаттар жасауға дайын болған кезде, сертификаттар Жасау түймесін басыңыз. Егер сіз сұраныс бойынша сертификат режимін орнатқан болсаңыз, мұны істеудің қажеті жоқ.

source: Pending Tasks
kk_kz: Шешілмеген Міндеттер

source: The status for any active tasks appears in a table below.
kk_kz: Кез келген белсенді тапсырманың мәртебесі төмендегі кестеде пайда болады.

source: Regenerate Certificates
kk_kz: Сертификаттарды Регенерациялау

source: To regenerate certificates for your course, choose the learners who will receive regenerated certificates and click Regenerate Certificates.
kk_kz: Курстың сертификаттарын қалпына келтіру үшін қалпына келтірілген сертификаттарды алатын студенттерді таңдап, "сертификаттарды қалпына келтіру" түймесін басыңыз.

source: Choose learner types for regeneration
kk_kz: Қайта қалпына келтіру үшін оқушылардың түрлерін таңдаңыз

source: Regenerate for learners who have already received certificates. ({count})
kk_kz: Сертификат алған оқушыларға арналған қалпына келтіру. ({count})

source: Regenerate for learners who have not received certificates. ({count})
kk_kz: Сертификат алмаған оқушыларға арналған қалпына келтіру. ({count})

source: Regenerate for learners with audit passing state. ({count})
kk_kz: Аудиттен өткен оқушылар үшін қалпына келтіру. ({count})

source: Regenerate for learners with audit not passing state. ({count})
kk_kz: Аудиттен өтпеген оқушылар үшін қалпына келтіру. ({count})

source: Regenerate for learners in an error state. ({count})
kk_kz: Қате жағдайдағы оқушыларға арналған қалпына келтіру.({count})

source: Certificate Generation History
kk_kz: Сертификаттарды құру тарихы

source: Task name
kk_kz: Тапсырманың аты

source: SET CERTIFICATE EXCEPTIONS
kk_kz: СЕРТИФИКАТТАРДЫҢ ЕРЕКШЕЛІКТЕРІН ОРНАТЫҢЫЗ

source: Set exceptions to generate certificates for learners who did not qualify for a certificate but have been given an exception by the course team. After you add learners to the exception list, click Generate Exception Certificates below.
kk_kz: Сертификат алуға құқығы жоқ, бірақ курс командасынан ерекше жағдай алған студенттерге сертификаттар құру үшін ерекше жағдайлар жасаңыз. Оқушыларды ерекшеліктер тізіміне қосқаннан кейін төмендегі ерекшелік сертификаттарын Жасау түймесін басыңыз.

source: Invalidate Certificates
kk_kz: Сертификаттардың Күшін Жою

source: Enrollment Information
kk_kz: Қатысу туралы ақпарат

source: Number of enrollees (admins, staff, and students) by track
kk_kz: Жолдар бойынша талапкерлер (әкімшілер, қызметкерлер және студенттер) саны

source: Audit
kk_kz: Тегін курс

source: Professional
kk_kz: кәсіпқой

source: Basic Course Information
kk_kz: Курс туралы негізгі ақпарат

source: Course Name:
kk_kz: Курстың атауы:

source: Course Start Date:
kk_kz: Курстың басталу күні:

source: Course End Date:
kk_kz: Курстың Аяқталу Күні:

source: No end date set
kk_kz: Аяқталу күні белгіленбеген

source: Has the course started?
kk_kz: Курс басталды ма?

source: Yes
kk_kz: Иә

source: No
kk_kz: Жоқ

source: Has the course ended?
kk_kz: Курс аяқталды ма?

source: Number of sections:
kk_kz: Секциялар саны:

source: Grade Cutoffs:
kk_kz: Грейд шекаралары:

source: View detailed Git import logs for this course {link_start}by clicking here{link_end}.
kk_kz: Подробный отчёт об импорте из Git-репозитория курса: {link_start}посмотреть{link_end}.

source: Course Warnings
kk_kz: Курстың ескертулері

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
kk_kz: Осы курс үшін бағалардың конфигурациясын бейнелеу үшін басыңыз. Бағалар конфигурациясы курстың кіші секцияларының бағаларына бөлінеді (емтихандар және тапсырмалар топтары сияқты), және Студияда 'Бағалар' бетінде ('Бапталымдар' астында) өзгертіле алады

source: Grading Configuration
kk_kz: Бағалау конфигурациясы

source: Click to download a CSV of anonymized student IDs:
kk_kz: Студенттің анонимді ID үшін CSV жүктеу үшін басыңыз:

source: Get Student Anonymized IDs CSV
kk_kz: CSV көмегімен анонимделген студенттің құжатын алу

source: Reports
kk_kz: Есептер

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
kk_kz: Үлкен курстар үшін кейбір есептерді жасау бірнеше сағатты алуы мүмкін. Есепті құру аяқталғаннан кейін төмендегі кестеде жасалған күні мен уақыты көрсетілген сілтеме пайда болады. Бұл есептер фонда жасалады, яғни есепті жасау кезінде осы беттен өтуге болады.

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
kk_kz: Өтінемін, шыдамды болыңыз және бұл түймелерді бірнеше рет баспаңыз. Бұл батырмаларды бірнеше рет басу генерация процесін едәуір баяулатады.

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
kk_kz: Есептік жазбалардан электрондық почтаның мекенжайлары және пайдаланушылардың аттары сияқты ақпаратты қосқанда, осы курста оқитын студенттердің тізімімен CSV-файлды құру үшін басыңыз:

source: Download profile information as a CSV
kk_kz: CSV профильдің ақпаратын жүктеу

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
kk_kz: Нажмите, чтобы создать файл в формате CSV со списком ещё не зарегистрировавшихся пользователей, которым доступна регистрация на этот курс

source: Download a CSV of learners who can enroll
kk_kz: Жазыла алатын студенттердің CSV файлын жүктеңіз

source: Click to generate a CSV file of all proctored exam results in this course.
kk_kz: Осы курс бойынша барлық емтихан нәтижелері бар CSV файлын құру үшін нұқыңыз.

source: Generate Proctored Exam Results Report
kk_kz: Ұзартылған Емтихан Нәтижелері Туралы Есеп Жасау

source: Click to generate a CSV file of survey results for this course.
kk_kz: Осы курс үшін сауалнама нәтижелері бар CSV файлын жасау үшін нұқыңыз.

source: Generate Survey Results Report
kk_kz: Создать отчёт о результатах опроса

source: Select a problem to generate a CSV file that lists all student answers to the problem. You also select a section or chapter to include results of all problems in that section or chapter.
kk_kz: Оқушылардың барлық жауаптарын тізімдейтін CSV файлын құру үшін мәселені таңдаңыз. Осы бөлімдегі немесе тараудағы барлық мәселелердің нәтижелерін қосу үшін бөлімді немесе тарауды таңдайсыз.

source: NOTE
kk_kz: Жазба

source: The generated report is limited to {max_entries} responses. If you expect more than {max_entries} responses, try generating the report on a chapter-by-chapter, or problem-by-problem basis, or contact your site administrator to increase the limit.
kk_kz: Жасалған есеп жауаптармен шектелген {max_entries}. Егер сіз көбірек {max_entries} жауап күтсеңіз, тараулар немесе мәселелер туралы есеп жасап көріңіз немесе лимитті арттыру үшін сайт әкімшісіне хабарласыңыз.

source: Download a CSV of problem responses
kk_kz: Скачать файл CSV с ответами на задание

source: Click to list certificates that are issued for this course:
kk_kz: Осы курс үшін берілген сертификаттар тізімін көру үшін басыңыз:

source: View Certificates Issued
kk_kz: Берілген Сертификаттарды Қарау

source: Download CSV of Certificates Issued
kk_kz: Берілген сертификаттардың CSV-файлын жүктеу

source: For smaller courses, click to list profile information for enrolled students directly on this page:
kk_kz: Для небольших курсов: нажмите на кнопку, чтобы показать личные данные обучающихся прямо на этой странице.

source: List enrolled students' profile information
kk_kz: Тіркелген студенттердің тізімін және олардың жеке деректерін құру

source: Click to generate a CSV grade report for all currently enrolled students.
kk_kz: Қазіргі уақытта қабылданған барлық студенттер үшін CSV форматындағы бағалау есебін жасау үшін басыңыз.

source: Generate Grade Report
kk_kz: Бағалау парағын құру

source: Generate Problem Grade Report
kk_kz: Проблемаларды Бағалау Туралы Есеп Құру

source: Generate ORA Data Report
kk_kz: ORA деректер есебін жасау

source: Reports Available for Download
kk_kz: Көшіріп жүктеу үшін Бағалау Парақтары Қолжетімді

source: The reports listed below are available for download. A link to every report remains available on this page, identified by the UTC date and time of generation. Reports are not deleted, so you will always be able to access previously generated reports from this page.
kk_kz: Перечисленные ниже оценочные листы и списки доступны для скачивания. Ссылки на все отчёты остаются на этой странице, отличить иx можно по дате и времени создания по UTC. Отчёты не удаляются, так что вы всегда сможете получить доступ к ранее созданным отчётам с этой страницы.

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
kk_kz: Төменде көрсетілген жауаптар бойынша есеп автоматты фондық процеспен мерзімді генерацияланады. Есеп жиынтықты, сондықтан процестің басталуынан кейін жарияланған есептер кейінгі есептерге кіреді. Есептер күніне бірнеше рет құрылады.

source: {strong_start}Note{strong_end}: To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.
kk_kz: {strong_start}Примечание{strong_end}: чтобы сохранить конфиденциальность данных, прямые ссылки на них невозможно сохранить или отправить по электронной почте. Копии ссылок действуют в течение 5 минут.

source: Enrollment Codes
kk_kz: Регистрационные коды

source: Create one or more pre-paid course enrollment codes. Students can use these codes to enroll in the course.
kk_kz: Создать один или более предварительно оплаченных кодов для записи на курс. Пользователи смогут использовать эти коды, чтобы записаться на курс.

source: Create Enrollment Codes
kk_kz: Тіркеу Кодтарын Жасау

source: Cancel, restore, or mark an enrollment code as unused.
kk_kz: Аннулировать регистрационный код, восстановить его или отметить как неиспользованный.

source: Change Enrollment Code Status
kk_kz: Изменить статус регистрационного кода

source: Download a .csv file of all enrollment codes for this course.
kk_kz: Скачать файл в формате .csv со списком всех регистрационных кодов курса.

source: Download All Enrollment Codes
kk_kz: Скачать все коды для записи на курс

source: Download a .csv file of all unused enrollment codes for this course.
kk_kz: Скачать файл в формате .csv со всеми неиспользованными регистрационными кодами курса.

source: Download Unused Enrollment Codes
kk_kz: Скачать неиспользованные коды для записи на курс

source: Download a .csv file of all used enrollment codes for this course.
kk_kz: Скачать файл в формате .csv со всеми использованными регистрационными кодами курса.

source: Download Used Enrollment Codes
kk_kz: Скачать использованные коды для записи на курс

source: Course Price
kk_kz: Курстың құны

source: Course price per seat:
kk_kz: Цена за место на курсе:

source: Edit Price
kk_kz: Изменить цену

source: Course Seat Purchases
kk_kz: Купленные места на курсе

source: Total Credit Card Purchases:
kk_kz: Итого покупок по кредитным картам:

source: Download a .csv file for all credit card purchases or for all invoices, regardless of status.
kk_kz: Скачайте файл CSV со списком всех счетов на оплату и покупок по кредитной карте.

source: Download All Invoices
kk_kz: Скачать все счета-фактуры

source: Download All Credit Card Purchases
kk_kz: Скачать все покупки по кредитным картам

source: To cancel or resubmit an invoice, enter the invoice number below.
kk_kz: Введите номер счёта-фактуры в поле, расположенное ниже, чтобы погасить или повторно отправить счёт-фактуру.

source: Invoice Number
kk_kz: Номер счёта-фактуры

source: Cancel Invoice
kk_kz: Погасить счёт-фактуру

source: Resubmit Invoice
kk_kz: Повторно отправить счёт-фактуру

source: Create a .csv file that contains enrollment information for your course.
kk_kz: Создать файл в формате .csv, содержащий информацию о регистрации на курс.

source: Create Enrollment Report
kk_kz: Создать отчёт о регистрации на курс

source: Create an HTML file that contains an executive summary for this course.
kk_kz: Создать файл в формате HTML, содержащий сводный отчёт о курсе.

source: Create Executive Summary
kk_kz: Создать сводный отчёт

source: Available Reports
kk_kz: Доступные отчёты

source: The following reports are available for download. Reports are not deleted. A link to every report remains available on this page, identified by the date and time (in UTC) that the report was generated.
kk_kz: Следующие отчёты доступны для скачивания. Отчёты не удаляются. На этой странице будут доступны ссылки на каждый отчёт с указанием даты и времени (UTC) создания отчёта.

source: {strong_start}Note{strong_end}: To help protect learner data, links to these reports that you save outside of this page or that you send or receive in email expire after five minutes.
kk_kz: {strong_start}Примечание{strong_end}: чтобы защитить данные слушателей, срок действия ссылок на отчёты, сохранённых где-либо помимо этой страницы или отправленных/полученных вами по электронной почте, составляет пять минут.

source: Coupon Code List
kk_kz: Список купонов на скидку

source: Download a .csv file of all coupon codes for this course.
kk_kz: Скачать файл в формате .csv с кодами всех купонов на скидку на этот курс.

source: Download Coupon Codes
kk_kz: Скачать коды купонов на скидку

source: Coupon Codes
kk_kz: Коды купонов

source: Coupon (%)
kk_kz: Купон (%)

source: Number Redeemed
kk_kz: Количество использованных

source: The Invoice Number field cannot be empty.
kk_kz: Поле «Номер счёта-фактуры» не может быть пустым.

source: No Expiration Date
kk_kz: Отсутствует дата истечения срока

source: Enter the company name.
kk_kz: Введите название организации.

source: The company name cannot be a number.
kk_kz: Название организации не может быть числом.

source: Enter the company contact name.
kk_kz: Введите имя контактного лица в организации.

source: The company contact name cannot be a number.
kk_kz: Имя контактного лица в организации не может быть числом.

source: Enter the email address for the company contact.
kk_kz: Введите адрес электронной почты контактного лица организации.

source: Enter a valid email address.
kk_kz: Введите корректный электронный адрес.

source: Enter the recipient name.
kk_kz: Введите имя получателя.

source: The recipient name cannot be a number.
kk_kz: Имя получателя не может быть числом.

source: Enter the recipient email address.
kk_kz: Введите электронный адрес получателя.

source: Enter the billing address.
kk_kz: Введите адрес плательщика.

source: Enter the price per course seat.
kk_kz: Введите цену за место на курсе.

source: Enter a numeric value for the price per course seat. Do not include currency symbols.
kk_kz: Введите цену за место на курсе в виде числа. Не используйте символы денежных единиц.

source: Enter the number of enrollment codes.
kk_kz: Введите количество регистрационных кодов.

source: Enter a numeric value for the number of enrollment codes.
kk_kz: Введите количество регистрационных кодов в виде числа.

source: Select a currency.
kk_kz: Выберите валюту.

source: Enter a coupon code.
kk_kz: Введите код купона.

source: The discount percentage must be less than or equal to 100.
kk_kz: Размер скидки в процентах должен быть меньше или равен 100.

source: Enter a numeric value for the discount amount. Do not include the percent sign.
kk_kz: Введите сумму скидки в виде числа. Не используйте символ процентов.

source: Edit Coupon Code
kk_kz: Купон Кодын Өзгерту

source: Edit Coupon Code Information
kk_kz: Купон коды туралы ақпаратты өзгерту

source: example: A123DS
kk_kz: мысал:A123DS

source: Percentage Discount
kk_kz: Пайыздық жеңілдік

source: Update Coupon Code
kk_kz: Купон Кодын Жаңарту

source: Executive Summary for {display_name}
kk_kz: Сводный отчёт по курсу {display_name}

source: Report Creation Date
kk_kz: Дата создания отчёта

source: Number of Seats
kk_kz: Количество мест

source: Number of Enrollments
kk_kz: Количество регистраций

source: Gross Revenue Collected
kk_kz: Полученная валовая выручка

source: Gross Revenue Pending
kk_kz: Валовая выручка к получению

source: Number of Enrollment Refunds
kk_kz: Количество возвращённых регистрационных взносов

source: Amount Refunded
kk_kz: Сумма возвращённых средств

source: Average Price per Seat
kk_kz: Средняя цена за место

source: Frequently Used Coupon Codes
kk_kz: Часто используемые коды купонов на скидку

source: Number of seats purchased using coupon codes
kk_kz: Количество мест, приобретённых с использованием купонов на скидку

source: Rank
kk_kz: Категория

source: Percent Discount
kk_kz: Скидка в процентах

source: Times Used
kk_kz: Количество использований

source: Bulk and Single Seat Purchases
kk_kz: Покупка мест оптом и в розницу

source: Number of seats purchased individually
kk_kz: Количество мест, купленных в розницу

source: Number of seats purchased in bulk
kk_kz: Количество мест, купленных оптом

source: Number of seats purchased with invoices
kk_kz: Количество мест, приобретённых по счетам-фактурам

source: Unused bulk purchase seats (revenue at risk)
kk_kz: Неиспользованные места, купленные оптом (влияет на доход)

source: Percentage of seats purchased individually
kk_kz: Процент мест, купленных в розницу

source: Percentage of seats purchased in bulk
kk_kz: Процент мест, купленных оптом

source: Percentage of seats purchased with invoices
kk_kz: Доля мест, приобретённых по счетам-фактурам

source: Individual due date extensions
kk_kz: Тапсыру мерзімдерін жеке ұзарту

source: In this section, you have the ability to grant extensions on specific units to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
kk_kz: В этом разделе вы можете продлить сроки сдачи по конкретным заданиям для отдельных обучающихся. Пожалуйста, имейте в виду, что всегда применяется последняя указанная дата; вы не можете использовать этот метод для назначения более раннего срока сдачи задания.

source: Specify the {platform_name} email address or username of a student here:
kk_kz: Мұнда студенттің e-mail мекенжайын немесе пайдаланушы атын {platform_name} белгілеңіз:

source: Student Email or Username
kk_kz: Студенттің пайдаланушының e-mail немесе аты

source: Choose the graded unit:
kk_kz: Выбрать оцениваемый блок:

source: Specify the extension due date and time (in UTC; please specify {format_string}).
kk_kz: Жаңарту күні мен уақытын көрсетіңіз (UTC-де; {format_string} көрсетіңіз).

source: Change due date for student
kk_kz: Студент үшін мерзімді өзгерту

source: Viewing granted extensions
kk_kz: Мерзімдерді ұзартуды қарау
