Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible action: retry with another form of payment.
kk_kz: Срок действия карты истёк или указан неправильно. Вы можете использовать другой способ оплаты.

source: General decline of the card. No other information provided by the issuing bank. Possible action: retry with another form of payment.
kk_kz: Платёж был отклонён по неизвестной нам причине. Обратитесь к представителям банка, выпустившего карту. Вы также можете использовать другой способ оплаты.

source: Insufficient funds in the account. Possible action: retry with another form of payment.
kk_kz: На счету недостаточно средств. Вы можете использовать другой способ оплаты.

source: Stolen or lost card.
kk_kz: Украденная или утерянная карта.

source: Issuing bank unavailable. Possible action: retry again after a few minutes.
kk_kz: Банк-эмитент недоступен. Возможные действия: попробуйте ещё раз через несколько минут.

source: Inactive card or card not authorized for card-not-present transactions. Possible action: retry with another form of payment.
kk_kz: Карта заблокирована или не предназначена для онлайн-платежей. Вы можете использовать другой способ оплаты.

source: CVN did not match.
kk_kz: Несоответствующий номер CVN.

source: The card has reached the credit limit. Possible action: retry with another form of payment.
kk_kz: Кредитный лимит карты израсходован. Вы можете использовать другой способ оплаты.

source: Invalid card verification number (CVN). Possible action: retry with another form of payment.
kk_kz: Недействительный код проверки подлинности карты (CVN). Возможные действия: попробуйте оплатить другим способом.

source: The customer matched an entry on the processors negative file.
kk_kz: Клиент соотнёс запись с неправильным файлом

source: Account frozen. Possible action: retry with another form of payment.
kk_kz: Счёт заморожен. Вы можете использовать другой способ оплаты.

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the CVN check. Possible action: retry with another form of payment.
kk_kz: Запрос на авторизацию одобрен банком, выпустившим карту, но отклонён системой CyberSource, поскольку не удалось подтвердить номер CVN. Вы можете использовать другой способ оплаты.

source: Invalid account number. Possible action: retry with another form of payment.
kk_kz: Недействительный номер счёта. Вы можете использовать другой способ оплаты.

source: The card type is not accepted by the payment processor. Possible action: retry with another form of payment.
kk_kz: Платёжная система не принимает карты такого типа. Вы можете использовать другой способ оплаты.

source: General decline by the processor. Possible action: retry with another form of payment.
kk_kz: Платёж был отклонён. Вы можете использовать другой способ оплаты.

source: There is a problem with the information in your CyberSource account. Please let us know at {0}
kk_kz: Возникла проблема с информацией о вашей учетной записи в платёжной системе CyberSource. Пожалуйста, дайте нам знать {0}

source: The requested capture amount exceeds the originally authorized amount.
kk_kz: Запрошенная сумма превышает ту, которая была подтверждена.

source: Processor Failure. Possible action: retry the payment
kk_kz: Ошибка платёжного сервиса. Вы можете использовать другой способ оплаты.

source: The authorization has already been reversed.
kk_kz: Платёж уже отменён.

source: The authorization has already been captured.
kk_kz: Платёж уже принят.

source: The requested transaction amount must match the previous transaction amount.
kk_kz: Запрошенная сумма транзакции должна совпадать с прошлой суммой транзакции.

source: The card type sent is invalid or does not correlate with the credit card number. Possible action: retry with the same card or another form of payment.
kk_kz: Тип карты указан неверно или не соответствует номеру кредитной карты. Вы можете использовать другой способ оплаты.

source: The request ID is invalid.
kk_kz: Недействительный идентификатор запроса.

source: You requested a capture, but there is no corresponding, unused authorization record. Occurs if there was not a previously successful authorization request or if the previously successful authorization has already been used by another capture request.
kk_kz: Вы запросили сумму, однако авторизация платежа не была зафиксирована. Такое случается, если ранее при авторизации произошёл сбой, либо уже была подтверждена операция с другой суммой.

source: The transaction has already been settled or reversed.
kk_kz: Транзакция уже была проведена или обращена.

source: Either the capture or credit is not voidable because the capture or credit information has already been submitted to your processor, or you requested a void for a type of transaction that cannot be voided.
kk_kz: Платёж или кредит не может быть отменён, поскольку сумма уже отправлена в платёжный сервис, либо данный тип транзакции отменить невозможно.

source: You requested a credit for a capture that was previously voided.
kk_kz: Вы запросили кредит на сумму, транзакция которой была отменена ранее.

source: The request was received, but there was a timeout at the payment processor.
kk_kz: Запрос получен, но платёжный сервис не успел его обработать.

source: Stand-alone credits are not allowed.
kk_kz: Отдельные кредиты запрещены.

source: The cardholder is enrolled for payer authentication
kk_kz: Владелец карты зарегистрирован для аутентификации плательщика

source: Payer authentication could not be authenticated
kk_kz: Подлинность плательщика не подтверждена

source: The authorization request was approved by the issuing bank but declined by CyberSource based on your legacy Smart Authorization settings. Possible action: retry with a different form of payment.
kk_kz: Запрос на авторизацию одобрен банком, выпустившим карту, но отклонён системой CyberSource, поскольку ваши настройки смарт-авторизации устарели. Вы можете использовать другой способ оплаты.

source: Order Number
kk_kz: Тапсырыс нөмірі

source: Customer Name
kk_kz: Имя заказчика

source: Date of Original Transaction
kk_kz: Дата исходной операции

source: Date of Refund
kk_kz: Дата возврата денежных средств

source: Amount of Refund
kk_kz: Возвращённая сумма

source: Service Fees (if any)
kk_kz: Сервисные расходы (если есть)

source: Purchase Time
kk_kz: Время оплаты

source: Order ID
kk_kz: ID заказа

source: Unit Cost
kk_kz: Цена за единицу

source: Total Cost
kk_kz: Итоговая стоимость

source: Currency
kk_kz: Валюта

source: Comments
kk_kz: Ескерту

source: University
kk_kz: Организация

source: Course Announce Date
kk_kz: Дата объявления курса

source: Course Start Date
kk_kz: Дата начала курса

source: Course Registration Close Date
kk_kz: Дата окончания регистрации на курс

source: Course Registration Period
kk_kz: Срок регистрации на курс

source: Total Enrolled
kk_kz: Всего зачислено

source: Audit Enrollment
kk_kz: Слушателей на бесплатном курсе

source: Honor Code Enrollment
kk_kz: Зачисление на программу Кодекса чести

source: Verified Enrollment
kk_kz: Подтвержденная регистрация

source: Gross Revenue
kk_kz: Валовая выручка

source: Gross Revenue over the Minimum
kk_kz: Минимальная валовая выручка

source: Number of Verified Students Contributing More than the Minimum
kk_kz: Число подтверждённых слушателей, внёсших средств больше, чем минимум

source: Number of Refunds
kk_kz: Число возвратов денег

source: Dollars Refunded
kk_kz: Возвращённые средства, в долларах

source: Number of Transactions
kk_kz: Количество платёжных операций

source: Total Payments Collected
kk_kz: Итого принято платежей

source: Number of Successful Refunds
kk_kz: Число успешных возвратов денег

source: Total Amount of Refunds
kk_kz: Итого возвращено денежных средств

source: You must be logged-in to add to a shopping cart
kk_kz: Вы должны войти на сайт для того, чтобы добавлять курсы в корзину

source: The course you requested does not exist.
kk_kz: Запрошенного вами курса не существует.

source: The course {course_id} is already in your cart.
kk_kz: Курс {course_id} уже в корзине.

source: You are already registered in course {course_id}.
kk_kz: Вы уже зарегистрированы на курс {course_id}.

source: Course added to cart.
kk_kz: Курс добавлен в корзину.

source: Discount does not exist against code '{code}'.
kk_kz: Скидка для кода '{code}' не предусмотрена.

source: This enrollment code ({enrollment_code}) is no longer valid.
kk_kz: Регистрационный код ({enrollment_code}) уже недействителен.

source: This enrollment code ({enrollment_code}) is not valid.
kk_kz: Регистрационный код ({enrollment_code}) недействителен.

source: Code '{registration_code}' is not valid for any course in the shopping cart.
kk_kz: Код '{registration_code}' не применим ни к одному из курсов в корзине.

source: Cart item quantity should not be greater than 1 when applying activation code
kk_kz: Для активации кода количество единиц в корзине не должно превышать 1.

source: Only one coupon redemption is allowed against an order
kk_kz: Для одного заказа можно воспользоваться только одним талоном

source: success
kk_kz: сәтті

source: You do not have permission to view this page.
kk_kz: У вас нет разрешения на просмотр этой страницы.

source: View and regenerate certificates.
kk_kz: Сертификаттарды қарау және қайта құру.

source: Manual Refund
kk_kz: Возврат через оператора

source: Track refunds issued directly through CyberSource.
kk_kz: Отслеживание возмещений, выданных непосредственно через CyberSource.

source: Enrollment
kk_kz: Курсқа жазылу

source: View and update learner enrollments.
kk_kz: Оқушылардың жазбаларын қарау және жаңарту.

source: Manage User
kk_kz: Пайдаланушыны Басқару

source: Disable User Account
kk_kz: Пайдаланушының есептік жазбасын өшіру

source: Entitlements
kk_kz: Құқық

source: View, create, and reissue learner entitlements
kk_kz: Оқушылардың құқықтарын қарау, құру және қайта ресімдеу

source: Feature Based Enrollments
kk_kz: Функциялар негізінде тіркеу

source: View feature based enrollment settings
kk_kz: Функцияларға негізделген қабылдау параметрлерін қарау

source: Usable
kk_kz: Жарамды

source: Unusable
kk_kz: Жарамсыз

source: User Enabled Successfully
kk_kz: Пайдаланушы Сәтті Қосылды

source: User Disabled Successfully
kk_kz: Пайдаланушы Сәтті Өшірілді

source: Email Address
kk_kz: Электрондық пошта мекенжайы

source: Course ID
kk_kz: Курс идентификаторы

source: User not found
kk_kz: Пользователь не найден

source: Course {course_id} not past the refund window.
kk_kz: Возврат денежных средств по курсу «{course_id}» ещё возможен.

source: No order found for {user} in course {course_id}
kk_kz: Заказ пользователя {user} на курс {course_id} не найден

source: Unenrolled {user} from {course_id}
kk_kz: Пользователь {user} отчислен с курса {course_id}

source: Refunded {cost} for order id {order_id}
kk_kz: Возвращено {cost} за заказ № {order_id}

source: Optional language the team uses as ISO 639-1 code.
kk_kz: Команда ISO 639-1 коды ретінде қолданатын қосымша тіл.

source: Teams
kk_kz: Командалар

source: The supplied course id {course_id} is not valid.
kk_kz: Көрсетілген курс идентификаторы {course_id} жарамсыз

source: course_id must be provided
kk_kz: курс идентификаторы көрсетілуі керек

source: text_search and order_by cannot be provided together
kk_kz: Нельзя одновременно использовать параметры text_search и order_by

source: The supplied topic id {topic_id} is not valid
kk_kz: Көрсетілген тақырып идентификаторы {topic_id} жарамсыз

source: Error connecting to elasticsearch
kk_kz: Elasticsearch қызметіне қосылу қатесі

source: The ordering {ordering} is not supported
kk_kz: Тапсырыс {ordering} қолдау көрсетілмейді

source: The supplied course_id {course_id} is not valid.
kk_kz: Көрсетілген course_id {course_id} жарамсыз.

source: You are already in a team in this course.
kk_kz: Вы уже принадлежите к одной из команд на этом курсе.

source: username or team_id must be specified.
kk_kz: необходимо указать имя пользователя или team_id.

source: Username is required.
kk_kz: Пайдаланушы аты қажет.

source: Team id is required.
kk_kz: Команда идентификаторы қажет.

source: This team is already full.
kk_kz: Бұл команда қазірдің өзінде толы.

source: The user {username} is already a member of a team in this course.
kk_kz: Пользователь {username} уже является членом одной из команд курса.

source: The user {username} is not enrolled in the course associated with this team.
kk_kz: Пайдаланушы {username} осы пәрменмен байланысты курсқа жазылмаған.

source: The course for which this deadline applies
kk_kz: Осы мерзім қолданылатын курс

source: The datetime after which users are no longer allowed to submit photos for verification.
kk_kz: Күні мен уақыты, содан кейін пайдаланушыларға фотосуреттерді тексеруге жіберуге рұқсат етілмейді.

source: Your {platform_name} verification has expired.
kk_kz: {platform_name} тексеру мерзімі аяқталды.

source: Intro
kk_kz: Кіріспе

source: Make payment
kk_kz: Төлемді жасаңыз

source: Payment confirmation
kk_kz: Подтверждение платежа

source: Take photo
kk_kz: Суретті жасаңыз

source: Take a photo of your ID
kk_kz: Жеке куәлігіңізді суретке түсіріңіз

source: Review your info
kk_kz: Ақпаратты қарап шығыңыз

source: Enrollment confirmation
kk_kz: Тіркеуді растау

source: Selected price is not valid number.
kk_kz: Таңдалған баға дұрыс сан болып табылмайды.

source: This course doesn't support paid certificates
kk_kz: Бұл курс ақылы сертификаттарды қолдамайды

source: No selected price or selected price is below minimum.
kk_kz: Баға таңдалмаған немесе таңдалған баға ең аз рұқсат етілгеннен төмен.

source: Photo ID image is required if the user does not have an initial verification attempt.
kk_kz: Егер пайдаланушының алғашқы тексеру әрекеті болмаса, жеке куәліктің фотосуреті қажет.

source: Missing required parameter face_image
kk_kz: Face_image қажетті параметрі жоқ

source: Invalid course key
kk_kz: Курстың кілті дұрыс емес.

source: No profile found for user
kk_kz: Пайдаланушының профилі табылмады

source: Name must be at least {min_length} characters long.
kk_kz: Имя должно состоять не менее чем из {min_length} символов.

source: Image data is not valid.
kk_kz: Сурет деректері жарамсыз.

source: Your {platform_name} Verification Has Been Denied
kk_kz: Сіздің тексеруіңіз {platform_name} қабылданбады

source: Please correct the errors below.
kk_kz: Төмендегі қателерді түзетіңіз.

source: Are you sure you want to cancel retirement for user "%(username)s"?
kk_kz: Сіз пайдаланушы "%(username)s" үшін зейнетке шығуды тоқтатқыңыз келетініне сенімдісіз бе?

source: Welcome to %(course_name)s
kk_kz: %(course_name)s қош келдіңіз

source: To get started, please visit https://%(site_name)s.
kk_kz: Бастау үшін, https://%(site_name)s сайтына кіріңіз

source: The login information for your account follows:
kk_kz: Төменде есептік жазбаңызға кіру туралы ақпарат берілген:

source: email: %(email_address)s
kk_kz: электрондық пошта:%(email_address)s

source: password: %(password)s
kk_kz: құпиясөз: %(password)s

source: It is recommended that you change your password.
kk_kz: Құпия сөзді өзгерту ұсынылады.

source: Sincerely yours, The %(course_name)s Team
kk_kz: Шын жүректен, %(course_name)s Командасы

source: Welcome to %(course_name)s
kk_kz: %(course_name)s қош келдіңіз

source: To get started, please visit https://%(site_name)s. The login information for your account follows.
kk_kz: Жұмысты бастау үшін https://%(site_name)s сайтына кіріңіз. Төменде есептік жазбаңызға кіру туралы ақпарат берілген.

source: You have been enrolled in %(course_name)s
kk_kz: Сіз %(course_name)s тіркелдіңіз

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s
kk_kz: Сізді %(course_name)s үшін %(site_name)sбета-тестер болуға шақырды

source: The invitation has been sent by a member of the course staff.
kk_kz: Шақыруды курс қызметкері жіберді.

source: To start accessing course materials, please visit:
kk_kz: Курс материалдарына қол жеткізуді бастау үшін мына сайтқа кіріңіз:

source: To enroll in this course and begin the beta test:
kk_kz: Осы курсқа жазылу және бета-тестілеуді бастау:

source: Visit %(course_name)s
kk_kz: %(course_name)s кіріңіз

source: This email was automatically sent from %(site_name)s to %(email_address)s
kk_kz: %(site_name)s -дан %(email_address)s-ға бұл электрондық пошта автоматты түрде жіберілді

source: Dear %(full_name)s
kk_kz: Құрметті %(full_name)s

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
kk_kz: %(course_name)s Курстың бір қызметкері сізді%(site_name)s бета-тестері болуға шақырды.

source: To start accessing course materials, please visit %(course_url)s
kk_kz: Курс материалдарына қол жеткізуді бастау үшін мына сайтқа кіріңіз%(course_url)s

source: Visit %(course_about_url)s to enroll in this course and begin the beta test.
kk_kz: Осы курсқа жазылу және бета-тестілеуді бастау үшін сайтқа кіріңіз.%(course_about_url)s

source: Visit %(site_name)s to enroll in this course and begin the beta test.
kk_kz: Осы курсқа жазылу және бета-тестілеуді бастау үшін сайтқа кіріңіз.%(site_name)s

source: You have been invited to a beta test for %(course_name)s
kk_kz: Сізді %(course_name)sбета-тестілеуге шақырды

source: You have been invited to %(course_name)s
kk_kz: Сізді%(course_name)sшақырды

source: You have been invited to join %(course_name)s at %(site_name)s by a member of the course staff.
kk_kz: Сізді курс қызметкерлерінің бірі бізге%(site_name)s қосылуға %(course_name)sшақырды.

source: To access this course click on the button below and login:
kk_kz: Бұл курсқа кіру үшін төмендегі батырманы басып, жүйеге кіріңіз:

source: To access this course visit it and register:
kk_kz: Бұл курсқа кіру үшін оған кіріп, тіркеліңіз:

source: Please finish your registration and fill out the registration form making sure to use %(email_address)s in the Email field:
kk_kz: Тіркеуді аяқтаңыз және тіркеу формасын толтырыңыз, оны электрондық пошта өрісінде %(email_address)sкөрсетіңіз:

source: Finish Your Registration
kk_kz: Тіркеуді Аяқтаңыз

source: Once you have registered and activated your account, you will see %(course_name)s listed on your dashboard.
kk_kz: Есептік жазбаны тіркеп, іске қосқаннан кейін сіз %(course_name)s бақылау тақтасындағы тізімнен көресіз.

source: Once you have registered and activated your account, you will be able to access this course:
kk_kz: Есептік жазбаны тіркеп, іске қосқаннан кейін сіз осы курсқа кіре аласыз:

source: You can then enroll in %(course_name)s.
kk_kz: Содан кейін сіз %(course_name)sтіркеле аласыз

source: Dear student,
kk_kz: Уважаемый слушатель!

source: To access this course visit %(course_url)s and login.
kk_kz: Бұл курсқа кіру үшін %(course_url)sкіріңіз.

source: To access this course visit %(course_about_url)s and register for this course.
kk_kz: Бұл курсқа кіру үшін %(course_about_url)s кіріп, сол курсқа тіркеліңіз.

source: To finish your registration, please visit %(registration_url)s and fill out the registration form making sure to use %(email_address)s in the Email field.
kk_kz: Тіркеуді аяқтау үшін электрондық пошта өрісіне%(email_address)s міндетті түрде кіріп, тіркеу формасын %(registration_url)sтолтырыңыз.

source: Once you have registered and activated your account, visit %(course_about_url)s to join this course.
kk_kz: Есептік жазбаңызды тіркеп, іске қосқаннан кейін курсқа қосылу үшін %(course_about_url)s кіріңіз.

source: You have been invited to register for %(course_name)s
kk_kz: Сізге%(course_name)s тіркелу ұсынылды

source: You have been unenrolled from %(course_name)s
kk_kz: Сіз %(course_name)sтіркеуден шықтыңыз

source: You have been unenrolled from the course %(course_name)s by a member of the course staff. Please disregard the invitation previously sent.
kk_kz: Сіз курс қызметкерлерінің бірімен %(course_name)sкурсқа қабылданбадыңыз. Бұрын жіберілген шақыруға назар аудармаңыз.

source: Dear Student,
kk_kz: Уважаемый слушатель!

source: You have been unenrolled from %(course_name)s
kk_kz: Сіз %(course_name)s тіркеуден шықтыңыз

source: You have been unenrolled from %(course_name)s at %(site_name)s by a member of the course staff. This course will no longer appear on your %(site_name)s dashboard.
kk_kz: Сіз %(course_name)s-дан %(site_name)s курс қызметкерімен тіркеуден шықтыңыз. Бұл курс енді сіздің %(site_name)sбақылау тақтасында көрсетілмейді.

source: Your other courses have not been affected.
kk_kz: Бұл Сіздің қалған курстарыңызға әсер етпейді.

source: This email was automatically sent from %(site_name)s to %(full_name)s
kk_kz: Бұл электрондық пошта %(site_name)s -дан %(full_name)s-ға автоматты түрде жіберілді

source: You have been enrolled in %(course_name)s
kk_kz: Сіз %(course_name)s тіркелдіңіз

source: You have been enrolled in %(course_name)s at %(site_name)s by a member of the course staff. This course will now appear on your %(site_name)s dashboard.
kk_kz: Сізді %(course_name)sкурсына курс қызметкерлерінің бірі %(site_name)sқабылдады. Енді бұл курс %(site_name)sбақылау тақтасында пайда болады.

source: Access the Course Materials Now
kk_kz: Курс материалдарына дәл қазір қол жеткізіңіз

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s
kk_kz: Сіз %(course_name)s курсына бета-тестер ретінде %(site_name)s жойылдыңыз

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
kk_kz: Сіз курс қызметкерлерінің бірі %(course_name)s курсы үшін бета-тестер ретінде %(site_name)sжойылдыңыз.

source: This course will remain on your dashboard, but you will no longer be part of the beta testing group.
kk_kz: Бұл курс сіздің бақылау тақтасында қалады, бірақ сіз енді бета-топқа кірмейсіз.

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff. This course will remain on your dashboard, but you will no longer be part of the beta testing group.
kk_kz: Сіз курс қызметкерлерінің бірі арқылы %(course_name)s курсы үшін бета-тестер ретінде %(site_name)s жойылдыңыз. Бұл курс сіздің бақылау тақтасында қалады, бірақ сіз енді бета-топқа кірмейсіз.

source: You have been removed from a beta test for %(course_name)s
kk_kz: Сіз %(course_name)sбета-тесттен шығарылдыңыз

source: Signed Out
kk_kz: Жүйеден Шықты

source: You have signed out.
kk_kz: Сіз жүйеден шықтыңыз.

source: Skip to main content
kk_kz: Негізгі мазмұнға өту

source: Authorize
kk_kz: Авторизациялау

source: The above application requests the following permissions from your account:
kk_kz: Жоғарыда аталған бағдарлама сіздің есептік жазбаңыздан келесі рұқсаттарды сұрайды:

source: These permissions will be granted for data from your courses associated with the following content providers:
kk_kz: Бұл рұқсаттар келесі мазмұн провайдерлерімен байланысты курстарыңыздағы мәліметтер үшін беріледі:

source: Please click the 'Allow' button to grant these permissions to the above application. Otherwise, to withhold these permissions, please click the 'Cancel' button.
kk_kz: Жоғарыда аталған бағдарламаға осы рұқсаттарды беру үшін "рұқсат беру" түймесін басыңыз. Әйтпесе, осы рұқсаттардан бас тарту үшін "Болдырмау"түймесін басыңыз.

source: Cancel
kk_kz: Отмена

source: Allow
kk_kz: Мүмкіндік беруі

source: Error
kk_kz: Қателік

source: Last modified:
kk_kz: Соңғы өзгерістер:

source: See all children
kk_kz: Барлық ұрпақтарын қарау

source: This article was last modified:
kk_kz: Осы бап соңғы рет редакцияланды:

source: Add new article
kk_kz: Жаңа бапты қосу

source: Create article
kk_kz: Бапты құру

source: Go back
kk_kz: Кері қарай

source: Delete article
kk_kz: Бапты жою
