Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
kk_kz: Нашли ошибку? Нет проблем. Изменения, внесённые вами, вступят в силу, когда вы этого захотите, при нажатии на кнопку «Сохранить».

source: Release-On Date Publishing
kk_kz: Дата начала и публикации

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
kk_kz: Закончив создание {strong_start}раздела{strong_end}, установите время, с которого он будет доступен пользователям, а {studio_name} сделает всё остальное. Создавайте свой курс постепенно.

source: Work in Teams
kk_kz: Работа в команде

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
kk_kz: Соавторы имеют полный доступ ко всем инструментам разработки. Сделайте ваш курс лучше коллективными усилиями.

source: Sign Up for {studio_name} Today!
kk_kz: Зарегистрируйтесь в {studio_name} сегодня!

source: Sign Up & Start Making Your {platform_name} Course
kk_kz: Зарегистрироваться и начать создание курса на {platform_name}

source: Already have a {studio_name} Account? Sign In
kk_kz: Уже зарегистрированы в {studio_name}? Войдите

source: Outlining Your Course
kk_kz: Структура вашего курса

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
kk_kz: Простая двухуровневая структура организации курса. Перетаскивайте элементы, чтобы составить план курса.

source: More than Just Lectures
kk_kz: Больше, чем просто лекции

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
kk_kz: Быстрое создание видео, текстовых фрагментов, встроенных обсуждений и задач различных типов.

source: Publishing on Date
kk_kz: Дата публикации

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
kk_kz: Установите дату выпуска для раздела или подраздела, и {studio_name} вовремя откроет доступ для ваших слушателей.

source: We're having trouble rendering your component
kk_kz: Имеются проблемы при отображении вашего компонента

source: Students will not be able to access this component. Re-edit your component to fix the error.
kk_kz: Компонент не будет доступен слушателям. Отредактируйте компонент снова, чтобы исправить ошибку.

source: Library Import
kk_kz: Импорт библиотеки

source: Course Import
kk_kz: Импорт курса

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
kk_kz: Прежде чем продолжить, убедитесь, что вы хотите импортировать библиотеку. Импортированное содержимое полностью заменит собой материалы данной библиотеки. {em_start}Вы не сможете отменить импорт библиотеки{em_end}. Мы рекомендуем сначала экспортировать текущую библиотеку, чтобы у вас сохранилась её резервная копия.

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
kk_kz: Библиотека, которую вы импортируете, должна быть в формате .tar.gz (т. е. файл с расширением .tar, сжатый с помощью программы GNU Zip). Файл .tar.gz должен содержать файл library.xml. Он также может содержать и другие файлы.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
kk_kz: Процесс импорта состоит из пяти стадий. В течение первых двух вы должны оставаться на этой странице. Вы можете покинуть страницу после завершения стадии распаковки. Мы рекомендуем вам не делать важных изменений в библиотеке, пока импорт не будет завершён.

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
kk_kz: Прежде чем продолжить, убедитесь, что вы хотите именно импортировать курс. Импортированное содержимое полностью заменит собой материалы данного курса. {em_start}Вы не сможете отменить импорт курса{em_end}. Мы рекомендуем сначала экспортировать текущий курс, чтобы у вас сохранилась его резервная копия.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
kk_kz: Курс, который вы импортируете, должен быть в формате .tar.gz (т. е. файл с расширением .tar, сжатый с помощью программы GNU Zip). Файл .tar.gz должен содержать файл course.xml. Он также может содержать и другие файлы.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
kk_kz: Процесс импорта состоит из пяти стадий. В течение первых двух вы должны оставаться на этой странице. Вы можете покинуть страницу после завершения стадии распаковки. Мы рекомендуем вам не делать важных изменений в курсе, пока импорт не будет завершён.

source: Select a .tar.gz File to Replace Your Library Content
kk_kz: Выберите файл .tar.gz, чтобы заменить содержимое вашей библиотеки

source: Select a .tar.gz File to Replace Your Course Content
kk_kz: Выберите файл .tar.gz, чтобы заменить содержимое вашего курса

source: Choose a File to Import
kk_kz: Выберите файл для импортирования

source: File Chosen:
kk_kz: Выбранный файл:

source: Replace my library with the selected file
kk_kz: Заменить мою библиотеку выбранным файлом

source: Replace my course with the selected file
kk_kz: Заменить мой курс выбранным файлом

source: Library Import Status
kk_kz: Статус импорта библиотеки

source: Course Import Status
kk_kz: Статус импорта курса

source: Transferring your file to our servers
kk_kz: Передача вашего файла на наши сервера

source: Unpacking
kk_kz: Распаковка

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
kk_kz: Расширение и подготовка структуры папок/файлов (теперь вы можете безопасно покинуть эту страницу, но старайтесь не делать существенных изменений в контенте до тех пор, пока импорт не будет завершён)

source: Verifying
kk_kz: Подтверждение

source: Reviewing semantics, syntax, and required data
kk_kz: Проверка семантики, синтаксиса и необходимых данных

source: Updating Library
kk_kz: Обновление библиотеки

source: Updating Course
kk_kz: Обновление курса

source: Integrating your imported content into this library. This process might take longer with larger libraries.
kk_kz: Происходит добавление импортированных вами материалов в библиотеку. Это может занять продолжительное время для больших библиотек.

source: Integrating your imported content into this course. This process might take longer with larger courses.
kk_kz: Происходит добавление импортированных вами материалов в курс. Это может занять продолжительное время для больших курсов.

source: Your imported content has now been integrated into this library
kk_kz: Загруженный вами контент теперь интегрирован в этот курс

source: Your imported content has now been integrated into this course
kk_kz: Загруженный вами контент теперь интегрирован в этот курс

source: View Updated Library
kk_kz: Показать обновлённую библиотеку

source: View Updated Outline
kk_kz: показать обновлённый вид

source: Why import a library?
kk_kz: Зачем импортировать библиотеки?

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
kk_kz: Вам может потребоваться обновление библиотеки до новой версии или полная замена существующей. Вы также можете разработать библиотеку вне {studio_name}.

source: Note: Library content is not automatically updated in courses
kk_kz: Внимание: содержимое библиотеки в курсах не обновляется автоматически

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
kk_kz: Если изменить и импортировать библиотеку, на которую ссылается блок со случайным выбором заданий в одном или нескольких курсах, то эти курсы не смогут автоматически использовать обновлённое содержимое. Вы должны вручную обновить блоки со случайным выбором заданий, чтобы привести их содержимое в соответствие с обновлённым содержимым библиотеки.

source: Learn more about importing a library
kk_kz: Доп. информация об импорте библиотек

source: Why import a course?
kk_kz: Зачем импортировать курс?

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
kk_kz: Вы, возможно, хотите запустить новую версию существующего курса или заменить существующий курс. Или, вы возможно уже разработали новый курс вне {studio_name}.

source: What content is imported?
kk_kz: Какие элементы курса подлежат импорту?

source: Warning: Importing while a course is running
kk_kz: Внимание: импортирование во время запуска курса

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
kk_kz: Если вы начнёте импорт, когда курс запущен, и измените URL (или url_name) любого из заданий, то могут быть потеряны оценки слушателей курса.

source: Learn more about importing a course
kk_kz: Доп. информация об импорте курсов

source: {studio_name} Home
kk_kz: Главная страница {studio_name}

source: New Course
kk_kz: Новый курс

source: Email staff to create course
kk_kz: Отправьте электронное письмо сотрудникам для создания курса

source: New Library
kk_kz: Новая библиотека

source: Please correct the highlighted fields below.
kk_kz: Пожалуйста, исправьте отмеченные ниже поля.

source: Create a New Course
kk_kz: Создайте новый курс

source: Required Information to Create a New Course
kk_kz: Требуемая информация для создания нового курса

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
kk_kz: Название курса, которое будет доступно пользователям. Это название нельзя будет изменить, однако позже вы сможете указать альтернативное отображаемое название в расширенных настройках.

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
kk_kz: Название организации, финансирующей курс. {strong_start}Примечание: название организации – это часть URL курса.{strong_end}. Это название нельзя будет изменить, однако позже вы сможете указать альтернативное отображаемое название в расширенных настройках.

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
kk_kz: Уникальный идентификационный номер курса, присвоенный ему вашей организацией. {strong_start}Примечание: это часть URL вашего курса, здесь не разрешается использовать пробелы и специальные символы; её нельзя будет изменить позже.{strong_end}

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
kk_kz: Семестр, в котором будет проходить ваш курс. {strong_start}Примечание: это часть URL вашего курса, здесь не разрешается использовать пробелы и специальные символы; её нельзя будет изменить позже.{strong_end}

source: Create
kk_kz: Создать

source: Create a New Library
kk_kz: Создать новую библиотеку

source: Required Information to Create a New Library
kk_kz: Требуемая информация для создания новой библиотеки

source: Library Name
kk_kz: Название библиотеки

source: e.g. Computer Science Problems
kk_kz: например, «Задания по информатике»

source: The public display name for your library.
kk_kz: Общедоступное отображаемое название вашей библиотеки.

source: The public organization name for your library.
kk_kz: Общедоступное наименование организации для вашей библиотеки.

source: This cannot be changed.
kk_kz: Его нельзя будет изменить.

source: Library Code
kk_kz: Код библиотеки

source: e.g. CSPROB
kk_kz: например, ZpoINF

source: The unique code that identifies this library. {strong_start}Note: This is part of your library URL, so no spaces or special characters are allowed.{strong_end} This cannot be changed.
kk_kz: Уникальный идентификационный код библиотеки. {strong_start}Примечание: это часть URL вашей библиотеки, поэтому не разрешается использовать пробелы и специальные символы.{strong_end} Код нельзя будет изменить впоследствии.

source: Organization and Library Settings
kk_kz: Организации и библиотеки

source: Show all courses in organization:
kk_kz: Показать все курсы организации:

source: For example, MITx
kk_kz: Например, MITx

source: Courses Being Processed
kk_kz: Курс обработан

source: This course run is currently being created.
kk_kz: Курс перезапускается.

source: Configuring as re-run
kk_kz: Настройка перезапуска

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
kk_kz: Новый курс будет добавлен в список ваших курсов через 5-10 минут. Вернитесь на эту страницу или {link_start}перезагрузите её{link_end}, чтобы обновить список курсов. Настройки нового курса необходимо будет сделать вручную.

source: This re-run processing status:
kk_kz: Статус процесса перезапуска:

source: Configuration Error
kk_kz: Ошибка конфигурации

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
kk_kz: Во время обработки вашего курса в системе произошла ошибка. Пожалуйста, запустите процесс обработки ещё раз или свяжитесь со службой технической поддержки.

source: Libraries
kk_kz: Библиотеки

source: Are you staff on an existing {studio_name} course?
kk_kz: Работаете ли вы над каким-либо существующим {studio_name} курсом?

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
kk_kz: Создатель курса должен предоставить вам доступ. Свяжитесь с автором или администратором курса.

source: Create Your First Course
kk_kz: Создайте ваш первый курс

source: Your new course is just a click away!
kk_kz: Ваш новый курс всего в клике от вас!

source: Becoming a Course Creator in {studio_name}
kk_kz: Стать автором курса в {studio_name}

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
kk_kz: {studio_name} – онлайн-продукт для наших партнёров по xConsortium и избранных гостей. Вам доступны для редактирования те курсы, членом команды которых вы являетесь, их список можно посмотреть над этим сообщением. Право на создание курсов предоставляется платформой «{platform_name}» в частном порядке. Наша команда рассмотрит ваш запрос и ответит вам в течение 24 часов в течение рабочей недели.

source: Your Course Creator Request Status:
kk_kz: Статус запроса на (со)авторство курса:

source: Request the Ability to Create Courses
kk_kz: Запрос возможности создания курса

source: Your Course Creator Request Status
kk_kz: Статус вашей заявки на авторство курса

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
kk_kz: {studio_name} – онлайн-продукт для наших партнёров по xConsortium и избранных гостей. Вам доступны для редактирования те курсы, членом команды которых вы являетесь, их список можно посмотреть над этим сообщением. Право на создание курсов предоставляется {platform_name} в частном порядке. Наша команда закончила рассмотрение вашего запроса.

source: Your Course Creator request is:
kk_kz: Ваш запрос на авторство курса:

source: Your request did not meet the criteria/guidelines specified by {platform_name} Staff.
kk_kz: Ваш запрос не соответствует критериям/правилам, установленным сотрудниками {platform_name}.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
kk_kz: {studio_name} – онлайн-продукт для наших партнёров по xConsortium и избранных гостей. Вам доступны для редактирования те курсы, членом команды которых вы являетесь, их список можно посмотреть над этим сообщением. Право на создание курсов предоставляется {platform_name} в частном порядке. Наша команда в данный момент рассматривает ваш запрос.

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
kk_kz: Ваш запрос рассматривается сотрудниками {platform_name}; вскоре его статус будет обновлён.

source: Were you expecting to see a particular library here?
kk_kz: Вы ожидали увидеть здесь конкретную библиотеку?

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
kk_kz: Создатель библиотеки должен предоставить вам доступ. Свяжитесь с автором или администратором библиотеки.

source: Create Your First Library
kk_kz: Создайте вашу первую библиотеку

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
kk_kz: Библиотеки содержат компоненты, которые можно повторно использовать на нескольких курсах. Создайте вашу первую библиотеку одним нажатием кнопки!

source: New to {studio_name}?
kk_kz: Впервые в {studio_name}?

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
kk_kz: Нажмите на кнопку «Помощь» в правом верхнем углу экрана, чтобы получить дополнительную информацию о текущей странице в {studio_name}. Вы также можете использовать ссылки в нижней части страницы для просмотра нашей постоянно обновляемой документации и других ресурсов {studio_name}.

source: Getting Started with {studio_name}
kk_kz: Как начать работу в {studio_name}

source: Can I create courses in {studio_name}?
kk_kz: Могу ли я создавать курсы в {studio_name}?

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
kk_kz: Для создания курсов в {studio_name} вам необходимо {link_start}связаться с сотрудниками платформы «{platform_name}», которые помогут вам в этом{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
kk_kz: Для создания курсов в {studio_name} вам необходимо обладать правом создания курсов.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
kk_kz: Вам было отказано в {studio_name} создании курса. Пожалуйста, {link_start}свяжитесь с {platform_name} технической службой для дальнейшего процесса{link_end}.

source: Thanks for signing up, {name}!
kk_kz: Спасибо, что зарегистрировались, {name}!

source: We need to verify your email address
kk_kz: Необходимо подтвердить ваш адрес электронной почты

source: Almost there! In order to complete your sign up we need you to verify your email address ({email}). An activation message and next steps should be waiting for you there.
kk_kz: Вы почти у цели! Для завершения регистрации подтвердите свой электронный адрес ({email}). Письмо с инструкциями по активации уже отправлено.

source: Need help?
kk_kz: Нужна помощь?

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
kk_kz: Пожалуйста, проверьте папку «Спам», если нашего письма нет в ваших «Входящих». Всё ещё не получается найти письмо? Попросите помощи, пройдя по ссылке ниже.

source: Content Library
kk_kz: Содержимое библиотеки

source: Add Component
kk_kz: Добавить компонент

source: Adding content to your library
kk_kz: Добавление содержимого к библиотеке

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
kk_kz: Добавьте компоненты в библиотеку для использования в курсах с помощью кнопки «Добавить новый компонент» в нижней части этой страницы.

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
kk_kz: Компоненты перечислены в том порядке, в котором они были добавлены. Используйте стрелки, чтобы перемещаться по страницам, если их более одной в вашей библиотеке.

source: Using library content in courses
kk_kz: Использование содержимого библиотеки в курсах

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
kk_kz: Включите использование библиотек материалов в курсах, добавив значение {em_start}library_content{em_end} в настройку «Список дополнительных модулей» в расширенных настройках курса, затем добавьте компонент «Случайный выбор заданий» в ваш курс. В настройках для каждого такого компонента выберите эту библиотеку в качестве источника и укажите количество заданий, которые должны быть случайным образом выбраны для каждого слушателя.

source: Learn more about content libraries
kk_kz: Доп. информация о библиотеках материалов

source: Course Team Settings
kk_kz: Настройки команды курса

source: New Team Member
kk_kz: Новый член команды

source: Add a User to Your Course's Team
kk_kz: Добавить пользователя в команду вашего курса
