Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: {platform_name} now offers financial assistance for learners who want to earn Verified Certificates but who may not be able to pay the Verified Certificate fee. Eligible learners may receive up to 90{percent_sign} off the Verified Certificate fee for a course. To apply for financial assistance, enroll in the audit track for a course that offers Verified Certificates, and then complete this application. Note that you must complete a separate application for each course you take. We plan to use this information to evaluate your application for financial assistance and to further develop our financial assistance program.
kk_kz: {platform_name} енді расталған сертификаттарды алғысы келетін, бірақ расталған сертификат үшін ақы төлей алмайтын студенттерге қаржылық көмек ұсынады. Қатысуға құқығы бар Студенттер курс үшін расталған сертификаттың құнынан 90{percent_sign} дейін ала алады. Қаржылық көмекке жүгіну үшін тексерілген сертификаттарды ұсынатын аудит курсына жазылыңыз, содан кейін осы өтінішті толтырыңыз. Сіз өткен әр курс үшін жеке өтініш толтыруыңыз керек екенін ескеріңіз. Біз бұл ақпаратты сіздің қаржылық көмекке өтінішіңізді бағалау және біздің қаржылық көмек бағдарламамызды одан әрі дамыту үшін пайдалануды жоспарлап отырмыз.

source: Annual Household Income
kk_kz: Үй Шаруашылығының Жылдық Табысы

source: Tell us about your current financial situation. Why do you need assistance?
kk_kz: Ағымдағы қаржылық жағдайыңыз туралы айтып беріңіз. Неліктен сізге көмек керек?

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
kk_kz: Оқу немесе кәсіби мақсаттарыңыз туралы айтып беріңіз. Осы курста расталған сертификат сізге осы мақсаттарға жетуге қалай көмектеседі?

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
kk_kz: Осы курсқа арналған жоспарларыңыз туралы айтып беріңіз. Курстық жұмысты аяқтауға және сертификат алуға көмектесу үшін қандай қадамдар жасайсыз?

source: Use between 250 and 500 words or so in your response.
kk_kz: Используйте примерно 250-500 слов для ответа.

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
kk_kz: Расталған сертификат алғыңыз келетін курсты таңдаңыз. Егер курс тізімде көрсетілмесе, курстың бақылау жолына жазылғаныңызға көз жеткізіңіз.

source: Specify your annual household income in US Dollars.
kk_kz: Укажите ваш семейный годовой доход в долларах США

source: I allow edX to use the information provided in this application (except for financial information) for edX marketing purposes.
kk_kz: Я разрешаю edX использовать информацию, предоставленную в данном заявлении (за исключением финансовой информации) в своих маркетинговых целях.

source: Path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_DIR
kk_kz: Маршрута {0} не существует. Пожалуйста, создайте его или укажите другой другой путь при помощи GIT_REPO_DIR

source: Non usable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
kk_kz: Предоставлена ссылка, которую невозможно использовать. Нужна ссылка типа: git@github.com:mitocw/edx4edx_lite.git

source: Unable to get git log
kk_kz: Невозможно получить протокол работы git

source: git clone or pull failed!
kk_kz: Команды «git clone» или «pull» завершились неудачно!

source: Unable to run import command.
kk_kz: Не удалось выполнить команду импорта.

source: The underlying module store does not support import.
kk_kz: Хранилище, поддерживающее модуль, не поддерживает импортирование.

source: The specified remote branch is not available.
kk_kz: Указанная удалённая ветка недоступна.

source: Unable to switch to specified branch. Please check your branch name.
kk_kz: Невозможно переключиться на указанный узел. Пожалуйста, проверьте имя вашего узла.

source: Import the specified git repository and optional branch into the modulestore and optionally specified directory.
kk_kz: Импортировать указанный git-репозиторий и, если задано, ветку в хранилище модулей и, если задано, указанный раздел.

source: Failed in authenticating {username}, error {error}
kk_kz: Не удалось пройти контроль доступа {username}, ошибка {error}

source: Failed in authenticating {username}
kk_kz: Не удалось пройти контроль доступа {username}

source: fixed password
kk_kz: пароль скорректирован

source: All ok!
kk_kz: Всё верно!

source: Must provide username
kk_kz: Необходимо указать имя пользователя

source: Must provide full name
kk_kz: Необходимо указать полное имя

source: Email address must end in {domain}
kk_kz: Электронный адрес должен заканчиваться на {domain}

source: Failed - email {email_addr} already exists as {external_id}
kk_kz: Ошибка – электронный адрес {email_addr} уже использован в качестве {external_id}

source: Password must be supplied if not using certificates
kk_kz: При отсутствии сертификатов должен быть введён пароль

source: email address required (not username)
kk_kz: необходимо указать электронный адрес (не имя пользователя)

source: Oops, failed to create user {user}, {error}
kk_kz: Не удалось создать пользователя {user}, {error}

source: User {user} created successfully!
kk_kz: Пользователь {user} успешно создан!

source: Cannot find user with email address {email_addr}
kk_kz: Не удалось найти пользователя с электронным адресом {email_addr}

source: Cannot find user with username {username} - {error}
kk_kz: Не удалось найти пользователя с именем пользователя {username} – {error}

source: Deleted user {username}
kk_kz: Пользователь {username} удалён

source: Statistic
kk_kz: Статистический

source: Value
kk_kz: Значение

source: Site statistics
kk_kz: Статистика сайта

source: Total number of users
kk_kz: Общее количество пользователей

source: Courses loaded in the modulestore
kk_kz: Учебные курсы загружены в хранилище модулей

source: username
kk_kz: пайдаланушының аты

source: Repair Results
kk_kz: Исправить ошибки в результатах

source: Create User Results
kk_kz: Создать результаты пользователя

source: Delete User Results
kk_kz: Результат удаления пользователя

source: The git repo location should end with '.git', and be a valid url
kk_kz: Адрес репозитория git должен иметь окончание '.git', и быть достоверым url

source: Added Course
kk_kz: Добавлен Курс

source: Course Name
kk_kz: Курстың аты

source: Directory/ID
kk_kz: Каталог/Идентификатор

source: Git Commit
kk_kz: Запись в Git

source: Last Change
kk_kz: Последнее Изменение

source: Last Editor
kk_kz: Последний Редактор

source: Information about all courses
kk_kz: Информация обо всех курсах

source: Error - cannot get course with ID {0}<br/><pre>{1}</pre>
kk_kz: Ошибка - не удалось открыть курс с идентификатором {0}<br/><pre>{1}</pre>

source: Deleted
kk_kz: Жойылды

source: # enrolled
kk_kz: # зачисленных слушателей

source: # staff
kk_kz: # сотрудников

source: instructors
kk_kz: оқытушылар

source: Enrollment information for all courses
kk_kz: Информация о регистрации на всех курсах

source: role
kk_kz: роль

source: %(comment_username)s replied to <b>%(thread_title)s</b>:
kk_kz: %(comment_username)s жауап берді <b>%(thread_title)s</b>:

source: View discussion
kk_kz: Тақырыпты қарау

source: Response to %(thread_title)s
kk_kz: %(thread_title)s -қа жауап

source: Title can't be empty
kk_kz: Тақырып бос бола алмайды

source: Body can't be empty
kk_kz: Негізгі бөлік бос бола алмайды

source: Topic doesn't exist
kk_kz: Тақырып жоқ

source: Comment level too deep
kk_kz: Түсініктемелер деңгейі өте терең

source: Error uploading file. Please contact the site administrator. Thank you.
kk_kz: Файлды жүктеу қатесі. Сайттың әкімшісімен байнысыңыз. Рахмет.

source: Good
kk_kz: Жақсы

source: EdxNotes Service is unavailable. Please try again in a few minutes.
kk_kz: EdxNotes қызметі қол жетімді емес. Бірнеше минуттан кейін қайталап көріңіз.

source: Invalid JSON response received from notes api.
kk_kz: Notes api-ден алынған JSON жауабы дұрыс емес.

source: Incorrect data received from notes api.
kk_kz: Notes api-ден алынған деректер дұрыс емес.

source: No endpoint was provided for EdxNotes.
kk_kz: EDX сілтемелері үшін соңғы нүкте көрсетілмеген.

source: Notes
kk_kz: Белгілеулер

source: API key for accessing Sailthru.
kk_kz: Ключ ИПП для доступа к Sailthru.

source: API secret for accessing Sailthru.
kk_kz: Секрет ИПП для доступа к Sailthru.

source: Sailthru list name to add new users to.
kk_kz: Наименование списка в Sailthru, к которому будут добавлены новые пользователи.

source: Sailthru connection retry interval (secs).
kk_kz: Интервал между попытками соединения с Sailthru (секунд).

source: Sailthru maximum retries.
kk_kz: Sailthru: максимальное количество повторных попыток.

source: Sailthru template to use on welcome send.
kk_kz: Шаблон Salithru для приветственного сообщения.

source: Sailthru template to use on abandoned cart reminder. Deprecated.
kk_kz: Шаблон Salithru для использования при напоминании о неоформленных покупках в корзине. Устарело, не рекомендуется к использованию.

source: Sailthru minutes to wait before sending abandoned cart message. Deprecated.
kk_kz: Срок ожидания – в минутах – перед отправкой напоминания от Sailthru о неиспользованных покупках в корзине. Устарело, не рекомендуется к использованию.

source: Sailthru send template to use on enrolling for audit.
kk_kz: Шаблон Salithru для использования при записи в качестве свободного слушателя.

source: Sailthru send template to use on upgrading a course. Deprecated
kk_kz: Шаблон Salithru для использования при изменении режима записи на курс. Устарело, не рекомендуется к использованию.

source: Sailthru send template to use on purchasing a course seat. Deprecated
kk_kz: Шаблон Salithru для использования при получении места на курсе. Устарело, не рекомендуется к использованию.

source: Use the Sailthru content API to fetch course tags.
kk_kz: Использовать Sailthru content API для получения тегов для курса.

source: Number of seconds to cache course content retrieved from Sailthru.
kk_kz: Срок кеширования – в секундах – содержимого курса, полученного от Sailthru.

source: Cost in cents to report to Sailthru for enrolls.
kk_kz: Стоимость одного успешного зачисления для Sailthru, в центах.

source: Optional lms url scheme + host used to construct urls for content library, e.g. https://courses.edx.org.
kk_kz: Нестандартные схема + хост LMS, используемые для составления адреса библиотеки компонентов, например, https://courses.edx.org.

source: Number of seconds to delay the sending of User Welcome email after user has been created
kk_kz: Задержка в секундах перед отправкой слушателю приветственного сообщения после создания учётной записи

source: {platform_name} Staff
kk_kz: Администраторы {platform_name}

source: Course Staff
kk_kz: Сотрудники курса

source: Staff
kk_kz: Қызметкер

source: Used Registration Code
kk_kz: Использован регистрационный код

source: Credit Card - Individual
kk_kz: Кредитная карта – физическое лицо

source: manually enrolled by username: {username}
kk_kz: вручную зачислен пользователем: {username}

source: Manually Enrolled
kk_kz: Записан вручную

source: Data Integrity Error
kk_kz: Ошибка целостности данных

source: TBD
kk_kz: Будет определён позднее

source: Proctored Exam Review: {review_status}
kk_kz: Қайта Емтихан шолу: {review_status}

source: A proctored exam attempt for {exam_name} in {course_name} by username: {student_username} was reviewed as {review_status} by the proctored exam review provider.
kk_kz: Попытка сдачи наблюдаемого задания {exam_name} в курсе {course_name} слушателем {student_username} была отмечена сервисом отсмотра наблюдаемых экзаменов как {review_status}.

source: Your Platform Insights
kk_kz: Платформа туралы идеяларыңыз

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below.
kk_kz: {report_type} есебі жасалады. Есеп күйін көру үшін төмендегі аяқталмаған тапсырмалар бөлімін қараңыз.

source: User does not exist.
kk_kz: Пайдаланушы жоқ.

source: Found a conflict with given identifier. Please try an alternative identifier
kk_kz: Берілген идентификатормен қақтығыс анықталды. Балама идентификаторды қолданып көріңіз

source: Make sure that the file you upload is in CSV format with no extraneous characters or rows.
kk_kz: Жүктелетін файлдың CSV форматында сыртқы таңбаларсыз немесе жолдарсыз екеніне көз жеткізіңіз.

source: Could not read uploaded file.
kk_kz: Ошибка чтения загруженного файла

source: Data in row #{row_num} must have exactly four columns: email, username, full name, and country
kk_kz: #{row_num} жолындағы деректерде төрт баған болуы керек: электрондық пошта мекенжайы, пайдаланушы аты, Толық аты және елі

source: Invalid email {email_address}.
kk_kz: Қате электрондық пошта мекенжайы {email_address}.

source: An account with email {email} exists but the provided username {username} is different. Enrolling anyway with {email}.
kk_kz: Электрондық пошта тіркелгісі {email} бар, бірақ көрсетілген пайдаланушы аты {username} басқа. Қалай болғанда да, {email} көмегімен тіркелді.

source: File is not attached.
kk_kz: Файл тіркелген жоқ.

source: Username {user} already exists.
kk_kz: Пайдаланушы аты {user} бұрыннан бар.

source: Error '{error}' while sending email to new user (user email={email}). Without the email student would not be able to login. Please contact support for further information.
kk_kz: Электрондық поштаны жаңа пайдаланушыға жіберген кезде '{error}' қатесі (user email={email}). Электрондық поштасыз студент кіре алмайды. Қосымша ақпарат алу үшін тұтынушыларға қызмет көрсету орталығына хабарласыңыз.

source: problem responses
kk_kz: Отчёт с ответами на задачу

source: Could not find problem with this location.
kk_kz: Бұл орынға байланысты проблема табылмады.

source: Invoice number '{num}' does not exist.
kk_kz: Невозможно найти счёт с номером «{num}».

source: The sale associated with this invoice has already been invalidated.
kk_kz: Продажа по этой квитанции уже была аннулирована.

source: Invoice number {0} has been invalidated.
kk_kz: Квитанция {0} была аннулирована.

source: This invoice is already active.
kk_kz: Эта квитанция уже была активирована.

source: The registration codes for invoice {0} have been re-activated.
kk_kz: Регистрационные коды для квитанции {0} были повторно активированы.

source: CourseID
kk_kz: Курс идентификаторы

source: Certificate Type
kk_kz: Сертификат түрі

source: Total Certificates Issued
kk_kz: Берілген Сертификаттардың Жалпы Саны

source: Date Report Run
kk_kz: Есепті Іске Қосу Күні

source: enrolled learner profile
kk_kz: Список личных данных записанных слушателей

source: User ID
kk_kz: Пайдаланушы идентификаторы

source: Email
kk_kz: пошта

source: Language
kk_kz: Тілі

source: Location
kk_kz: Орналасқан орны

source: Birth Year
kk_kz: Туған жылы

source: Gender
kk_kz: Жынысы

source: Level of Education
kk_kz: Білім деңгейі

source: Mailing Address
kk_kz: Почталық мекенжайы

source: Goals
kk_kz: Мақсаттары

source: Enrollment Mode
kk_kz: Қабылдау режимі

source: Verification Status
kk_kz: Тексеру мәртебесі

source: Cohort
kk_kz: Топ

source: Team
kk_kz: Команда

source: City
kk_kz: Қала

source: Country
kk_kz: Ел

source: enrollment
kk_kz: Отчёт по записи слушателей

source: The file must contain a 'cohort' column containing cohort names.
kk_kz: Файлда когорт атаулары бар "когорт" бағаны болуы керек.

source: The file must contain a 'username' column, an 'email' column, or both.
kk_kz: Файлда 'username' бағаны, 'email' бағаны немесе екеуі де болуы керек.

source: Coupon Code
kk_kz: Купон Коды

source: Course Id
kk_kz: Курс идентификаторы

source: % Discount
kk_kz: % скидка

source: Description
kk_kz: Сипаттамасы

source: Expiration Date
kk_kz: Дата истечения срока

source: Is Active
kk_kz: Активен

source: Code Redeemed Count
kk_kz: Количество использованных кодов активации

source: Total Discounted Seats
kk_kz: Итого мест, оплаченных со скидкой

source: Total Discounted Amount
kk_kz: Общая сумма скидки

source: detailed enrollment
kk_kz: Подробный отчёт по записи слушателей

source: executive summary
kk_kz: Сводный отчёт

source: survey
kk_kz: Результаты опроса

source: proctored exam results
kk_kz: Результаты наблюдаемого экзамена

source: Could not parse amount as a decimal
kk_kz: Не удалось распознать сумму в виде десятичного числа

source: Unable to generate redeem codes because of course misconfiguration.
kk_kz: Не удалось сгенерировать коды активации из-за неправильной конфигурации курса.

source: pdf download unavailable right now, please contact support.
kk_kz: в настоящий момент скачивание pdf недоступно, пожалуйста, свяжитесь с командой поддержки.

source: Enrollment status for {student}: unknown
kk_kz: {student} үшін қабылдау мәртебесі: белгісіз

source: Enrollment status for {student}: active
kk_kz: {student} үшін қабылдау мәртебесі: белсенді

source: Enrollment status for {student}: inactive
kk_kz: {student} үшін қабылдау мәртебесі: белсенді емес

source: Enrollment status for {student}: pending
kk_kz: {student} үшін қабылдау мәртебесі: күтуде

source: Enrollment status for {student}: never enrolled
kk_kz: {student} үшін қабылдау мәртебесі: ешқашан тіркелмеген

source: Module does not exist.
kk_kz: Модуль жоқ.

source: An error occurred while deleting the score.
kk_kz: Бағаны өшіру кезінде қате пайда болды.

source: Course has no entrance exam section.
kk_kz: Курста қабылдау емтихандарының бөлімі жоқ.

source: all_students and unique_student_identifier are mutually exclusive.
kk_kz: all_students және unique_student_identifier өзара ерекше.

source: all_students and delete_module are mutually exclusive.
kk_kz: all_students және delete_module өзара ерекше.

source: Requires instructor access.
kk_kz: Требуются права преподавателя

source: Course has no valid entrance exam section.
kk_kz: Курста қабылдау емтихандарының жарамды бөлімі жоқ.

source: All Students
kk_kz: Барлық оқушылар

source: Cannot rescore with all_students and unique_student_identifier.
kk_kz: all_students және unique_student_identifier қайта бағалау орындалмады

source: ORA data
kk_kz: ORA деректері

source: grade
kk_kz: Оценочный лист

source: problem grade
kk_kz: Оценочный лист с подробными оценками задач

source: Successfully changed due date for student {0} for {1} to {2}
kk_kz: {0} студент үшін {1}мерзім{2} мерзімге ойдағыдай өзгертілді

source: Successfully removed invalid due date extension (unit has no due date).
kk_kz: Жарамсыз мерзімді ұзарту сәтті жойылды (құрылғының мерзімі жоқ).

source: Successfully reset due date for student {0} for {1} to {2}
kk_kz: {0} студент үшін {1}мерзім{2} мерзімге ойдағыдай шығарып тасталды

source: This student (%s) will skip the entrance exam.
kk_kz: Бұл студент (%s) қабылдау емтиханын өткізіп жібереді.

source: This student (%s) is already allowed to skip the entrance exam.
kk_kz: Бұл оқушыға (%s) қабылдау емтиханын өткізіп жіберуге рұқсат етілген.

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
kk_kz: Осы курстың барлық студенттері үшін сертификаттар құру тапсырмасы басталды. Құру тапсырмасының күйін "кейінге қалдырылған тапсырмалар"бөлімінен көре аласыз.

source: Please select one or more certificate statuses that require certificate regeneration.
kk_kz: Сертификатты қалпына келтіруді қажет ететін бір немесе бірнеше сертификат мәртебесін таңдаңыз.

source: Please select certificate statuses from the list only.
kk_kz: Тек тізімнен сертификат мәртебесін таңдаңыз.

source: Certificate regeneration task has been started. You can view the status of the generation task in the "Pending Tasks" section.
kk_kz: Сертификатты қалпына келтіру міндеті басталды. Құру тапсырмасының күйін "кейінге қалдырылған тапсырмалар"бөлімінен көре аласыз.

source: Student (username/email={user}) already in certificate exception list.
kk_kz: Студент (username/email={user}) сертификатты алып тастау тізіміне енді.

source: Certificate exception (user={user}) does not exist in certificate white list. Please refresh the page and try again.
kk_kz: Пользователь (user={user}) не найден в списке исключений для выпуска сертификатов. Пожалуйста, обновите страницу и попробуйте ещё раз.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
kk_kz: Студенттің пайдаланушы аты/электрондық пошта өрісі міндетті және бос болуы мүмкін емес. Пайдаланушы аты/электрондық пошта мекенжайын енгізіп, "ерекшеліктер тізіміне қосу"түймесін басыңыз.

source: The record is not in the correct format. Please add a valid username or email address.
kk_kz: Жазу дұрыс форматта емес. Жарамды пайдаланушы атын немесе электрондық пошта мекенжайын қосыңыз.

source: {user} does not exist in the LMS. Please check your spelling and retry.
kk_kz: {user} LMS-де жоқ. Емлені тексеріп, қайталап көріңіз.

source: {user} is not enrolled in this course. Please check your spelling and retry.
kk_kz: {user} не записан на этот курс. Пожалуйста, проверьте правильность ввода и повторите попытку.

source: Invalid data, generate_for must be "new" or "all".
kk_kz: Жарамсыз деректер, generate_for "жаңа" немесе "бәрі" болуы керек.

source: Certificate generation started for white listed students.
kk_kz: Начата процедура выпуска сертификатов для обучающихся из списка исключений.

source: user "{user}" in row# {row}
kk_kz: "{user}" пайдаланушысы кезекте # {row}

source: user "{username}" in row# {row}
kk_kz: "{username}" пайдаланушысы кезекте # {row}

source: Certificate of {user} has already been invalidated. Please check your spelling and retry.
kk_kz: {user} сертификаты жарамсыз деп танылды. Емлені тексеріп, қайталап көріңіз.

source: Certificate for student {user} is already invalid, kindly verify that certificate was generated for this student and then proceed.
kk_kz: студент {user} үшін сертификат жарамсыз, осы студент үшін сертификат жасалғанына көз жеткізіп, содан кейін жалғастырыңыз.

source: Certificate Invalidation does not exist, Please refresh the page and try again.
kk_kz: Сертификаттың жарамсыздығы жоқ, бетті жаңартып, қайталап көріңіз.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
kk_kz: Студенттің пайдаланушы аты/электрондық пошта өрісі міндетті және бос болуы мүмкін емес. Пайдаланушы аты/электрондық пошта мекенжайын енгізіп, "куәлікті жою" түймесін басыңыз.

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
kk_kz: Студент {student} {course} курсынан өту үшін сертификаты жоқ. Студенттің пайдаланушы аты/электрондық пошта мекенжайы мен таңдалған курс дұрыс екеніне көз жеткізіп, әрекетті қайталаңыз.

source: coupon id is None
kk_kz: идентификационный номер купона пуст

source: coupon with the coupon id ({coupon_id}) DoesNotExist
kk_kz: купона с идентификационным номером ({coupon_id}) не существует

source: coupon with the coupon id ({coupon_id}) is already inactive
kk_kz: купон с идентификационным номером ({coupon_id}) уже недействителен

source: coupon with the coupon id ({coupon_id}) updated successfully
kk_kz: купон с идентификационным номером ({coupon_id}) успешно обновлён

source: The code ({code}) that you have tried to define is already in use as a registration code
kk_kz: Код ({code}), который вы пытались определить, уже используется в качестве регистрационного кода.
