Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Slides for video lectures should be typed in the font title 20 pt, the main text 18 pt.
kk_kz: Бейне дәрістерге арналған слайдтар 20 пт, негізгі мәтін 18 пт қарпінде терілуі керек.

source: The image size must be at least 1280x720p (HD).
kk_kz: Кескін өлшемі кемінде 1280x720p (HD) болуы керек.

source: The image must be in PNG format.
kk_kz: Сурет PNG форматында болуы керек.

source: All third-party materials used in the course must be licensed with CC Attribution.
kk_kz: Курста пайдаланылатын барлық үшінші тарап материалдары CC Attribution лицензиясына ие болуы керек.

source: Next to each borrowed image (graphics, infographics, photography, reproduction, etc.), a link to the source must be indicated.
kk_kz: Әрбір алынған суреттің (графика, инфографика, фотография, репродукция және т.б.) жанында міндетті түрде дереккөзге сілтеме болуы керек.

source: After verification by the MOOC Center, the links can be taken to the last slide of the presentation in the &laquo;List of used Sources&raquo;.
kk_kz: MOOC орталығы тексергеннен кейін сілтемелерді презентацияның соңғы слайдында «Пайдаланылған дереккөз тізімінде» орналастыруға болады.

source: Stages of online course development
kk_kz: Онлайн курсты әзірлеу кезеңдері

source: Submitting an application for the development of an online course. Participation in
kk_kz: Онлайн курсты әзірлеуге өтініш беру. Онлайн

source: competition
kk_kz: курстарды

source: pedagogical scenarios for creating and publishing online courses (MOOC/SPOC).
kk_kz: әзірлеу мен жариялау үшін педагогикалық сценарийлер байқауына қатысу (MOOC / SPOC).

source: Development of an online course
kk_kz: Онлайн курсты әзірлеу

source: 1. Preparation of online course materials by the author-developer.
kk_kz: 1. Онлайн курс материалдарын автор-әзірлеушілердің дайындауы.

source: List of documents.
kk_kz: Құжаттардың тізімдемесі.

source: To obtain documents on the requirements and recommendations for recording video materials of the online course, contact
kk_kz: Онлайн курсқа бейне материалдарды жазуға қойылатын талаптар мен ұсыныстар бойынша құжаттарды алу үшін

source: Center for mass open online courses.
kk_kz: жаппай ашық онлайн курстар орталығына хабарласыңыз.

source: 2. Methodological and technical expertise of online course materials.
kk_kz: 2. Онлайн курс материалдарының әдістемелік және техникалық сараптамадан өткізу.

source: 3. Recording video materials of the online course.
kk_kz: 3. Онлайн курс бейнематериалдарын жазу.

source: 4. Uploading online course materials to the platform.
kk_kz: 4. Онлайн курс материалдарын платформаға жүктеу.

source: 5. Beta testing and examination of the course.
kk_kz: 5. Курсты бета-тестілеу және сараптау.

source: Al-Farabi Kazakh National University is the leader among Kazakhstani universities in implementing MOOCs on the OpenEdx open platform.
kk_kz: Әл-Фараби атындағы Қазақ ұлттық университеті OpenEdx ашық платформасында MOOC енгізу бойынша қазақстандық жоғары оқу орындары арасында көшбасшы.

source: Since the 2014-2015 academic year, the Distance Education Center of Al-Farabi Kazakh National University, together with the teaching staff, has begun work on the creation of MOOCs, and at the moment at the
kk_kz: 2014-2015 оқу жылынан бастап әл-Фараби атындағы ҚазҰУ-дың Қашықтықтан Білім беру Орталығы, профессорлық-оқытушылық құраммен бірге ЖАОК әзірлеу бойынша жұмысты бастады, және қазіргі уақытта

source: there is a proprietary MOOC platform based on the Open edX system.
kk_kz: интернет-мекен-жайы бойынша, өзінің жеке ЖАОК платформасы Open edX жүйесі негізінде жұмыс істейді.

source: On October 1, 2015, the first open courses from leading teachers of Al-Farabi Kazakh National University were launched - Probability Theory and Physical problems with Associate Professor V. Kashkarov, where about 250 and 500 students from different regions of Kazakhstan, respectively, enrolled. These courses were mainly attended by students of the 1st-2nd year of Al-Farabi Kazakh National University, senior classes of Nazarbayev intellectual schools, specialized physics and mathematics and secondary schools. Data analysis has shown great interest in these courses, which gives an incentive to the teaching staff and university staff to continue working in this direction. At the end of June 2016, more than two thousand listeners were registered in the system.
kk_kz: 2015 жылдың 1 қазанында әл-Фараби атындағы ҚазҰУ -дың жетекші оқытушыларынан "Теория вероятностей" мен "Физические задачи с доцентом В. Кашкаровым" атты ашық курстар жарияланды, оған Қазақстанның әр аймағынан 250 және 500 -ге жуық студент қабылданды. Бұл курстарда әл-Фараби атындағы ҚазҰУ-дың 1 және 2 курс студенттері, Назарбаев Зияткерлік мектептерінің жоғары сыныптары, мамандандырылған физика-математикалық және орта мектептердің оқушылары негізінен дайындалды. Талдау бойынша бұл курстарға үлкен қызығушылық туған, бұл оқытушылар құрамы мен университет қызметкерлеріне осы бағытта жұмысты жалғастыруға ынталандырады. 2016 жылдың маусым айының соңында жүйеде екі мыңнан астам тыңдаушы тіркелді.

source: With the active assistance of the Al-Farabi Kazakh National University, the National Platform for Open Education of Kazakhstan (hereinafter referred to as NPOC) was launched.
kk_kz: Әл -Фараби атындағы ҚазҰУ-дың белсенді көмегімен Қазақстанның ашық білім беру ұлттық платформасы (бұдан әрі – ҚАББҰП) іске қосылды.

source: As part of the implementation of a set of measures for the development of e-learning and the organization of the work of NPOC for training personnel based on distance education technologies (DOT) and strengthening the work of the Center for Distance Education (CDO), in order to increase the mobility of the provision of educational services to the university according to new educational programs, the university management decided (Rector&lsquo;s Order No. 45 of 29.01.2016) to transform the structural unit of the Center for Distance Education into the Institute of Distance Education; (IDO), which included the Center for Mass Open Online Courses (CMOC) in the status of the project office of the national platform. The Regulations of the MOOC Center, as well as job descriptions of the head, leading specialist and specialist of the CMOC Center were developed and approved by the Vice-Rector for Academic Affairs Ahmed-Zaki D.J. (dated March 14, 2016). (dated January 10, 2019).
kk_kz: Электронды оқытуды дамыту мен қашықтықтан білім беру технологиялары (ҚББТ) негізінде кадрларды даярлау бойынша ҚАББҰП жұмысын ұйымдастыру және Қашықтықтан білім беру орталығының (ҚББО) жұмысын күшейту бойынша шаралар кешенін іске асыру шеңберінде, жаңа білім беру бағдарламалары бойынша университеттің білім беру қызметтерін ұсынудың ұтқырлығын арттыру үшін университет басшылығы «Қашықтықтан білім беру орталығы» құрылымдық бөлімшесін қайта құру туралы шешім қабылдады (ректордың 29.01.2016 ж. №45 бұйрығы). Жаппай ашық онлайн курстар орталығы (ЖАОКО) кіретін «Қашықтықтан білім беру институтына» (ҚББИ) ауыстырылды, және ұлттық платформаның жобалық офисі мәртебесіне енгізді. ЖАОК орталығының ережесі, сонымен қатар ЖАОКО орталығының жетекшісінің, жетекші маманы мен маманының лауазымдық нұсқаулықтары (10 қаңтар, 2019 ж.) оқу-ісі жөніндегі проректор Ахмед-Заки Д.Ж әзірлеген және бекіткен (14 наурыз 2016 ж.).

source: In February 2016, the Institute of Distance Education was transformed into the Institute of New Educational Technologies, which continues the work of the CMOC.
kk_kz: 2016 жылдың ақпанында қашықтықтан білім беру институты жаңа білім беру технологиялары институтына айналды, оның аясында ЖАОКО жұмысын жалғастыруда.

source: The document of the Center for Mass open online courses of Al-Farabi Kazakh National University
kk_kz: Әл-Фараби атындағы Қазақ ұлттық университетінің жаппай ашық онлайн курстар орталығының құжаты

source: Our team
kk_kz: Біздің команда

source: Saksenbayeva Zhanna
kk_kz: Саксенбаева Жанна

source: Head of the Department of Methodological Work and Educational Technologies
kk_kz: Әдістемелік жұмыс және білім беру технологиялары басқармасының басшысы

source: Musinova Asel
kk_kz: Мусинова Асель

source: Director of the Institute of New Educational Technologies
kk_kz: Жаңа білім беру технологиялары институтының директоры

source: Atabayeva Marzhan
kk_kz: Атабаева Маржан

source: Head of the Center for mass open online courses
kk_kz: Жаппай ашық онлайн курстар орталығының басшысы

source: Khakimov Rinat
kk_kz: Хакимов Ринат

source: Software Engineer at the Institute of New Educational Technologies
kk_kz: Жаңа білім беру технологиялары институтының программисті

source: Acting head of the Department of methodological work and educational technologies
kk_kz: Әдістемелік жұмыс және білім беру технологиялары басқармасының басшысы м.а.

source: Akpanov Erbol
kk_kz: Акпанов Ербол

source: Leading specialist of the Institute of new educational technologies
kk_kz: Жаңа білім беру технологиялары институтының жетекші маманы

source: Aristanova Ainur
kk_kz: Арыстанова Айнур

source: How much will it cost to register and access course materials?
kk_kz: Курс материалдарына тіркелу және қол жеткізу қанша тұрады?

source: Registration and training in the course are absolutely free.
kk_kz: Курсқа тіркелу және оқыту мүлдем тегін.

source: Will certificates be issued at the end of the course?
kk_kz: Курс аяқталғаннан кейін сертификаттар беріле ме?

source: If you complete tasks not lower than the threshold score, you can get a certificate.
kk_kz: Шекті балдан төмен емес тапсырмаларды орындау кезінде сіз сертификат ала аласыз.

source: What do I need to start learning?
kk_kz: Оқуды бастау үшін не қажет?

source: In order to start training, you need to register on the platform open.kaznu.kz, log in to the website and choose the course you like.
kk_kz: Оқуды бастау үшін Сіз платформада тіркелуіңіз керек open.kaznu.kz. сайтқа кіріп, өзіңізге ұнайтын курсты таңдаңыз.

source: What documents do I need to provide to enroll in open courses?
kk_kz: Ашық курстарға қабылдау үшін қандай құжаттар ұсыну керек?

source: Currently, no documents are required to enroll in the course. There are no formal restrictions for mastering online courses.
kk_kz: Енді курсқа қабылдау үшін ешқандай құжаттар қажет емес. Онлайн курстарды игеруге ресми шектеулер жоқ.

source: Instructions for registering on the platform open.kaznu.kz
kk_kz: Платформаға Тіркелу жөніндегі Нұсқаулық open.kaznu.kz

source: Instructions for working with courses on the platform open.kaznu.kz
kk_kz: Платформада курстармен жұмыс істеу жөніндегі Нұсқаулық open.kaznu.kz

source: CREATING AN ONLINE COURSE
kk_kz: ОНЛАЙН КУРСТЫ ӘЗІРЛЕУ

source: Login via Univer
kk_kz: Univer көмегімен кіру
