Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Delete
kk_kz: Жою

source: You cannot delete a root article.
kk_kz: Сіз түбір бапты жоя алмайсыз.

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
kk_kz: Сіз осы бапты жоя алмайсыз, себебі сіздің тәуелділіктері бар баптарды жоюға құқығыңыз жоқ. Еншілес баптарды бірінен соң бірін қолмен жоюға әрекет етіп көріңіз.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
kk_kz: Сіз бапты жоюдасыз. Бұл еншілес баптардың да жойылатындығын білдіреді. Егер сіз жоюды таңдасаңыз, еншілес баптар да жойылатын болады!

source: Articles that will be deleted
kk_kz: Статьи, которые будут удалены:

source: ...and more!
kk_kz: ...және көптеген басқа!

source: You are deleting an article. Please confirm.
kk_kz: Сіз бапты жойғыңыз келеді. Растаңыз.

source: Edit
kk_kz: Редактировать

source: Save changes
kk_kz: Өзгерістерді сақтау

source: Preview
kk_kz: Предварительный просмотр

source: Close
kk_kz: Жабу

source: Wiki Preview
kk_kz: Викиді Алдын ала Қарау

source: window open
kk_kz: терезені ашу

source: Back to editor
kk_kz: Редакторға оралу

source: History
kk_kz: Тарих

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
kk_kz: Нажмите на каждую версию, чтобы увидеть список отредактированных строк. Нажмите «Предварительный просмотр», чтобы увидеть как статья выглядела на этой странице. В нижней части страницы вы можете перейти на конкретную версию или объединить старую версию с текущей.

source: (no log message)
kk_kz: (лог-хабарлар жоқ)

source: Preview this revision
kk_kz: Ревизияны алдын ала қарау

source: Auto log:
kk_kz: Автоматты журнал:

source: Change
kk_kz: Өзгерту

source: Merge selected with current...
kk_kz: Таңдалғанды ағымдағымен біріктіру...

source: Switch to selected version
kk_kz: Таңдалған нұсқаға өту

source: Wiki Revision Preview
kk_kz: Вики бетіндегі Түзетулерді Алдын ала Қарау

source: Back to history view
kk_kz: Қарау тарихына оралу

source: Switch to this version
kk_kz: Осы нұсқаға өту

source: Merge Revision
kk_kz: Түзетулерді біріктіру

source: Merge with current
kk_kz: Ағымдағымен біріктіру

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
kk_kz: Ревизия ағымдағымен қосылған кезде екі нұсқаның барлық деректері әрбір ревизияның шамамен орналасқан орнында сақталатын және біріктірілетін болады

source: After this, it's important to do a manual review.
kk_kz: Осыдан кейін қолмен тексеруді жүргізген маңызды.

source: Create new merged version
kk_kz: Жаңа біріктірілген нұсқаны құру

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
kk_kz: Бұл мүмкіндікті<a href="%(login_url)s"> пайдалану үшін </a><a href="%(signup_url)s">Жүйеге кіру</a> немесе тіркелу қажет.

source: You need to log in or sign up to use this function.
kk_kz: Осы функцияны пайдалану үшін Сізге кіру немесе тіркелу керек.

source: Wiki Cheatsheet
kk_kz: Викиді Редакциялау бойынша жадынама

source: Wiki Syntax Help
kk_kz: Вики-синтакспен көмек

source: This wiki uses <strong>Markdown</strong> for styling. There are several useful guides online. See any of the links below for in-depth details:
kk_kz: Эта вики-страница использует форматирование <strong>Markdown</strong>. В Интернете есть несколько полезных руководств. Если вас интересуют подробности, перейдите по любой из ссылок, приведённых ниже:

source: Markdown: Basics
kk_kz: Маркдаун: негіздер

source: Quick Markdown Syntax Guide
kk_kz: Markdown синтаксисі бойынша жылдам басшылық

source: Miniature Markdown Guide
kk_kz: Markdown бойынша мини-басшылық

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
kk_kz: Жаңа вики-бапты құру үшін оған сілтеме құрыңыз. Бапты құру беті осы сілтеме бойынша ашылады.

source: [Article Name](wiki:ArticleName)
kk_kz: [Баптың Атауы](wiki:БаптыңАтауы)

source: %(platform_name)s Additions:
kk_kz: %(platform_name)sТолықтырулар:

source: Math Expression
kk_kz: Математикалық Өрнек

source: Useful examples:
kk_kz: Пайдалы мысалдар:

source: Wikipedia
kk_kz: Википедия

source: %(platform_name)s Wiki
kk_kz: %(platform_name)s Вики

source: Huge Header
kk_kz: Үлкен тақырып

source: Smaller Header
kk_kz: Кіші тақырып

source: *emphasis* or _emphasis_
kk_kz: *бөліп көрсету* немесе _ бөліп көрсету _

source: **strong** or __strong__
kk_kz: ** қатты бөліп көрсету ** немесе __ қатты бөліп көрсету __

source: Unordered List
kk_kz: Ретке келтірілмеген тізім

source: Sub Item 1
kk_kz: Қосымша зат 1

source: Sub Item 2
kk_kz: Қосымша зат 2

source: Ordered
kk_kz: Ретке келтірілген

source: List
kk_kz: Тізім

source: Quotes
kk_kz: Дәйексөздер

source: Markdown syntax is allowed. See the %(start_link)scheatsheet%(end_link)s for help.
kk_kz: Белгілеу синтаксисіне рұқсат етіледі. Көмек алу үшін %(start_link)s парағына %(end_link)sжүгініңіз.

source: Attachments
kk_kz: Қойындылар

source: Upload new file
kk_kz: Жаңа файлды жүктеу

source: Search and add file
kk_kz: Файлды іздеу және қосу

source: Upload File
kk_kz: Файлды жүктеу

source: Upload file
kk_kz: Файлды жүктеу

source: Search files and articles
kk_kz: Файлдар және баптар бойынша іздеу

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
kk_kz: Сіз басқа баптардан алынған файлдарды пайдалана аласыз. Бұл файлдар басқа баптарда жаңартылуы мүмкін, бұл әрі жағымды, әрі жағымсыз жаңалық болуы мүмкін.

source: Search
kk_kz: Іздеу

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
kk_kz: Следующие файлы доступны для этой статьи. Скопируйте тэг Markdown для непосредственной ссылки на файл из текста статьи

source: Markdown tag
kk_kz: Белгілеу тег маркдауны

source: Uploaded by
kk_kz: Загружено

source: Size
kk_kz: Мөлшері

source: File History
kk_kz: Файлдың тарихы

source: Detach
kk_kz: Ажыратып алу

source: Replace
kk_kz: Ауыстыру

source: Restore
kk_kz: Қалпына келтіру

source: anonymous (IP logged)
kk_kz: Аноним (IP-мекенжай жасырылған)

source: File history
kk_kz: Файл тарихы

source: revisions
kk_kz: ревизиялар

source: There are no attachments for this article.
kk_kz: Осы бап үшін қосымшалар жоқ.

source: Previewing revision:
kk_kz: Ревизияны алдын ала қарау

source: Previewing a merge between two revisions:
kk_kz: Екі нұсқаның қосылуын алдын ала қарау:

source: This revision has been deleted.
kk_kz: Осы нұсқа жойылған болатын.

source: Restoring to this revision will mark the article as deleted.
kk_kz: Егер осы нұсқаға шегіну жүргізілсе, бап жойылған ретінде белгіленетін болады.

source: LMS Administration
kk_kz: LMS әкімшілігі

source: ACE Common
kk_kz: ACE Ортақ

source: Go to %(platform_name)s Home Page
kk_kz: %(platform_name)sБасты бетке өтіңіз

source: Sign In
kk_kz: Кіру

source: %(platform_name)s on LinkedIn
kk_kz: %(platform_name)s LinkedIn-да

source: %(platform_name)s on Twitter
kk_kz: %(platform_name)s Twitter-да

source: %(platform_name)s on Facebook
kk_kz: %(platform_name)s Facebook-та

source: %(platform_name)s on Google Plus
kk_kz: %(platform_name)s Google Plus-те

source: %(platform_name)s on Reddit
kk_kz: %(platform_name)s Reddit-тте

source: Download the iOS app on the Apple Store
kk_kz: Apple дүкеніне iOS қосымшасын жүктеңіз

source: Download the Android app on the Google Play Store
kk_kz: Google Play дүкенінен Android қосымшасын жүктеп алыңыз

source: Our mailing address is
kk_kz: Біздің пошталық мекен-жайымыз:

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate. Upgrade by %(user_schedule_upgrade_deadline_time)s.
kk_kz: Расталған сертификат алу арқылы жаңа біліміңіз бен дағдыларыңызды көрсету мүмкіндігін жіберіп алмаңыз. %(user_schedule_upgrade_deadline_time)sКөмегімен жаңарту

source: Upgrade Now
kk_kz: Қазір Жаңартыңыз

source: Once you have approved this request, go to {catalog_admin_url} to set up a catalog for this user.
kk_kz: Осы сұрауды мақұлдағаннан кейін осы пайдаланушы үшін каталогты орнату үшін {catalog_admin_url} бөліміне өтіңіз.

source: Organization Name
kk_kz: Ұйымның атауы

source: Organization Address
kk_kz: Ұйымның мекен-жайы

source: Describe what your application does.
kk_kz: Қолданбаңыздың не істейтінін сипаттаңыз.

source: The URL of your organization's website.
kk_kz: Ұйымның веб-сайтының URL мекенжайы.

source: The name of your organization.
kk_kz: Сіздің ұйымыңыздың атауы.

source: The contact address of your organization.
kk_kz: Сіздің ұйымыңыздың байланыс мекен-жайы.

source: The following users do not exist: {usernames}.
kk_kz: Келесі пайдаланушылар жоқ: {usernames}.

source: Comma-separated list of usernames which will be able to view this catalog.
kk_kz: Бұл каталогты көре алатын пайдаланушы аттарының үтірмен бөлінген тізімі.

source: Denied
kk_kz: Бас тартылды

source: Approved
kk_kz: Мақұлданған

source: Status of this API access request
kk_kz: Осы API қатынасу сұранысының күйі

source: The URL of the website associated with this API user.
kk_kz: Осы API пайдаланушысымен байланысты веб-сайттың URL мекенжайы.

source: The reason this user wants to access the API.
kk_kz: Бұл Пайдаланушының API-ге қол жеткізгісі келетін себебі.

source: API access request from {company}
kk_kz: Запрос доступа к API от {company}

source: API access request
kk_kz: Запрос доступа к API

source: I, and my organization, accept the {link_start}{platform_name} API Terms of Service{link_end}.
kk_kz: Мен және менің ұйымым {link_start}{platform_name} API қызметтерін ұсыну шарттары{link_end}.

source: Bookmarks
kk_kz: Кітап бетбелгілері

source: An error has occurred. Please try again.
kk_kz: Қате пайда болды. Көріңіз тағы да.

source: No data provided.
kk_kz: Ешқандай деректер берілмеген.

source: Parameter usage_id not provided.
kk_kz: Usage_id параметрі көрсетілмеген.

source: Invalid usage_id: {usage_id}.
kk_kz: Жарамсыз usage_id: {usage_id}.

source: Block with usage_id: {usage_id} not found.
kk_kz: Usage_id идентификаторы бар Блок: {usage_id} табылмады.

source: You can create up to {max_num_bookmarks_per_course} bookmarks. You must remove some bookmarks before you can add new ones.
kk_kz: Сіз бетбелгілерді {max_num_bookmarks_per_course} дейін жасай аласыз. Жаңаларын қоспас бұрын кейбір бетбелгілерді жою керек.

source: Bookmark with usage_id: {usage_id} does not exist.
kk_kz: Пайдалану идентификаторы бар бетбелгі: {usage_id} жоқ.

source: Internal API URL
kk_kz: Ішкі URL API

source: DEPRECATED: Use the setting COURSE_CATALOG_API_URL.
kk_kz: Қайта қарауға: course_catalog_api_url параметрін қолданыңыз.

source: Specified in seconds. Enable caching of API responses by setting this to a value greater than 0.
kk_kz: Задаётся в секундах. Для включения кэширования ответов API укажите значение больше 0.

source: Long Term Cache Time To Live
kk_kz: Ұзақ Мерзімді Кэш-Өмір Сүру Уақыты

source: Specified in seconds (defaults to 86400s, 24hr). In some cases the cache does needs to be refreshed less frequently. Enable long term caching of API responses by setting this to a value greater than 0.
kk_kz: Секундтарда көрсетілген (әдепкі бойынша 86400с, 24 сағат). Кейбір жағдайларда кэшті сирек жаңарту қажет. API жауаптарын ұзақ мерзімді кэштеуді қосыңыз, ол үшін 0-ден жоғары мән орнатыңыз.

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
kk_kz: Курс каталогын біріктіру үшін жасалған пайдаланушы аты, мысалы, lms_catalog_service_user.

source: Page Size
kk_kz: Бет Өлшемі

source: Maximum number of records in paginated response of a single request to catalog service.
kk_kz: Каталог қызметіне бір сұранымға параққа бөлінген жауаптағы жазбалардың ең көп саны.

source: Enabled
kk_kz: Қосылған

source: Configuration may not be specified at more than one level at once.
kk_kz: Конфигурацияны бірден бірнеше деңгейде көрсету мүмкін емес.

source: List of domains that are allowed to make cross-domain requests to this site. Please list each domain on its own line.
kk_kz: Осы сайтқа Домен аралық сұрауларды жіберуге рұқсат етілген домендердің тізімі. Әр доменді бөлек жолда тізімдеңіз.

source: Default Group
kk_kz: Әдепкі топ

source: You cannot create two cohorts with the same name
kk_kz: Сіз бірдей атаумен екі топ құра алмайсыз

source: There must be one cohort to which students can automatically be assigned.
kk_kz: Студенттерді автоматты түрде тағайындайтындай бір топ болуы қажет.

source: A cohort with the same name already exists.
kk_kz: Осындай атаумен когорт бар.

source: Credentials
kk_kz: Өкілеттіктер

source: Internal Service URL
kk_kz: Ішкі қызметтің URL мекенжайы

source: Public Service URL
kk_kz: Мемлекеттік қызметтің URL-мекенжайы

source: Enable Learner Issuance
kk_kz: Оқушыларға Беруді Қосу

source: Enable issuance of credentials via Credential Service.
kk_kz: Тіркелгі деректері қызметін пайдаланып тіркелгі деректерін беруді қосыңыз.

source: Enable Authoring of Credential in Studio
kk_kz: Studio-да тіркелгі деректерін жасауды қосыңыз

source: Enable authoring of Credential Service credentials in Studio.
kk_kz: Studio-да тіркелгі деректері қызметінің тіркелгі деректерін құруды қосыңыз.

source: Course Credit Eligibility
kk_kz: Курсқа кредит алу құқығы

source: You are eligible for credit from {providers_string}
kk_kz: Сіз кредит алуға құқығыңыз бар {providers_string}

source: {first_provider} and {second_provider}
kk_kz: {first_provider} және {second_provider}

source: {first_providers}, and {last_provider}
kk_kz: {first_providers}, және {last_provider}

source: [{username}] is not eligible for credit for [{course_key}].
kk_kz: [{username}] [{course_key}] үшін несие алуға құқығы жоқ.

source: [{course_key}] is not a valid course key.
kk_kz: [{course_key}] курстың рұқсат етілген кілті емес.

source: Unique identifier for this credit provider. Only alphanumeric characters and hyphens (-) are allowed. The identifier is case-sensitive.
kk_kz: Осы несие провайдері үшін бірегей идентификатор. Тек әріптік-сандық таңбалар мен сызықшаларға (- ) рұқсат етіледі. Идентификатор регистрге сезімтал.

source: Whether the credit provider is currently enabled.
kk_kz: Қазіргі уақытта кредит қызметтерін жеткізуші қосылған ба?

source: Name of the credit provider displayed to users
kk_kz: Пайдаланушыларға көрсетілетін кредит провайдерінің аты

source: When true, automatically notify the credit provider when a user requests credit. In order for this to work, a shared secret key MUST be configured for the credit provider in secure auth settings.
kk_kz: Егер бұл рас болса, пайдаланушы кредит сұраған кезде кредит провайдеріне автоматты түрде хабарлаңыз. Бұл жұмыс істеуі үшін қауіпсіз аутентификация параметрлерінде несие провайдері үшін ортақ құпия кілт орнатылуы керек.

source: URL of the credit provider. If automatic integration is enabled, this will the the end-point that we POST to to notify the provider of a credit request. Otherwise, the user will be shown a link to this URL, so the user can request credit from the provider directly.
kk_kz: Несие провайдерінің URL мекенжайы. Егер автоматты интеграция қосылған болса, бұл жеткізушіге несие сұранысы туралы хабарлау үшін хабарлама жіберетін соңғы нүкте болады. Әйтпесе, пайдаланушыға осы URL мекен-жайына сілтеме көрсетіледі, осылайша пайдаланушы жеткізушіден тікелей несие сұрай алады.

source: URL from the credit provider where the user can check the status of his or her request for credit. This is displayed to students *after* they have requested credit.
kk_kz: Пайдаланушы кредит сұрауының мәртебесін тексере алатын кредит провайдерінің URL мекенжайы. Бұл студенттерге кредит сұрағаннан кейін* көрсетіледі.

source: Description for the credit provider displayed to users.
kk_kz: Пайдаланушыларға көрсетілетін кредиттік қызмет провайдерінің сипаттамасы.

source: Plain text or html content for displaying further steps on receipt page *after* paying for the credit to get credit for a credit course against a credit provider.
kk_kz: Кредит провайдерінен кредит курсына кредит алу үшін кредит алғаннан кейін *бетте келесі әрекеттерді көрсету үшін тұрақты мәтін немесе html мазмұны.

source: Plain text or html content for displaying custom message inside credit eligibility email content which is sent when user has met all credit eligibility requirements.
kk_kz: Пайдаланушы кредит алу үшін барлық талаптарды орындаған кезде жіберілетін кредит алу талаптарына жауап беретін электрондық пошта ішіндегі жеке хабарламаны көрсету үшін қарапайым мәтін немесе html мазмұны.

source: Plain text or html content for displaying custom message inside credit receipt email content which is sent *after* paying to get credit for a credit course.
kk_kz: Кредиттік курсқа кредит алу үшін *төлемнен кейін* жіберілген несие түбіртегі бар электрондық пошта ішіндегі жеке хабарламаны көрсету үшін қалыпты мәтін немесе html мазмұны.

source: Thumbnail image url of the credit provider.
kk_kz: Кредиттік қызмет провайдерінің қысқартылған кескінінің URL мекенжайы.

source: Credit requirement statuses
kk_kz: Кредиттік талаптардың мәртебелері

source: Deadline for purchasing and requesting credit.
kk_kz: Кредитті сатып алу және сұрау мерзімі.

source: Preview Language Administration
kk_kz: Алдын ала қарау тілін басқару

source: Language not provided
kk_kz: Тіл көрсетілмеген

source: Language set to {preview_language}
kk_kz: Тіл орнатылған {preview_language}

source: Language reset to the default
kk_kz: Тіл әдепкі мәнге қалпына келтірілді

source: This is a test message
kk_kz: Бұл сынақ хабарламасы

source: This is a success message
kk_kz: Бұл сәттілік туралы хабар

source: This is a test warning
kk_kz: Бұл сынақ ескертуі

source: This is a test error
kk_kz: Бұл тест қатесі

source: COURSE NOT FOUND. Please check that the course ID is valid.
kk_kz: КУРС ТАБЫЛМАДЫ. Курс ID жарамды екендігін тексеріңіз.

source: The course key for the restricted course.
kk_kz: Шектелген курс үшін негізгі курс.

source: The message to show when a user is blocked from enrollment.
kk_kz: Қолданушы тіркелуден бұғатталған кезін көрсететін хабарлама.

source: The message to show when a user is blocked from accessing a course.
kk_kz: Қолданушының курсқа қол жетімділігі блокталғандығын көрсететін хабарлама.

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
kk_kz: Рұқсат етілген елде тіркелген пайдаланушыларға шығарылған елдерден шектеулі курстарға кіруге рұқсат етіңіз.

source: Two character ISO country code.
kk_kz: Екі таңбалы ISO ел коды .

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
kk_kz: Керек пе немесе болдырмауы тиіс бұл курс. Егер ақ тізімге енгізілген елдер көрсетілсе, онда ақ тізімге енгізілген елдердің пайдаланушылары ғана курсқа қол жеткізе алады. Егер қара тізім елдері көрсетілсе, онда қара тізімге кіретін елдердің пайдаланушылары курсқа кіре алмайды.

source: The course to which this rule applies.
kk_kz: Мына ережелерге бағынатын курс

source: The country to which this rule applies.
kk_kz: Мына ережелерге бағынатын ел

source: Whitelist {country} for {course}
kk_kz: Ақ тізім {country} {course} үшін

source: Blacklist {country} for {course}
kk_kz: Қара тізім {country} {course} үшін

source: You have already created an account using an external login like WebAuth or Shibboleth. Please contact {tech_support_email} for support.
kk_kz: Вы уже создали учётную запись, пользуясь внешним идентификатором пользователя, таким как WebAuth или Shibboleth. Если вам нужна помощь, пожалуйста, свяжитесь с нами по адресу {tech_support_email}.

source: Your university identity server did not return your ID information to us. Please try logging in again. (You may need to restart your browser.)
kk_kz: Идентификационный сервер вашего учебного заведения не предоставил нам информации о вашей учётной записи. Пожалуйста, попробуйте войти ещё раз (вам может понадобиться перезапустить браузер).

source: Comma-separated list of scopes that this application will be allowed to request.
kk_kz: Осы қосымшаның сұрауына рұқсат етілген аймақтардың үтірмен бөлінген тізімі.

source: Content Provider
kk_kz: Контент провайдері

source: Password Policy
kk_kz: Пароль Саясаты

source: {strong_tag_open}We recently changed our password requirements{strong_tag_close}{break_line_tag}Your current password does not meet the new security requirements. We just sent a password-reset message to the email address associated with this account. Thank you for helping us keep your data safe.
kk_kz: {strong_tag_open}жақында біз парольге қойылатын талаптарды өзгерттік{strong_tag_close}{break_line_tag}сіздің ағымдағы құпия сөзіңіз жаңа қауіпсіздік талаптарына сәйкес келмейді. Біз осы есептік жазбамен байланысты электрондық пошта мекенжайына парольді қалпына келтіру туралы хабарлама жібердік. Деректерді қауіпсіз сақтауға көмектескеніңіз үшін рахмет.

source: {strong_tag_open}Required Action: Please update your password{strong_tag_close}{break_line_tag}As of {deadline}, {platform_name} will require all learners to have complex passwords. Your current password does not meet these requirements. To reset your password, go to to {anchor_tag_open}Account Settings{anchor_tag_close}.
kk_kz: {strong_tag_open}қажетті әрекеттер: құпия сөзді жаңартыңыз{strong_tag_close}{break_line_tag}бастап {deadline}, {platform_name} барлық студенттерден күрделі парольдерді талап етеді. Сіздің ағымдағы пароліңіз осы талаптарға сәйкес келмейді. Құпия сөзді қалпына келтіру үшін Тіркелгі параметрлері бөліміне өтіңіз {anchor_tag_open} {anchor_tag_close}.

source: The file must be smaller than {image_max_size} in size.
kk_kz: Файлдың салмағы {image_max_size}дан аз болуы қажет.

source: The file must be at least {image_min_size} in size.
kk_kz: Файл өлшемі кемінде {image_min_size} болуы керек.

source: The file must be one of the following types: {valid_file_types}.
kk_kz: Файл келесі түрлердің бірі болуы керек: {valid_file_types}.

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
kk_kz: Бұл файл үшін мазмұн түрінің тақырыбы файл деректеріне сәйкес келмейді. Файл бүлінуі мүмкін.

source: The file name extension for this file does not match the file data. The file may be corrupted.
kk_kz: Бұл файл үшін файл атауының кеңейтімі файл деректерімен бірдей емес. Файл бүлінуі мүмкін.

source: bytes
kk_kz: байттар

source: KB
kk_kz: КБ

source: MB
kk_kz: МБ

source: No file provided for profile image
kk_kz: Профиль кескініне арналған Файл қарастырылмаған

source: Path used to construct URLs to programs marketing pages (e.g., "/foo").
kk_kz: Бағдарламалардың маркетингтік беттеріне URL мекен-жайларын құру үшін қолданылатын жол (мысалы, "/foo").

source: Known Error Case
kk_kz: Қатенің Белгілі Жағдайы

source: Schedule start < course start
kk_kz: Кестенің басталуы < курстың басталуы

source: All
kk_kz: Барлығы

source: Schedules
kk_kz: Кестелер

source: Indicates if this schedule is actively used
kk_kz: Бұл кесте белсенді қолданылатындығын көрсетеді

source: Date this schedule went into effect
kk_kz: Осы кестенің күшіне енген күні

source: Deadline by which the learner must upgrade to a verified seat
kk_kz: Студенттің тексерілген орынға көшуі керек мерзім
