Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: After uploading an image, it is attached to this particular artice and can be used only here. Other users may replace the image, but older versions are kept. You probably want to show the image with a nice caption. To achieve this, press the Insert button and fill in the caption fields and possibly choose to have you image floating right or left of the content. You can use Markdown in the caption. The markdown code syntax for images looks like this, possible values for align are left/center/right:
kk_kz: Суретті жүктегеннен кейін ол осы нақты мақалаға қосылады және оны тек осы жерде қолдануға болады. Басқа пайдаланушылар суретті ауыстыра алады, бірақ ескі нұсқалары сақталады. Сіз суретті әдемі қолтаңбамен көрсеткіңіз келетін шығар. Ол үшін Кірістіру түймесін басып, қолтаңба өрістерін толтырыңыз және суреттің мазмұнның оң немесе сол жағында жүзуін таңдаңыз. Қолтаңбада белгілеуді пайдалануға болады. Кескіндерге арналған белгілеу кодының синтаксисі келесідей, туралау үшін мүмкін мәндер: сол жақта/ортада / оң жақта:

source: Links
kk_kz: Сілтемелер

source: Link to another wiki page
kk_kz: Басқа вики бетке сілтеме

source: Type in something from another wiki page's title and auto-complete will help you create a tag for you wiki link. Tags for links look like this:
kk_kz: Басқа вики бетінің тақырыбынан бір нәрсені енгізіңіз, ал автотолтыру вики сілтемесіне тег құруға көмектеседі. Сілтеме тегтері келесідей:

source: You can link to another website simply by inserting an address example.com or http://example.com or by using the markdown syntax:
kk_kz: Мекенжайды теру арқылы басқа веб-сайтқа өтуге болады example.com немесе http://example.com немесе markdown синтаксисінің көмегімен:

source: Notifications
kk_kz: Хабарламалар

source: When this article is edited
kk_kz: Осы мақала қашан редакцияланды

source: Also receive emails about article edits
kk_kz: Мақаланы түзету туралы хаттар да алу

source: Your notification settings were updated.
kk_kz: Сіздің хабарламаларды баптауларыңыз жаңартылған болатын.

source: Your notification settings were unchanged, so nothing saved.
kk_kz: Сіздің қол жеткізу құқықтарыңызды баптау өзгертілген жоқ, сақтайтын ештеңе жоқ.

source: %(user)s subscribing to %(article)s (%(type)s)
kk_kz: %(user)s жазылады %(article)s (%(type)s)

source: Article deleted: %s
kk_kz: Мақала жойылды: %s

source: Article modified: %s
kk_kz: Мақала өзгертілді: %s

source: New article created: %s
kk_kz: Жаңа мақала құрылды: %s

source: notifications
kk_kz: хабарламалар

source: No notifications
kk_kz: Хабарламалар табылмады

source: Clear notifications list
kk_kz: Хабарламалар тізімін тазарту

source: Search...
kk_kz: Іздеу ...

source: Sign up
kk_kz: Тіркелу

source: Article deleted
kk_kz: Артикл жойылды

source: The article you were looking for has been deleted.
kk_kz: Сіз іздеген мақала жойылды.

source: You may restore this article and its children by clicking restore.
kk_kz: Сіз осы мақаланы және оның балалар элементтерін қалпына келтіру түймесін басу арқылы қалпына келтіре аласыз.

source: You may remove this article and any children permanently and free their slugs by clicking the below button. This action cannot be undone.
kk_kz: Сіз осы мақаланы және кез-келген баланы біржола жойып, төмендегі батырманы басу арқылы оларды қоқыстардан босата аласыз. Бұл әрекетті жою мүмкін емес.

source: Listing articles in
kk_kz: Мақалалар тізімі

source: Up one level
kk_kz: Бір деңгейден жоғары

source: clear
kk_kz: Таза

source: article,articles
kk_kz: мақала,мақалалар

source: matches,match
kk_kz: сәйкестіктер,сәйкес

source: %(cnt)s %(articles_plur)s in this level %(match_plur)s your search.
kk_kz: %(cnt)s%(articles_plur)sбұл деңгейде%(match_plur)s сіздің іздеуіңіз.

source: There %(articles_plur_verb)s %(cnt)s %(articles_plur)s in this level.
kk_kz: Онда %(articles_plur_verb)s%(cnt)s%(articles_plur)sосы деңгейде.

source: Last modified
kk_kz: Соңғы өзгеріс

source: no log message
kk_kz: журналда хабарлама жоқ

source: Sorry, you don't have permission to view this page.
kk_kz: Кешіріңіз, сізде бұл бетті қарауға рұқсат жоқ.

source: Previewing revision
kk_kz: Редакцияны алдын ала қарау

source: Previewing merge between
kk_kz: Арасындағы біріктіруді алдын-ала қарау

source: and
kk_kz: и

source: Source of
kk_kz: Көзі

source: This article is currently locked for editing.
kk_kz: Қазіргі уақытта бұл мақала редакциялау үшін бұғатталған.

source: Log me in...
kk_kz: Жүйеге кіріңіз...

source: Don't have an account?
kk_kz: Сізде тіркелгі жоқ па?

source: Sign me up...
kk_kz: Мені жазыңыз...

source: Create root article
kk_kz: Түбір мақаласын жасаңыз

source: Congratulations!
kk_kz: Құттықтаймыз!

source: You have django-wiki installed... but there are no articles. So it's time to create the first one, the root article. In the beginning, it will only be editable by administrators, but you can define permissions after.
kk_kz: Сізде django-вики орнатылған... бірақ мақалалар жоқ. Сонымен, бірінші, түбірлік мақаланы жасау уақыты келді. Басында оны тек әкімшілер өңдей алады, бірақ сіз рұқсаттарды кейінірек анықтай аласыз.

source: Root article
kk_kz: Түбір мақала

source: Create root
kk_kz: Түбір жасау

source: You need to log in og sign up to use this function.
kk_kz: Бұл мүмкіндікті пайдалану үшін Жүйеге кіру немесе тіркелу қажет.

source: View Source
kk_kz: Көзді қарау

source: Sub-articles for
kk_kz: Үшін тармақшалар

source: No sub-articles
kk_kz: Қосалқы элементтер жоқ

source: ...and more
kk_kz: ...және басқа да көптеген

source: Browse articles in this level
kk_kz: Осы деңгейдегі мақалаларды қараңыз

source: New article next to
kk_kz: Жанында жаңа мақала

source: New article below
kk_kz: Төмендегі жаңа мақала

source: restored
kk_kz: қалпына келтірілген

source: unlocked
kk_kz: бұғатталған

source: You are now sign up... and now you can sign in!
kk_kz: Сіз тіркелдіңіз... енді кіре аласыз!

source: You are no longer logged in. Bye bye!
kk_kz: Сіз жүйеден шықтыңыз. Сау болыңыз!

source: You are now logged in! Have fun!
kk_kz: Сіз кірдіңіз! Көңіл көтеріңіз!

source: New article '%s' created.
kk_kz: Жаңа '%s' мақала құрылды.

source: There was an error creating this article: %s
kk_kz: Осы мақаланы құруда қате орын алды: %s

source: There was an error creating this article.
kk_kz: Осы мақаланы құруда қате орын алды.

source: This article cannot be deleted because it has children or is a root article.
kk_kz: Осы мақала еншілес немесе түбірлік болып табылатын болғандықтан, жойылмайды.

source: This article together with all its contents are now completely gone! Thanks!
kk_kz: Осы мақала оның мазмұнымен бірге толық жойылған болатын! Рахмет!

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
kk_kz: "%s" мақала жойылған ретінде белгіленген! Осы сайттың жағымсыз материалдан бос мазмұны үшін рахмет!

source: Your changes were saved.
kk_kz: Сіздің өзгертулеріңіз сақталған болатын.

source: A new revision of the article was successfully added.
kk_kz: Мақаланың жаңа редакциясы сәтті қосылды.

source: Restoring article
kk_kz: Мақаланы қалпына келтіру

source: The article "%s" and its children are now restored.
kk_kz: \"%s\" мақала және оның еншілес мақалалары қалпына келтірілген болатын.

source: The article %(title)s is now set to display revision #%(revision_number)d
kk_kz: Енді мақала %(title)s редакцияны көрсетуге арналған #%(revision_number)d

source: New title
kk_kz: Жаңа атауы

source: Merge between Revision #%(r1)d and Revision #%(r2)d
kk_kz: #%(r1)d және #%(r2)d ревизиялардың қосылуы

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
kk_kz: Жаңа ревизия құрылған болатын: #%(r1)d және #%(r2)d ревизиялардың қосылуы

source: Courses from leading teachers
kk_kz: Курсы от ведущих преподавателей

source: Menu
kk_kz: Мәзір

source: MOOC Competition
kk_kz: ЖАОК Байқауы

source: For authors/developers
kk_kz: Автор/әзірлеушілерге

source: Integration of MOOCs into LP
kk_kz: ЖАОК оқу үрдісіне интеграциялау

source: Al-Farabi Kazakh National University is the leader among Kazakhstani universities in implementing MOOCs on the Open edX platform.
kk_kz: Open edX ашық платформасында ЖАОК-ны ендіру бойынша Қазақстандағы жоғары білім көшбасшысы Әл-Фараби атындағы ҚазҰУ

source: ADVANTAGES OF MASS OPEN ONLINE COURSES
kk_kz: ЖАППАЙ АШЫҚ ОНЛАЙН КУРСТАРДЫҢ АРТЫҚШЫЛЫҒЫ

source: ass character
kk_kz: ассовость

source: Hundreds and thousands of students in one course
kk_kz: Бір курста жүздеген және мыңдаған тыңдаушы

source: penness
kk_kz: ткрытость

source: All courses are available in the public domain
kk_kz: Барлық курстарға қол жеткізу ашық

source: Online mode
kk_kz: Онлайн режим

source: Mass character
kk_kz: Жаппай

source: Openness
kk_kz: Ашық

source: Comfort
kk_kz: Кез-келген уақытта қолжетімді

source: nline mode
kk_kz: нлайн режим

source: Independence from geographical location
kk_kz: Географиялық тәуелсіздік

source: C
kk_kz: К

source: omfort
kk_kz: омфортность

source: Everyone chooses their own pace of learning
kk_kz: Әркім оқу қарқынын өзі таңдайды

source: TRAINING IN 3 STEPS
kk_kz: 3 ҚАДАМДА ОҚУ

source: Registration to the platform
kk_kz: Платформаға тіркелу

source: Choosing a course
kk_kz: Курсты таңдау

source: Registration for the course
kk_kz: Курсқа тіркелу

source: OUR COURSES
kk_kz: БІЗДІҢ КУРСТАР

source: All courses
kk_kz: Барлық курстар

source: SOME STATISTICS
kk_kz: СТАТИСТИКА

source: Registered users
kk_kz: Тіркелген тыңдаушылар

source: Directions
kk_kz: Бағыттар

source: Visitors per day
kk_kz: Күнделікті келушілер

source: Al-Farabi Kazakh National University
kk_kz: Әл-Фараби атындағы ҚазҰУ

source: About Us
kk_kz: Орталық туралы

source: ONLINE COURSES
kk_kz: ЖЕТЕКШІ ОҚЫТУШЫЛАРДЫҢ

source: FROM LEADING TEACHERS
kk_kz: ОНЛАЙН КУРСТАРЫ

source: is the leader of the Higher school of Kazakhstan in implementing MOOC on the Open edX platform
kk_kz: Open edX ашық платформасында ЖАОК-ны ендіру бойынша Қазақстандағы жоғары білім көшбасшысы

source: Competition for the selection of pedagogical scenarios of online courses
kk_kz: Педагогикалық сценарийлерін іріктеу байқауы

source: About the contest
kk_kz: Байқау жайлы

source: The Institute of New Educational Technologies (INOT) accepts applications for participation in the competition of pedagogical scenarios for the creation and publication of online courses (MOOC/SPOC).
kk_kz: Жаңа білім беру технологиялары институты (ЖББТИ) онлайн курстарды (MOOC/SPOC) әзірлеу және жариялау үшін педагогикалық сценарийлердің байқауына қатысуға арналған өтініштерді қабылдайды.

source: The competition can be attended by both creative teams of structural divisions of the university, and individual pedagogical or scientific workers of the University.
kk_kz: Онлайн курстардың педагогикалық сценарийлерін іріктеу байқауында университеттің құрылымдық бөлімшелерінің шығармашылық ұжымдары, университеттің жеке педагогикалық немесе ғылыми қызметкерлері қатыса алады.

source: The competition is held in the following order:
kk_kz: Байқау келесі кезекте өтеді:

source: Stage 1 - registration and submission of applications until 25.01.2021
kk_kz: 1-кезең – өтініштерді рәсімдеу және жіберу.

source: Stage 2 - public defense of pedagogical scenarios of online courses until 02/26/2021.
kk_kz: 2-кезең – онлайн курстардың педагогикалық сценарийлерін көпшілік алдында қорғау.

source: Stage 3 - examination of applications for compliance with the requirements for the content, technology and methodology of the development of pedagogical scenarios, determination of winners by the decision of the competition commission by 01.03.2021.
kk_kz: 3-кезең – педагогикалық сценарийлерді әзірлеудің мазмұны, технологиясы мен әдістемесіне қойылатын талаптарға сәйкестігіне өтінімдерді сараптау, байқау комиссиясының шешімі бойынша жеңімпаздарды анықтау.

source: Stage 4 - approval of the results of the competition by 05.03.2021.
kk_kz: 4-кезең – байқау нәтижелерін бекіту.

source: Requirements for the form and content of the application
kk_kz: Өтініш формасы мен мазмұнына қойылатын талаптар

source: Cover letter
kk_kz: Ілеспе хат

source: rus
kk_kz: рус

source: kaz
kk_kz: қаз

source: Pedagogical scenario of the online course
kk_kz: Онлайн курстың педагогикалық сценарийі

source: Link to a video recording of one lecture
kk_kz: Бір лекцияның бейнежазбасының сілтемесі

source: Link to the online course certificate
kk_kz: курсының сертификатына сілтеме

source: Theory and practice of creating an online course
kk_kz: Теория и практика создания онлайн курса

source: Information about the authors of the online course
kk_kz: Онлайн курс авторлары туралы мәлімет

source: Submit an application
kk_kz: Өтініш беру

source: Fill out the form
kk_kz: ФОРМАНЫ ТОЛТЫРЫҢЫЗ

source: For all questions, please contact the Office of Academic and Digital Innovation: building - rectorate, office {room}, phone {str}.
kk_kz: Барлық сұрақтар бойынша Академиялық және цифрлық инновациялар кеңсесімен байланысыңыз: корпус – ректорат, {room} каб., тел. {str}.

source: According to the results of the competition, the commission will be allowed to develop and issued 10 MOOCs and 10 SPOCs.
kk_kz: Конкурс нәтижесі бойынша әзірлеу мен жүзеге асыруға 10 MOOC және 10 SPOC қабылданады.

source: Stage 1 - registration and submission of applications until {str}
kk_kz: Кезең 1 – өтінімдерді дайындау және ұсыну {str} ж. дейін.

source: Stage 2 - public defense of pedagogical scenarios of online courses until {str}
kk_kz: Кезең 2 – онлайн курстардың педагогикалық сценарийлерін көпшілік алдында қорғау {str} ж. дейін.

source: Stage 3 - examination of applications for compliance with the requirements for the content, technology and methodology of the development of pedagogical scenarios, determination of winners by the decision of the competition commission by {str}
kk_kz: Кезең 3 – педагогикалық сценарийлерді әзірлеудің мазмұны, технологиясы мен әдістемесіне қойылатын талаптарға сәйкестігіне өтінімдерді сараптау, байқау комиссиясының шешімі бойынша жеңімпаздарды анықтау {str} ж. дейін.

source: Stage 4 - approval of the results of the competition by {str}
kk_kz: Кезең 4 – байқаудың нәтижелерін бекіту {str} ж. дейін.

source: The Office of Academic and Digital Innovation accepts applications for participation in the competition of pedagogical scenarios for the creation and publication of online courses (MOOC/SPOC).
kk_kz: Академиялық және цифрлық инновациялар кеңсесі онлайн курстарды (MOOC/SPOC) әзірлеу және жариялау үшін педагогикалық сценарийлердің байқауына қатысуға арналған өтініштерді қабылдайды.

source: Date of creation
kk_kz: Құрылған күні

source: ОНЛАЙН КУРСТЫ ӘЗІРЛЕУ
kk_kz: СОЗДАНИЕ ОНЛАЙН КУРСА

source: Requirements for the design of an online course
kk_kz: Онлайн-курсты ресімделүіне қойылатын талаптар

source: Methodological requirements for the design of the course
kk_kz: Курстың рәсімделуіне қойылатын әдістемелік талаптар

source: e-UMKD
kk_kz: е-ПОӘК

source: E-Syllabus
kk_kz: Е-Силлабус

source: Announcements for listeners &ndash; 1 per module
kk_kz: Тыңдаушыларға арналған хабарлама &ndash; әрбір модульге 1

source: Questionnaires questionnaires at the entrance and exit of the course
kk_kz: Курсқа кірерде және шығарда алынатын анкета сауалнамасы

source: Synopsis with a list of used sources &ndash; 1 for each topic
kk_kz: Пайдаланылған әдебиет тізімі бар конспекті &ndash; әрбір тақырыпқа 1

source: Presentation &ndash; 1 for each topic
kk_kz: Презентация &ndash; әрбір тақырыпқа 1

source: Additional course materials with active links for reading and viewing online: books, monographs, textbooks, textbooks, documentaries and feature films, TV shows, etc.
kk_kz: Онлайн режимде оқуға және қарауға арналған белсенді сілтемелері бар қосымша материалдар: кітаптар, монографиялар, оқулықтар, оқу құралдары, деректі және көркем фильмдер, телебағдарламалар және т.б.

source: Training questions &ndash; at least 10 for each module
kk_kz: Жаттығу сұрақтараы &ndash; әрбір модульге 10-нан кем емес

source: Questions for discussion &ndash; in each module at least 1
kk_kz: Талқылауға арналған сұрақтар &ndash; әрбір модульде 1-ден кем емес

source: Test tasks &ndash; at least 3 training and 10 graded questions for each module
kk_kz: Тест тапсырмалары &ndash; әрбір модульге кем дегенде 3 жаттығу және 10 бағаланатын сұрақтар

source: Peer-to-peer assessment tasks &ndash; no more than 1-2 for the course
kk_kz: Өзара тексеру тапсырмалары (peer-to-peer) &ndash; курсқа 1-2 көп емес

source: Academic presentation of an online course
kk_kz: Онлайн курстың академиялық презентациясы

source: Expected Learning outcomes (RO)
kk_kz: Күтілетін оқыту нәтижелері (ОН)

source: Measurable learning goals
kk_kz: Оқудың өлшенетін мақсаттары

source: Indicators of achievement of RO
kk_kz: Оқыту нәтижелеріне жеткізу индикаторлары

source: The language of the course is a student-oriented language, accessible to a diverse audience
kk_kz: Курс тілі &ndash; әр түрлі аудиторияға қол жетімді, білім алушыларға бағытталған тіл

source: The duration of the course is not less than 4 and not more than 15 weeks
kk_kz: Курс ұзақтығы &ndash; 4 аптадан кем емес және 15 аптадан аспайтын

source: The load per week on the listener is not less than 2 and not more than 5 hours
kk_kz: Тыңдаушыға бір аптаға берілетін жүктеме &ndash; 2 сағаттан кем емес және 5 сағаттан аспайтын

source: Technical requirements for the video for the course
kk_kz: Курстың видеосына қойылатын техникалық талаптар

source: Video shooting should be carried out on professional video equipment with video track parameters not lower than the following indicators:
kk_kz: Бейнежазбаны келесі көрсеткіштерден төмен емес бейне трек параметрлері бар кәсіби бейнежабдықтарда жүргізген жөн:

source: Timing
kk_kz: Хронометраж

source: Welcome video/Promo video of the course &ndash; no more than 3 minutes
kk_kz: Сәлемдесу бейнежазбасы/Курстың промо ролигі &ndash; 3 минуттан артық емес

source: Introduction to the course (purpose, tasks, structure, types of tasks) &ndash; 1.5 minutes
kk_kz: Курсқа кіріспе (introduction) (мақсаты, міндеті, құрылымы, тапсырма түрлері) &ndash; 1,5 мин

source: Video lecture &ndash; 3-9 minutes
kk_kz: Бейнедәріс &ndash; 3-9 минут

source: Video (in total) for 1 week &ndash; not less than 15 and not more than 30 minutes
kk_kz: Видео (жалпы алғанда) 1 аптаға &ndash; 15 минуттан кем емес және 30 минуттан аспау керек

source: Technical requirements
kk_kz: Техникалық талаптар

source: File format (container) &ndash; MP4
kk_kz: Файл форматы (контейнер) &ndash; MP4

source: Codec - H264
kk_kz: Кодек - Н264

source: Resolution: 1920 x 1080 (1080p)
kk_kz: Өлшемі – 1920х1080 (1080р)

source: The aspect ratio is 16:9
kk_kz: Экран арақатынасы – 16:9

source: Frame rate 25 or 30 frames per second
kk_kz: Секундына 25 немесе 30 кадр жиілікте

source: Progressive scan (25p/30p)
kk_kz: Прогрессивті жайма (25р/30р)

source: Bitrate is not lower than 10000 kbit per second, but not more than 30,000 kbit per second
kk_kz: Битрейт секундына 10000 кбиттен төмен емес, және 30000 кбиттен аспау керек

source: Audio
kk_kz: Аудио

source: Codec: AAC, AC3, OGG, mp3
kk_kz: Кодек: ААС, АС3, OGG, mp3

source: channels: 2 (stereo)
kk_kz: каналдар: 2 (стерео)

source: sampling rate: 48 kHz
kk_kz: дискретизация жиілігі: 48кГц

source: audio stream: CBR not lower than 192 kbit/s, VBR in the range of 160-320 kbit/s
kk_kz: дыбыс ағыны: CBR 192 кбит/с төмен емес, VBR 160-320 кбит/с диапазонында

source: Qualitative characteristics of the audio track
kk_kz: Дыбыс жолағының сапалық сипаттамасы

source: The audio track should be in real stereo mode, where the teacher&#39;s voice is localized strictly between the left and right channels. Sound effects, noises, music can be in a similar mode, or can be implemented in a full-fledged stereo mode, depending on artistic and technical tasks.
kk_kz: Дыбыстық жолақ шынайы стерео форматында болуы керек, мұнда мұғалімнің дауысы сол және оң каналдар арасында қатаң түрде локализацияланған. Дыбыстық эффектілер, шулар, музыка ұқсас режимде болуы мүмкін немесе көркемдік-техникалық мәселелерге байланысты толыққанды стерео режимде жүзеге асырылуы мүмкін.

source: The stereo track must be technically implemented taking into account the possibility of playback on monophonic equipment. The value of the correlometer should correspond to &laquo;0&raquo; +/-0.5.
kk_kz: Стерео жолақ моно жабдықта ойнау мүмкіндігін ескере отырып, техникалық түрде орындалуы тиіс. Коррелометрдің мәні «0» +/- 0,5 сәйкес болуы керек.

source: The signal-to-noise ratio must be at least 40 dB.
kk_kz: Сигналдың шуылға қатынасы кемінде 40 дБ болуы керек.

source: The dynamic range of the useful signal (whisper/loud speech) should be no more than 16 dB.
kk_kz: Пайдалы сигналдың динамикалық диапазоны (сыбырлау / қатты сөйлеу) 16 дБ аспауы керек.

source: The average RMS volume level should be from - 14dB to - 12dB.
kk_kz: Орташа RMS дыбыс деңгейі -14дБ -12дБ аралығында болуы керек.

source: The peak volume level should be limited to -2 dB.
kk_kz: Дыбыс деңгейі шыңы -2 дБ шектелуі керек.

source: Qualitative characteristics of the presentation design for the video
kk_kz: Видеоға арналған презентацияның рәсімделуінің сапалық сипаттамалары

source: The font is recommended to use sans serif.
kk_kz: Кертілмеген қаріпті қолдану ұсынылады.

source: It is not recommended to use more than 2 fonts per course.
kk_kz: Бір курста 2 шрифтен артық қолдану ұсынылмайды.

source: The bulits should be the same throughout the course.
kk_kz: Курста буллиттер бірдей болуы керек.

source: To increase readability, it is recommended to use contrasting combinations of text and background colors.
kk_kz: Оқылымды жақсарту үшін мәтін мен өң түстерінің қарама -қарсы комбинациясын қолдану ұсынылады.

source: It is not recommended to use more than 3 font colors per course.
kk_kz: Бір курста 3 қаріптен артық түс қолдану ұсынылмайды.

source: It is not recommended to use contrasting font colors inside one sentence, paragraph, table.
kk_kz: Параграфтың қарама -қарсы түстерін абзацтың немесе кестенің бір сөйлемінде қолдану ұсынылмайды.

source: If the background color of the tables is required inside the course, then it is not recommended to use contrasting colors relative to the main background, a small semitone in the light or dark side is enough.
kk_kz: Егер курс барысында кестелердің фондық түсін қолдану қажет болса, онда негізгі фонға қатысты қарама -қарсы түстерді қолдану ұсынылмайды, ашық немесе қараңғы жақтағы кішкене жартылай тон жеткілікті.

source: The thickness of the frames, table lines, arrows, should correspond to the thickness of the font line.
kk_kz: Рамкалардың, кесте сызықтарының, көрсеткілердің қалыңдығы қаріп сызығының қалыңдығына сәйкес келуі керек.

source: As part of the course, it is advisable to use photographic, hand-drawn, animated material in a single color solution, with the same frames, shadows.
kk_kz: Курс шеңберінде фотографиялық, сызылған, анимациялық материалды бір түсті шешімде, сол кадрлармен, көлеңкелермен қолданған жөн.

source: It is recommended to use pictograms and infographics.
kk_kz: Пиктограмма мен инфографиканы қолдану ұсынылады.

source: To ensure a natural viewing experience, it is not recommended to join scenes of the same size.
kk_kz: Табиғи көру тәжірибесі үшін бірдей көлемдегі көріністерді біріктіру ұсынылмайды.

source: When shooting, it is not recommended to use contrasting, colorful elements of clothing and makeup.
kk_kz: Түсірілім кезінде контрастын, түрлі -түсті киімдер мен жезден жасалған бұйымдарды қолдану ұсынылмайды.

source: When filming a teacher, it is not recommended to use checkered elements of clothing and striped clothing.
kk_kz: Оқытушыны бейнежазбаға түсіргенде шаршы бар киімді және жолақты киімді қолдану ұсынылмайды.
