Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

# month name
source: February
kk_kz: февраля

# month name
source: March
kk_kz: марта

# month name
source: April
kk_kz: апреля

# month name
source: May
kk_kz: мая

# month name
source: June
kk_kz: июня

# month name
source: July
kk_kz: июля

# month name
source: August
kk_kz: августа

# month name
source: September
kk_kz: сентября

# month name
source: October
kk_kz: октября

# month name
source: November
kk_kz: ноября

# month name
source: December
kk_kz: декабря

source: The file must end with the extension '{file_types}'.
kk_kz: Файл должен иметь расширение '{file_types}'.

source: Maximum upload file size is {file_size} bytes.
kk_kz: Жүктелген файлдың максималды мөлшері - {file_size} байт.

source: Course {course_id} requires {prerequisite_course_id}
kk_kz: {course_id} курсы {prerequisite_course_id} талап етеді

source: System defined milestone
kk_kz: Жүйе анықталған кезең

source: Your password must contain {length_instruction}, including {complexity_instructions}.
kk_kz: Сіздің пароліңізде {length_instruction}, соның ішінде {complexity_instructions} болуы керек.

source: Your password must contain {length_instruction}.
kk_kz: Сіздің пароліңізде {length_instruction} болуы керек.

source: Invalid password.
kk_kz: Жарамсыз пароль.

source: To disable the XBlock and prevent rendering in the LMS, leave "Enabled" deselected; for clarity, update XBlockStudioConfiguration support state accordingly.
kk_kz: XBLOCK-ты өшіру және LMS-де визуализацияны болдырмау үшін "қосулы" күйде қалдырыңыз; түсінікті болу үшін XBlockStudioConfiguration қолдау күйін сәйкесінше жаңартыңыз.

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
kk_kz: Курстың қосымша модульдерінің тізімінде көрсетілген X блоктарын ғана ескірген деп атауға болады. Xblockstudioconfiguration қолдау күйін сәйкесінше жаңартуды ұмытпаңыз, өйткені ескіру Studio-да жаңа xblock даналарын жасау мүмкіндігіне әсер етпейді.

source: XBlock/template combinations that are disabled cannot be edited in Studio, regardless of support level. Remember to also check if all instances of the XBlock are disabled in XBlockConfiguration.
kk_kz: Қолдау деңгейіне қарамастан, Xblock/шаблондардың өшірілген комбинацияларын студияда өңдеу мүмкін емес. Xblock конфигурациясындағы барлық xblock даналарының өшірілгенін тексеріңіз.

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
kk_kz: Толық немесе алдын-ала қолдауы бар xblock/шаблондардың комбинациялары студияда әрқашан жасалуы мүмкін. Қолдау көрсетілмейтін xblock/шаблон комбинациясы үшін курс авторының келісімі қажет.

source: show deprecation messaging in Studio
kk_kz: Студияда ескірген хабарларды көрсету

source: Fully Supported
kk_kz: Толық қолдау

source: Provisionally Supported
kk_kz: Алдын ала тәртіпте қолдау көрсетіледі

source: Unsupported
kk_kz: Қолдау көрсетілмеген

source: Cannot rescore problems with possible file submissions
kk_kz: Жіберіліп қойылуы мүмкін файлдары бар тапсырманы қайта бағалай алмаймын

source: Incorrect
kk_kz: Дұрыс емес

source: Correct
kk_kz: Дұрыс

source: correct
kk_kz: дұрыс

source: incorrect
kk_kz: қате

source: partially correct
kk_kz: ішінара дұрыс

source: incomplete
kk_kz: аяқталмаған

source: unanswered
kk_kz: жауап жоқ

source: submitted
kk_kz: Тапсырылған

source: processing
kk_kz: орындалу үстінде

source: This answer is correct.
kk_kz: Бұл жауап дұрыс

source: This answer is incorrect.
kk_kz: Бұл жауап дұрыс емес.

source: This answer is partially correct.
kk_kz: Бұл жауап жартылай дұрыс.

source: This answer is being processed.
kk_kz: Бұл жауап өңделуде.

source: Not yet answered.
kk_kz: Әлі жауап берілмеген.

source: Select an option
kk_kz: Опцияны таңдаңыз

source: ChoiceGroup: unexpected tag {tag_name}
kk_kz: Таңдау тобы: күтпеген тег {tag_name}

source: Answer received.
kk_kz: Жауап алынған.

source: Expected a <choice> or <compoundhint> tag; got {given_tag} instead
kk_kz: Күтілетін тег <choice> немесе <compoundhint> ; оның орнына {given_tag} алынды

source: Your files have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
kk_kz: Сіздің файлдарыңыз жіберілді. Сіздің өтінішіңіз бағаланғаннан кейін, бұл хабарлама бағалаушының пікірімен ауыстырылады.

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
kk_kz: Сіздің жауап қабылданды. Ол бағаланған бойдан осы хабардың орнына Сіздің бағаңыз пайда болады.

source: {programming_language} editor
kk_kz: редактор {programming_language}

source: Press ESC then TAB or click outside of the code editor to exit
kk_kz: Чтобы выйти, нажмите ESC и затем TAB или щёлкните вне редактора кода.

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
kk_kz: Қабылданды. Жауап алынған бойдан осы хабардың орнына жауаптың мазмұны пайда болады.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
kk_kz: Xqueue-ден {xqueue_timeout} секунд жауап жоқ. Кері қайтарылды.

source: Error running code.
kk_kz: Кодты іске қосуда қате кетті.

source: Cannot connect to the queue
kk_kz: Кезекке қосылу мүмкін емес

source: No formula specified.
kk_kz: Формула көрсетілмеген.

source: Couldn't parse formula: {error_msg}
kk_kz: Формуланы талдау мүмкін емес: {error_msg}

source: Error while rendering preview
kk_kz: Алдын ала қарау қатесі

source: Sorry, couldn't parse formula
kk_kz: Кешіріңіз, формуланы талдай алмадым

source: {input_type}: unexpected tag {tag_name}
kk_kz: {input_type}: күтпеген тег {tag_name}

source: Expected a {expected_tag} tag; got {given_tag} instead
kk_kz: Требуется тег {expected_tag}. Вместо него введён тег {given_tag}.

source: Question {index}
kk_kz: Сұрақ {index}

source: Correct:
kk_kz: Дұрыс:

source: Incorrect:
kk_kz: Қате:

source: Answer
kk_kz: Жауап

source: Error {err} in evaluating hint function {hintfn}.
kk_kz: {hintfn} еске түсіру функциясын бағалаудағы {err} қатесі.

source: (Source code line unavailable)
kk_kz: (Бастапқы код жолы қол жетімді емес)

source: See XML source line {sourcenum}.
kk_kz: XML {sourcenum} бастапқы жолын көрсету.

source: Checkboxes
kk_kz: Флажки

source: Multiple Choice
kk_kz: Выбор варианта

source: Do not use shuffle and answer-pool at the same time
kk_kz: shuffle және answer-pool бір уақытта пайдаланбаңыз

source: answer-pool value should be an integer
kk_kz: answer-pool мәні бүтін сан болу тиіс

source: Choicegroup must include at least 1 correct and 1 incorrect choice
kk_kz: Choicegroup ең болмағанда 1 дұрыс және 1 қате таңдауды қамту тиіс

source: True/False Choice
kk_kz: Рас / Жалған таңдау

source: Dropdown
kk_kz: Выпадающий список

source: Numerical Input
kk_kz: Цифровой ввод

source: There was a problem with the staff answer to this problem.
kk_kz: Возникла проблема с ответом сотрудников курса на это задание

source: Could not interpret '{student_answer}' as a number.
kk_kz: '{student_answer}' сандық мәнін анықтау мүмкін болмады.

source: Factorial function evaluated outside its domain:'{student_answer}'
kk_kz: Өз саласынан тыс бағаланатын факторлық функция: '{student_answer}'

source: Invalid math syntax: '{student_answer}'
kk_kz: Рұқсат етілмеген математикалық белгі:'{student_answer}'

source: You may not use complex numbers in range tolerance problems
kk_kz: В задачах на допустимые значения нельзя использовать комплексные числа.

source: There was a problem with the staff answer to this problem: complex boundary.
kk_kz: Курс қызметкерлерінің осы тапсырмаға жауабы бар проблема анықталды: жиынтықтың шекарасы.

source: There was a problem with the staff answer to this problem: empty boundary.
kk_kz: Курс қызметкерлерінің осы тапсырмаға жауабы бар проблема анықталды: бос шекара.

source: or
kk_kz: или

source: Text Input
kk_kz: Текстовый ввод

source: error
kk_kz: қате

source: Custom Evaluated Script
kk_kz: Таңдамалы Бағаланған Сценарий

source: error getting student answer from {student_answers}
kk_kz: {student_answers}-дан оқушы жауабын алғанда қате

source: No answer entered!
kk_kz: Жауап енгізілмеді!

source: CustomResponse: check function returned an invalid dictionary!
kk_kz: Отзыв: функция проверки вернула недопустимое значение словаря

source: Symbolic Math Input
kk_kz: Символдық Математиканы енгізу

source: An error occurred with SymbolicResponse. The error was: {error_msg}
kk_kz: SymbolicResponse-те қате пайда болды. Мындай қате: {error_msg}

source: Code Input
kk_kz: Кодты Енгізу

source: No answer provided.
kk_kz: Жауап берілмеді.

source: Error: No grader has been set up for this problem.
kk_kz: Ошибка: для данного задания не назначен способ оценивания

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
kk_kz: Сіздің бағаға жауабыңызды тапсыру мүмкін болмады (Себеп: {error_msg}). Кейінірек қайталап көріңіз.

source: Invalid grader reply. Please contact the course staff.
kk_kz: Жауап алу мүмкін емес. Курс үшін жауаптылармен хабарласыңыз.

source: External Grader
kk_kz: Сыртқы сұрыптаушы

source: Math Expression Input
kk_kz: Ввод математического выражения

source: Factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
kk_kz: Бұл мәселеге жауап ретінде факторлық функция рұқсат етілмеген. Берілген жауап: {bad_input}

source: Invalid input: Could not parse '{bad_input}' as a formula.
kk_kz: Қате енгізу: '{bad_input}' формула ретінде белгілеу мүмкін емес.

source: Invalid input: Could not parse '{bad_input}' as a formula
kk_kz: Неверный ввод: Невозможно определить '{bad_input}' в качестве формулы.

source: Circuit Schematic Builder
kk_kz: Конструктор электросхем

source: Error in evaluating SchematicResponse. The error was: {error_msg}
kk_kz: Пікірді бағалаудағы қате. Мынай қате болып табылады: {error_msg}

source: Image Mapped Input
kk_kz: Ввод пометки на изображении

source: error grading {image_input_id} (input={user_input})
kk_kz: қателерді бағалау {image_input_id} (input={user_input})

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
kk_kz: Мәселені сипаттаудағы қате! Тіктөртбұрышты бөлшектеу мүмкін емес {sr_coords}

source: Annotation Input
kk_kz: Аннотацияларды енгізу

source: Checkboxes With Text Input
kk_kz: Мәтін Енгізу Құсбелгілері

source: Answer not provided for {input_type}
kk_kz: Жауабы жоқ {input_type}

source: The Staff answer could not be interpreted as a number.
kk_kz: Қызметкердің жауабы сан ретінде қабылдана алмайды.

source: Could not interpret '{given_answer}' as a number.
kk_kz: '{given_answer}' сандық мәнін анықтау мүмкін болмады.

source: XML data for the annotation
kk_kz: Аңдатпа үшін XML мәліметтер

source: The display name for this component.
kk_kz: Отображаемое название компонента

source: Annotation
kk_kz: Аннотация

source: Blank Advanced Problem
kk_kz: Пустая задача: XML-редактор

source: Number of attempts taken by the student on this problem
kk_kz: Студенттің осы мәселе бойынша жасаған әрекеттерінің саны

source: Maximum Attempts
kk_kz: Әрекеттің максималды саны

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
kk_kz: Оқушы бұл мәселеге қанша рет жауап беруге тырысатындығын анықтайды. Егер мән берілмесе, шексіз әрекеттерге жол беріледі.

source: Date that this problem is due by
kk_kz: Бұл мәселені шешу керек күн

source: Amount of time after the due date that submissions will be accepted
kk_kz: Өтінімдер қабылданатын белгіленген күннен кейінгі уақыт мерзімі

source: Show Results
kk_kz: Нәтижелерді көрсету

source: Defines when to show whether a learner's answer to the problem is correct. Configured on the subsection.
kk_kz: Оқушының мәселеге жауабы дұрыс екенін қашан көрсету керек екенін анықтайды. Бөлімшеде реттелген.

source: Always
kk_kz: Әрқашан

source: Never
kk_kz: Ешқашан

source: Past Due
kk_kz: Мерзімі өткен

source: Show Answer
kk_kz: Жауапты көрсету

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
kk_kz: Мәселенің жауабын қашан көрсету керектігін анықтайды. Әдепкі мәнді қосымша параметрлерде орнатуға болады.

source: Answered
kk_kz: Жауап берді

source: Attempted
kk_kz: Әрекет етілген

source: Closed
kk_kz: Жабық

source: Finished
kk_kz: Аяқталған

source: Correct or Past Due
kk_kz: Дұрыс немесе мерзімі өткен

source: Whether to force the save button to appear on the page
kk_kz: Беттегі "Сақтау" түймесін мәжбүрлі түрде көрсету керек пе

source: Show Reset Button
kk_kz: Ысыру Батырмасын Көрсету

source: Determines whether a 'Reset' button is shown so the user may reset their answer. A default value can be set in Advanced Settings.
kk_kz: Пайдаланушы жауабын қалпына келтіре алатындай етіп "қалпына келтіру" батырмасының көрсетілгенін анықтайды. Әдепкі мәнді қосымша параметрлерде орнатуға болады.

source: Randomization
kk_kz: Кездейсоқтық жасау

source: Defines when to randomize the variables specified in the associated Python script. For problems that do not randomize values, specify "Never".
kk_kz: Определяет, когда следует использовать случайные значения переменных, указанных в сценарии на языке Python. Для задач, не требующих подстановки случайного значения переменных, выберите «Никогда».

source: On Reset
kk_kz: Тастау Кезінде

source: Per Student
kk_kz: Әрбір студентке

source: XML data for the problem
kk_kz: Мәселені шешуге арналған XML деректері

source: Dictionary with the correctness of current student answers
kk_kz: Оқушылардың ағымдағы жауаптарының дұрыстығы туралы сөздік

source: Dictionary for maintaining the state of inputtypes
kk_kz: Inputtypes типтерінің күйін сақтауға арналған сөздік

source: Dictionary with the current student responses
kk_kz: Оқушылардың ағымдағы жауаптары бар сөздік

source: Dictionary with the current student score
kk_kz: Студенттің ағымдағы ұпайы бар сөздік

source: Whether or not the answers have been saved since last submit
kk_kz: Жауаптар соңғы жіберілген сәттен бастап сақталды ма, жоқ па

source: Whether the student has answered the problem
kk_kz: Студент мәселеге жауап берді ме

source: Random seed for this student
kk_kz: Бұл студент үшін кездейсоқ материал

source: Last submission time
kk_kz: Соңғы тапсыру уақыты

source: Timer Between Attempts
kk_kz: Әрекеттер Арасындағы Таймер

source: Seconds a student must wait between submissions for a problem with multiple attempts.
kk_kz: Студент бірнеше әрекетті шешу үшін жіберулер арасында күтуі керек секундтар.

source: Problem Weight
kk_kz: Салмақ Мәселесі

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
kk_kz: Әр тапсырманың ұпай санын анықтайды. Егер мән берілмесе, тапсырмадағы әр жауап өрісі бір баллға тұрарлық.

source: Markdown source of this module
kk_kz: Осы модульді белгілеу көзі

source: Source code for LaTeX and Word problems. This feature is not well-supported.
kk_kz: LaTeX және Word тапсырмаларының бастапқы коды. Бұл функция дұрыс қолдау көрсетілмейді.

source: Enable LaTeX templates?
kk_kz: LaTeX үлгілерін қосу керек пе?

source: Matlab API key
kk_kz: Matlab API кілті

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use by this course for the specified duration. Please do not share the API key with other courses and notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
kk_kz: Орналастырылған MATLAB қызметіне кіру үшін MathWorks ұсынған API кілтін енгізіңіз. Бұл кілт көрсетілген мерзімге осы курсты ерекше пайдалану үшін беріледі. API кілтін басқа курстармен бөліспеңіз және егер сіз кілт ашылған немесе бұзылған деп ойласаңыз, MathWorks-қа дереу хабарлаңыз. Курстың кілтін алу немесе мәселе туралы хабарлау үшін хабарласыңыз moocsupport@mathworks.com

source: Submit
kk_kz: Жіберу

source: Submitting
kk_kz: Тапсыру

source: Warning: The problem has been reset to its initial state!
kk_kz: Назар аударыңыз: Тапсырма бастапқы жай-күйге шығарып тасталды!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
kk_kz: Тапсырма жарамсыз өтінімге байланысты зақымдалған болатын. Тапсырма мыналардан тұратын:

source: If this error persists, please contact the course staff.
kk_kz: Егер қате туралы осы хабар пайда бола берсе, курстың қызметкерлерімен хабарласыңыз.

source: Hint ({hint_num} of {hints_count}):
kk_kz: ({hint_num} of {hints_count}) тұспалы:

source: Your answers were previously saved. Click '{button_name}' to grade them.
kk_kz: Сіздің жауаптарыңыз бұрын сақталған. Оларды бағалау үшін '{button_name}' түймесін басыңыз.

source: Incorrect ({progress} point)
kk_kz: Неверно ({progress} балл)

source: Correct ({progress} point)
kk_kz: Верно ({progress} балл)

source: Partially correct ({progress} point)
kk_kz: Частично верно ({progress} балл)

source: Partially Correct
kk_kz: Ішінара дұрыс

source: Answer submitted.
kk_kz: Жауап қабылданды.

source: Problem is closed.
kk_kz: Тапсырманы тапсыру мерзімі өтіп кетті.

source: Problem must be reset before it can be submitted again.
kk_kz: Қайтадан тапсырмас бұрын мәселені шешу керек.

source: You must wait at least {wait} seconds between submissions.
kk_kz: Әрекеттер арасында ең болмағанда {wait} секунд күтіңіз.

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
kk_kz: Подождите по крайней мере {wait_secs} между попытками. Осталось {remaining_secs} .

source: {num_hour} hour
kk_kz: {num_hour} час

source: {num_minute} minute
kk_kz: {num_minute} минута

source: Problem needs to be reset prior to save.
kk_kz: Тапсырманы сақтамастан бұрын шығарып тастау керек.

source: Your answers have been saved.
kk_kz: Сіздің жауаптарыңыз сақталды.

source: Your answers have been saved but not graded. Click '{button_name}' to grade them.
kk_kz: Сіздің жауаптарыңыз сақталды, бірақ бағаланбады. Оларды бағалау үшін "{button_name}" түймесін басыңыз.

source: You cannot select Reset for a problem that is closed.
kk_kz: Сіз жабылған мәселе үшін қалпына келтіруді таңдай алмайсыз.

source: You must submit an answer before you can select Reset.
kk_kz: Сіз жауапты Қалпына келтіруді таңдамастан бұрын жіберу керексіз

source: Problem's definition does not support rescoring.
kk_kz: Тапсырманың шарттары оны қайта бағалауға мүмкіндік бермейді.

source: Problem must be answered before it can be graded again.
kk_kz: Тапсырма қайта бағаланғанға дейін оған жауап берілуі тиіс.

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
kk_kz: Өкінішке орай Сіздің сауалды өңдеу кезінде қате орын алды. Бетті қайта жүктеңіз және тағы да әрекет етіп көріңіз.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
kk_kz: Сіз бетті жүктегеннен кейін осы тапсырманың мәртебесі өзгерді. Бетті қайта жүктеңіз.

source: Answer ID
kk_kz: Жауап идентификаторы

source: Question
kk_kz: Сұрақ

source: Correct Answer
kk_kz: Дұрыс жауап

source: Conditional
kk_kz: Шартты

source: List of urls of children that are references to external modules
kk_kz: Список URL-адресов дочерних компонентов, являющихся ссылками на внешние модули.

source: Source Components
kk_kz: Бастапқы компоненттер

source: The component location IDs of all source components that are used to determine whether a learner is shown the content of this conditional module. Copy the component location ID of a component from its Settings dialog in Studio.
kk_kz: Осы Шартты модульдің мазмұны оқушыға көрсетілетінін анықтау үшін қолданылатын барлық бастапқы компоненттердің құрамдас бөліктерінің орналасу идентификаторлары. Құрамдас бөліктің орналасу идентификаторын оның Параметрлер тілқатысу терезесінен студияға көшіріңіз.

source: Conditional Attribute
kk_kz: Шартты Атрибут

source: The attribute of the source components that determines whether a learner is shown the content of this conditional module.
kk_kz: Осы Шартты модульдің мазмұны оқушыға көрсетілетінін анықтайтын бастапқы компоненттердің атрибуты.

source: Conditional Value
kk_kz: Шартты Мән

source: The value that the conditional attribute of the source components must match before a learner is shown the content of this conditional module.
kk_kz: Оқушыға осы Шартты модульдің мазмұны көрсетілмес бұрын бастапқы компоненттердің шартты атрибуты сәйкес келуі керек мән.

source: Blocked Content Message
kk_kz: Бұғатталған мазмұн туралы хабарлама

source: The message that is shown to learners when not all conditions are met to show the content of this conditional module. Include {link} in the text of your message to give learners a direct link to required units. For example, 'You must complete {link} before you can access this unit'.
kk_kz: Осы Шартты модульдің мазмұнын көрсету үшін барлық жағдайлар жасалмаған кезде оқушыларға көрсетілетін хабарлама. Оқушыларға қажетті блоктарға тікелей сілтеме беру үшін хабарлама мәтініне {link} қосыңыз. Мысалы,"сіз бұл құрылғыға кірмес бұрын {link} толтыруыңыз керек".

source: You must complete {link} before you can access this unit.
kk_kz: Бұл құрылғыға кірмес бұрын {link} толтыру керек.

source: This component has no source components configured yet.
kk_kz: Бұл компонентте бастапқы компоненттер әлі теңшелмеген.

source: Configure list of sources
kk_kz: Дереккөздер тізімін теңшеу

source: LTI Passports
kk_kz: LTI төлқұжаттары

source: Enter the passports for course LTI tools in the following format: "id:client_key:client_secret".
kk_kz: LTI курс құралдарының төлқұжаттарын келесі форматта енгізіңіз: "id:client_key:client_secret".

source: List of Textbook objects with (title, url) for textbooks used in this course
kk_kz: Список пар (заголовок, url) для учебников, используемых в этом курсе.

source: Slug that points to the wiki for this course
kk_kz: Осы курсқа арналған викиді көрсететін нүкте

source: Date that enrollment for this class is opened
kk_kz: Осы курсқа тіркелудің ашылу күні

source: Date that enrollment for this class is closed
kk_kz: Осы курсқа тіркеудің жабылу күні

source: Start time when this module is visible
kk_kz: Бұл модуль көрінетін басталу уақыты

source: Date that this class ends
kk_kz: Осы сабақтың аяқталу күні

source: Date that certificates become available to learners
kk_kz: Сертификаттар оқушыларға қол жетімді болатын күн

source: Cosmetic Course Display Price
kk_kz: Косметикалық Курсты Көрсету Бағасы

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
kk_kz: Курсқа түсу үшін студенттерге көрсетілген құн. Егер ақылы курсқа тіркелу бағасын әкімші дерекқорда орнатса, оның орнына бұл баға көрсетіледі.

source: Course Advertised Start
kk_kz: Жарияланған Курстың Басталуы

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
kk_kz: Курстың басталу уақыты ретінде пайдаланғыңыз келетін мәтінді енгізіңіз, мысалы,"қыс 2018". Егер сіз осы мән үшін null мәнін енгізсеңіз, берілген курс үшін белгіленген басталу күні қолданылады.

source: Pre-Requisite Courses
kk_kz: Міндетті Курстар
