Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
kk_kz: Разделив учебник на несколько глав, вы сократите время, которое потребуется на его загрузку, особенно тем слушателям, у кого низкая скорость соединения с интернетом.

source: What if my book isn't divided into chapters?
kk_kz: Что делать, если моя книга не делится на главы?

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
kk_kz: Если ваш учебник не разбит на отдельные главы, вы можете загрузить весь текст как одну главу, указав произвольное название в поле «Название главы».

source: Learn more about textbooks
kk_kz: Узнать больше об учебниках

source: Video Uploads
kk_kz: Загруженные видео

source: Access is not restricted
kk_kz: Доступ не ограничен

source: Access to this component is not restricted, but visibility might be affected by inherited settings.
kk_kz: Доступ к этому компоненту не ограничен, но на его видимость могут влиять настройки родительских модулей.

source: You can restrict access to this component to learners in specific enrollment tracks or content groups.
kk_kz: Вы можете ограничить доступ к этому блоку для пользователей в зависимости от режима записи или группы по содержимому.

source: You can restrict access to this component to learners in specific content groups.
kk_kz: Вы можете ограничить доступ к этому блоку для пользователей из различных групп по узучаемому материалу.

source: Manage content groups
kk_kz: Управление группами по изучаемому материалу

source: {screen_reader_start}Warning:{screen_reader_end} The unit that contains this component is hidden from learners. The unit setting overrides the component access settings defined here.
kk_kz: {screen_reader_start}Предупреждение:{screen_reader_end} блок, в который входит этот компонент, скрыт от слушателей. Настройки блока переопределяют определённые здесь настройки доступа к компоненту.

source: Access is restricted to:
kk_kz: Доступ разрешён для:

source: Restrict access to:
kk_kz: Ограничить доступ:

source: Select a group type
kk_kz: Выберите тип группы

source: All Learners and Staff
kk_kz: Всех слушателей и сотрудников

source: Select one or more groups:
kk_kz: Выберите одну или более групп:

source: Thank you for signing up for {studio_name}! To activate your account, please copy and paste this address into your web browser's address bar:
kk_kz: Благодарим вас за регистрацию в {studio_name}! Чтобы активировать свою учётную запись, пожалуйста, скопируйте следующий адрес и вставьте его в адресную строку своего браузера:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {studio_name} web site.
kk_kz: Если вы не делали такого запроса, дальнейших действий не требуется; вы больше не будете получать от нас сообщений. Пожалуйста, не отвечайте на это сообщение; если вам потребуется помощь, загляните в раздел «Помощь» на веб-сайте {studio_name}.

source: Your account for {studio_name}
kk_kz: Ваша учётная запись в {studio_name}

source: {email} has requested {studio_name} course creator privileges on edge
kk_kz: {email} срочно запросил привилегии создателя курса в {studio_name}

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
kk_kz: Пользователь '{user}' с электронным адресом {email} срочно запросил привилегии создателя курса в {studio_name}.

source: To grant or deny this request, use the course creator admin table.
kk_kz: Чтобы принять или отклонить данную заявку, воспользуйтесь таблицей создателей курсов в разделе администрирования:

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
kk_kz: Ваш запрос на право создания курсов в {studio_name} отклонён. Если вы считаете, что произошла ошибка, пожалуйста, напишите {email}

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
kk_kz: Ваш запрос на право создания курсов в {studio_name} удовлетворён. Чтобы создать свой первый курс, посетите {url}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
kk_kz: Ваши права на создание курсов в {studio_name} отозваны. Если вы считаете, что произошла ошибка, пожалуйста, напишите {email}

source: Your course creator status for {studio_name}
kk_kz: Ваш статус автора курсов в {studio_name}

source: Your {task_name} task has completed with the status '{task_status}'. Use this URL to view task details or download any files created: {detail_url}
kk_kz: Ваше задание «{task_name}» завершено со статусом «{task_status}». Для просмотра подробностей задания или загрузки созданных файлов перейдите по адресу {detail_url}.

source: Your {task_name} task has completed with the status '{task_status}'. Sign in to view the details of your task or download any files created.
kk_kz: Ваше задание «{task_name}» завершено со статусом «{task_status}». Для просмотра подробностей задания или загрузки созданных файлов войдите в систему.

source: {platform_name} {studio_name}: Task Status Update
kk_kz: {platform_name} {studio_name}: Обновление статуса задания

source: Required data to force publish course.
kk_kz: Информация, обязательная для принудительной публикации курса.

source: Reset values
kk_kz: Сброс значений

source: Maintenance Dashboard
kk_kz: Панель технического обслуживания

source: Thanks for activating your account.
kk_kz: Спасибо за активацию учётной записи.

source: This account has already been activated.
kk_kz: Эта учётная запись уже активирована.

source: Visit your {link_start}dashboard{link_end} to see your courses.
kk_kz: Перейдите к {link_start}панели управления{link_end}, чтобы просмотреть свои курсы.

source: You can now {link_start}sign in{link_end}.
kk_kz: Теперь вы можете {link_start}войти{link_end}.

source: Activation Invalid
kk_kz: Активация недействительна

source: Something went wrong. Email programs sometimes split URLs into two lines, so make sure the URL you're using is formatted correctly. If you still have issues, send us an email message at {email_start}{email}{email_end}.
kk_kz: Что-то пошло не так. Иногда почтовые программы переносят часть URL на следующую строку, поэтому проверьте правильность URL-адреса, который вы используете. Если это не решит проблему, напишите нам по адресу {email_start}{email}{email_end}.

source: Return to the {link_start}home page{link_end}.
kk_kz: Вернуться на {link_start}главную страницу{link_end}.

source: We've sent an email message to {email} with instructions for activating your account.
kk_kz: Сообщение с инструкцией по активации вашей учётной записи отправлено на электронный адрес {email}.

source: EdX, Open edX, Studio, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
kk_kz: EdX, Open edX, Studio, а также логотипы edX и Open edX являются зарегистрированными торговыми знаками или торговыми марками, принадлежащими {link_start}edX Inc.{link_end}

source: Current Course:
kk_kz: Текущий курс:

source: Course Navigation
kk_kz: Навигация по курсу

source: Outline
kk_kz: Структура

source: Import
kk_kz: Импорт

source: Export
kk_kz: Экспорт

source: Current Library:
kk_kz: Текущая библиотека:

source: Language preference
kk_kz: Выбор языка

source: Account Navigation
kk_kz: Навигация по учётной записи

source: Contextual Online Help
kk_kz: Ситуационная поддержка онлайн

source: Launch Latex Source Compiler
kk_kz: Запуск компилятора Latex

source: Heading
kk_kz: Тақырып

source: Insert a heading
kk_kz: Вставить заголовок

source: Add a multiple choice question
kk_kz: Добавить вопрос с выбором единственного варианта

source: Add a question with checkboxes
kk_kz: Добавить вопрос с выбором нескольких вариантов

source: Insert a text response
kk_kz: Вставить текстовый ответ

source: Insert a numerical response
kk_kz: Вставить числовой ответ

source: Insert a dropdown response
kk_kz: Вставить ответ из списка

source: Explanation
kk_kz: түсіндірме

source: Add an explanation for this question
kk_kz: Добавить объяснение к вопросу

source: Advanced Editor
kk_kz: Расширенный редактор

source: Toggle Cheatsheet
kk_kz: Открыть/скрыть шпаргалку

source: Label
kk_kz: Метка

source: Access the Open edX Portal
kk_kz: Открыть портал Open edX

source: Open edX Portal
kk_kz: Портал Open edX

source: Currently signed in as:
kk_kz: Вы зашли как:

source: Maintenance
kk_kz: Техническое обслуживание

source: Wiki notifications
kk_kz: Вики хабарламалары

source: Wiki images
kk_kz: Вики суреттері

source: Wiki attachments
kk_kz: Вики тіркемелері

source: Only localhost... muahahaha
kk_kz: Жергілікті компьютер ғана ... муахахаха

source: Initial title of the article. May be overridden with revision titles.
kk_kz: Мақаланың алғашқы атауы. Ревизиялық тақырыптармен жабылуы мүмкін.

source: Type in some contents
kk_kz: Азғана мазмұнды теріңіз

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
kk_kz: Бұл сіздің мақаланың бастапқы мазмұны ғана. Оны құрғаннан кейін сіз плагиндер, метадеректер, байланысқан мақалаларды қосу және т.б. сияқты анағұрлым күрделі функцияларды пайдалана аласыз

source: Contents
kk_kz: Содержание

source: Summary
kk_kz: Қысқаша

source: Give a short reason for your edit, which will be stated in the revision log.
kk_kz: Ревизия журналында жазылатын редакциялау себебін қысқаша көрсетіңіз.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
kk_kz: Сіз редакциялап жатқанда басқа біреу ревизияны өзгертті. Сіздің мазмұныңыз жаңа мазмұнмен бірге автоматты түрде шығарып тасталды. Төмендегі мәтінді тексеріңіз.

source: No changes made. Nothing to save.
kk_kz: Өзгерістер болған жоқ. Сақтайтын ештеңе жоқ.

source: Slug
kk_kz: Қысқаша атауы

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
kk_kz: Бұл сіздің мақала орналасатын мекенжай болады. Цифрларды, латын әліпбиінің символдарын және тире мен төменгі астын сызу символдарын ғана пайдаланыңыз. Мақаланы құрғаннан кейін сіз сілтемені өзгерте алмайтындығыңыз есіңізде болсын.

source: Write a brief message for the article's history log.
kk_kz: Журнал үшін мақала тарихының қысқаша хабарламасын жазыңыз.

source: A slug may not begin with an underscore.
kk_kz: Slug-строка не может начинаться с символа подчёркивания

source: A deleted article with slug "%s" already exists.
kk_kz: Қысқаша атауы \"%s\" алыстағы мақала бар.

source: A slug named "%s" already exists.
kk_kz: Қысқаша атауы \"%s\" мақала бар.

source: Yes, I am sure
kk_kz: Иә, мен сенімдімін

source: Purge
kk_kz: Тазарту

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
kk_kz: Мақаланы тазарту. Оны қалпына келтіру мүмкіндігісіз оны толық жоюды (оның барлық толтыруын қоса алғанда) жүргізеді. Сіз пайдаланушылар тиісті орында жаңа мақалалар құра алуы үшін қысқаша атауды босатқыңыз келген жағдайда ғана тазарту орынды.

source: You are not sure enough!
kk_kz: Сіз жеткілікті сенімді емессіз!

source: While you tried to delete this article, it was modified. TAKE CARE!
kk_kz: Сіз осы мақаланы жоюға әрекет жасағанша, ол өзгертілді. САҚ БОЛЫҢЫЗ!

source: Lock article
kk_kz: Мақаланы бұғаттау

source: Deny all users access to edit this article.
kk_kz: Барлық пайдаланушыларға осы мақаланы редакциялауға тыйым салынсын.

source: Permissions
kk_kz: Қол жеткізу құқығы

source: Owner
kk_kz: Ие

source: Enter the username of the owner.
kk_kz: Ие пайдаланушысының атын енгізіңіз

source: (none)
kk_kz: (жоқ)

source: Inherit permissions
kk_kz: Қол жеткізу құқықтарына мұрагер болу

source: Check here to apply the above permissions recursively to articles under this one.
kk_kz: Осы мақаланың астындағы мақалаларға қол жеткізудің жоғарыда тұрған құқықтарын рекурсивті қолдану үшін осында шертіңіз.

source: Permission settings for the article were updated.
kk_kz: Осы мақалаға арналған қол жеткізу құқықтарын баптау жаңартылды.

source: Your permission settings were unchanged, so nothing saved.
kk_kz: Сіздің қол жеткізу құқықтарыңызды баптау өзгертілген жоқ, сақтайтын ештеңе жоқ.

source: No user with that username
kk_kz: Пайдаланушының осындай аты бар пайдаланушылар жоқ.

source: Article locked for editing
kk_kz: Мақала редакциялау үшін бұғатталды

source: Article unlocked for editing
kk_kz: Мақала редакциялау үшін бұғаттаудан алынды

source: Filter
kk_kz: Сүзгі

source: Settings for plugin
kk_kz: Плагинді баптау

source: current revision
kk_kz: Ағымдағы ревизия

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
kk_kz: Ревизия осы мақала үшін бейнеленеді. Егер сізге кері шегіну қажет болса, осы алаптың мәнін жай өзгертіңіз.

source: modified
kk_kz: өзгертілді

source: Article properties last modified
kk_kz: Мақаланың қасиеттері соңғы ретте өзгертілген болатын

source: owner
kk_kz: ие

source: The owner of the article, usually the creator. The owner always has both read and write access.
kk_kz: Әдетте құрушы мақаланың иесі. Ие оқуға және жазуға құқылы.

source: group
kk_kz: топ

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
kk_kz: UNIX файлдық жүйесінде рұқсаттар пайдаланушыға оның пайдаланымдық тобына сай берілуі мүмкін. Топтар Django авторландыру жүйесі арқылы басқарылады.

source: group read access
kk_kz: топ үшін оқуға қол жеткізу

source: group write access
kk_kz: топ үшін жазуға қол жеткізу

source: others read access
kk_kz: басқалар үшін оқуға қол жеткізу

source: others write access
kk_kz: басқалар үшін жазуға қол жеткізу

source: Article without content (%(id)d)
kk_kz: (%(id)d) мазмұны жоқ мақала

source: content type
kk_kz: Тип содержимого

source: object ID
kk_kz: ID объекта

source: Article for object
kk_kz: Объектіге арналған мақала

source: Articles for object
kk_kz: Объектіге арналған мақалалар

source: revision number
kk_kz: ревизиялық нөмір

source: IP address
kk_kz: IP мекенжайы

source: user
kk_kz: пайдаланушы

source: locked
kk_kz: бұғатталды

source: article
kk_kz: мақала

source: article contents
kk_kz: мақаланың мазмұны

source: article title
kk_kz: мақаланың атауы

source: Each revision contains a title field that must be filled out, even if the title has not changed
kk_kz: Әрбір ревизия тақырып алабынан тұрады, ол тақырып өзгерілмесе де толтырылуы тиіс

source: original article
kk_kz: түпнұсқалық мақала

source: Permissions are inherited from this article
kk_kz: Рұқсаттар осы мақаладан мұраға алынды

source: A plugin was changed
kk_kz: Плагин өзгертілген болатын

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
kk_kz: Ревизия осы плагин үшін көрсетіледі. Егер сізге кері шегіну қажет болса, осы алаптың мазмұнын жай өзгерте салыңыз.

source: Cache lookup value for articles
kk_kz: Мақалаларға арналған кэштан алынған мән

source: slug
kk_kz: қысқаша атауы

source: URL path
kk_kz: URL жол

source: URL paths
kk_kz: URL жолдар

source: Sorry but you cannot have a root article with a slug.
kk_kz: Өкінішке орай түбірлік мақала үшін қысқаша атауы беріле алмайды.

source: A non-root note must always have a slug.
kk_kz: Түбірлік емес мақала әрқашан да қысқаша атауға ие болуы тиіс.

source: There is already a root node on %s
kk_kz: Түбірлік торап %s бар.

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
kk_kz: Өз ата-аналарын жоғалтқан мақалалар\n ===============================\n \n \n Осы мақала балаларының ата-аналары жойылған болатын. Сіз оларға жаңа үй тауып беруіңіз керек шығар

source: Lost and found
kk_kz: Табылған заттар бюросы

source: A short summary of what the file contains
kk_kz: Ққысқаша файлдың мазмұны туралы

source: Yes I am sure...
kk_kz: Иә, мен сенімдімін...

source: Click to download file
kk_kz: Файлды көшіріп жүктеу үшін басыңыз

source: The revision of this attachment currently in use (on all articles using the attachment)
kk_kz: Осы қосымшаның нұсқасы қазіргі сәтте пайдаланылуда (осы қосымшаны пайдаланатын барлық мақалаларда)

source: original filename
kk_kz: файлдың бастапқы атауы

source: attachment
kk_kz: тіркеме

source: attachments
kk_kz: тіркемелер

source: file
kk_kz: файл

source: attachment revision
kk_kz: тіркемені тексеру

source: attachment revisions
kk_kz: тіркемелерді тексеру

source: %s was successfully added.
kk_kz: %s ойдағыдай қосылды.

source: Your file could not be saved: %s
kk_kz: Сіздің файл сақталмайды: %s

source: Your file could not be saved, probably because of a permission error on the web server.
kk_kz: Сіздің файл сақталмайды, мүмкін веб-сервердегі қол жеткізу құқықтарының қателері нәтижесінде болар.

source: %s uploaded and replaces old attachment.
kk_kz: %s загружено и заменило старую версию вложения

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
kk_kz: Сіздің жаңа файлға қолданыстағы файлға сәйкес автоматты түрде қайта атау берілетін болады. Кеңейтулері әртүрлі файлдарға жол берілмейді.

source: Current revision changed for %s.
kk_kz: Ағымдағы нұсқа өзгертілді %s.

source: Added a reference to "%(att)s" from "%(art)s".
kk_kz: \"%(art)s\"-дан\"%(att)s\" сілтеу қосылды

source: The file %s was deleted.
kk_kz: %s файл жойылған болатын.

source: This article is no longer related to the file %s.
kk_kz: Бұл мақала енді %s жатпайды.

source: A file was changed: %s
kk_kz: Файл өзгертілген болатын: %s

source: A file was deleted: %s
kk_kz: Файл жойылған болатын: %s

source: The file may be referenced on other articles. Deleting it means that they will loose their references to this file. The following articles reference this file:
kk_kz: Файлға басқа мақалаларда сілтеме жасауға болады. Бұл файлды жою олардың осы файлға сілтемелерін жоғалтатынын білдіреді. Бұл файлға келесі мақалалар сілтеме жасайды:

source: Delete it!
kk_kz: Оны жойыңыз!

source: You can remove a reference to a file, but it will retain its references on other articles.
kk_kz: Файл сілтемесін жоюға болады, бірақ ол басқа мақалаларға сілтемелерді сақтайды.

source: Remove reference
kk_kz: Сілтемені жою

source: History of
kk_kz: Тарихы

source: User
kk_kz: Пайдаланушы

source: File
kk_kz: Файл

source: Action
kk_kz: Іс-шаралар

source: <em>No description</em>
kk_kz: <em>Сипаттама жоқ</em>

source: Download
kk_kz: Жүктеу

source: Use this!
kk_kz: Осыны қолдан!

source: Replacing an attachment means adding a new file that will be used in its place. All references to the file will be replaced by the one you upload and the file will be downloaded as <strong>%(filename)s</strong>. Please note that this attachment is in use on other articles, you may distort contents. However, do not hestitate to take advantage of this and make replacements for the listed articles where necessary. This way of working is more efficient....
kk_kz: Тіркемені ауыстыру оның орнына қолданылатын жаңа файлды қосуды білдіреді. Барлық файл сілтемелері сіз жүктеген файлға ауыстырылады және файл қалай жүктеледі<strong>%(filename)s</strong> . Назар аударыңыз, бұл қосымша басқа мақалаларда қолданылады, сіз мазмұнды бұрмалай аласыз. Алайда, оны пайдаланудан тартынбаңыз және қажет болған жағдайда аталған мақалаларды ауыстырыңыз. Бұл жұмыс әдісі тиімдірек....

source: Articles using
kk_kz: Пайдаланылатын артиклдар

source: Upload replacement
kk_kz: Жүктеуді ауыстыру

source: Add file to
kk_kz: Файлды қосу

source: Add attachment from other article
kk_kz: Басқа мақаладан тіркеме қосу

source: Main article
kk_kz: Негізгі мақала

source: Add to article
kk_kz: Мақалаға қосу

source: Your search did not return any results
kk_kz: Сіздің іздеуіңіз нәтиже бермеді

source: Adding new articles
kk_kz: Жаңа мақалалар қосу

source: An external link
kk_kz: Сыртқы сілтеме

source: Headers
kk_kz: Тақырыптар

source: Use these codes for headers and to automatically generate Tables of Contents.
kk_kz: Бұл кодтарды тақырыптар үшін және мазмұн кестелерін автоматты түрде жасау үшін пайдаланыңыз.

source: Typography
kk_kz: Баспахана

source: Lists
kk_kz: Тізімдер

source: New image %s was successfully uploaded. You can use it by selecting it from the list of available images.
kk_kz: %s жаңа бейнесі ойдағыдай жүктелді. Сіз оны қол жетімді бейнелер тізімінен таңдап пайдалана аласыз.

source: Are you sure?
kk_kz: Сіз сенімдісіз бе?

source: image
kk_kz: бейне

source: images
kk_kz: бейнелер

source: Image: %s
kk_kz: Бейне: %s

source: Current revision not set!!
kk_kz: Ағымдағы нұсқа көрсетілмеген!!

source: image revision
kk_kz: бейне нұсқасы

source: image revisions
kk_kz: бейне нұсқасы

source: Image Revsion: %d
kk_kz: Бейне нұсқасы: %d

source: %s has been restored
kk_kz: %s қалпына келтірілген болатын

source: %s has been marked as deleted
kk_kz: %s жойылған ретінде белгіленген болатын

source: %(file)s has been changed to revision #%(revision)d
kk_kz: %(file)s мына нұсқаға өзгертілді #%(revision)d

source: %(file)s has been saved.
kk_kz: %(file)s сақталған болатын.

source: Images
kk_kz: Бейнелер

source: An image was added: %s
kk_kz: Бейне қосылған болатын: %s

source: The following images are available for this article. Copy the markdown tag to directly refer to an image from the article text.
kk_kz: Осы мақала үшін келесі суреттер қол жетімді. Мақала мәтінінен суретке тікелей сілтеме жасау үшін markdown тегін көшіріңіз.

source: Back to edit page
kk_kz: Өңдеу бетіне оралу

source: No file
kk_kz: Файл табылмады

source: Upload new image
kk_kz: Жаңа сурет жүктеу

source: Restore image
kk_kz: Суретті қалпына келтіру

source: Remove image
kk_kz: Жою бейнесі

source: Completely delete
kk_kz: Толығымен алып тастаңыз

source: Revert to this version
kk_kz: Осы нұсқаға оралыңыз

source: There are no images for this article.
kk_kz: Бұл мақала үшін суреттер жоқ.

source: Purge deletion
kk_kz: Жоюды тазарту

source: Purge image: Completely remove image file and all revisions.
kk_kz: Суретті тазарту: кескін файлын және барлық өзгерістерді толығымен жойыңыз.

source: Remove it completely!
kk_kz: Толықтай өшіру

source: Image not found
kk_kz: Бейне табылмады

source: Replace image
kk_kz: Бейнені ауыстыру

source: Choose an image file to replace current image.
kk_kz: Осы суретті ауыстыру үшін сурет сақталған файлды таңдаңыз

source: Image id
kk_kz: Сурет идентификациясы

source: Insert
kk_kz: Салу

source: No images found for this article
kk_kz: Бұл мақаланың суреттері табылған жоқ

source: Manage images
kk_kz: Суреттерді басқару

source: Add new image
kk_kz: Жаңа сурет қосу

source: Add image
kk_kz: Сурет қосу

source: You do not have permissions to add images.
kk_kz: Сізде бейнлер қосуға рұқсатыңыз жоқ

source: How to use images
kk_kz: Суреттерді қалай пайдалануға болады
