Repository: relesssar/--paltform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Certificate purchases help {platform_name} continue to offer free courses
kk_kz: Сертификаттарды сатып алу {platform_name} тегін курстарды ұсынуды жалғастыруға көмектеседі

source: Pay the Verified Certificate upgrade fee
kk_kz: Расталған куәлікті жаңарту үшін ақы төлеңіз

source: Verify your identity with a webcam and government-issued ID
kk_kz: Веб-камера және Үкімет берген жеке куәлік арқылы жеке басыңызды растаңыз

source: Study hard and pass the course
kk_kz: Тынбай үйреніңіз және курсты өтіңіз

source: Share your certificate with friends, employers, and others
kk_kz: Сертификатыңызды достарыңызбен, жұмыс берушілермен және басқалармен бөлісіңіз

source: edX Learner Stories
kk_kz: EdX оқушыларының тарихы

source: {learner_name}, edX Learner
kk_kz: Білім алушы edX {learner_name},

source: Upgrade ({course_price})
kk_kz: ({course_price}) Жаңарту

source: This course does not have any updates.
kk_kz: Бұл курста ешқандай жаңартулар жоқ

source: Today is {date}
kk_kz: Сегодня {date}

source: Search Results
kk_kz: Іздеу нәтижелері

source: Connected Accounts
kk_kz: Қосылған есептік жазбалар

source: Linked
kk_kz: Байланысты

source: Not Linked
kk_kz: Байланысты Емес

source: Unlink
kk_kz: Ажырату

source: Link
kk_kz: Сілтеме

source: Completed {completion_date_html}
kk_kz: {completion_date_html} аяқталды

source: {course_mode} certificate
kk_kz: {course_mode} сертификаты

source: You haven't earned any certificates yet.
kk_kz: Сіз әлі сертификат алған жоқсыз

source: Explore New Courses
kk_kz: Жаңа Курстарды Оқыңыз

source: View My Records
kk_kz: Менің Жазбаларымды Қарау

source: My Profile
kk_kz: Менің Профилім

source: Build out your profile to personalize your identity on {platform_name}.
kk_kz: Жеке басыңызды жекелендіру үшін {platform_name} профиль жасаңыз

source: An error occurred. Try loading the page again.
kk_kz: Қателік пайда болды.Парақшаны қайтадан іске қосып көріңіз.

source: Access Course Staff Support on the Partner Portal to submit or review support tickets
kk_kz: Перейдите в раздел поддержки портала для партнёров, чтобы создать или просмотреть запросы о поддержке.

source: edX Partner Portal
kk_kz: Портал партнёров edX

source: Browse recently launched courses and see what's new in your favorite subjects.
kk_kz: Жақында іске қосылған курстарды қарап шығыңыз және сүйікті пәндеріңізде не жаңалық бар екенін біліңіз.

source: Page Footer
kk_kz: Беттің төменгі деректемесі

source: edX Home Page
kk_kz: Главная страница edX

source: About edX Verified Certificates
kk_kz: EdX растаған сертификаттар туралы

source: An edX Verified Certificate signifies that the learner has agreed to abide by the edX honor code and completed all of the required tasks of this course under its guidelines, as well as having their photo ID checked to verify their identity.
kk_kz: EdX растаған Сертификат оқушының EDX Ар-намыс кодексін сақтауға келіскенін және Осы курстың барлық қажетті тапсырмаларын оның нұсқауларына сәйкес орындағанын, сонымен қатар жеке басын растау үшін жеке куәлігін тексергенін білдіреді.

source: About edX
kk_kz: EdX туралы

source: {link_start}edX{link_end} offers interactive online classes and MOOCs from the world's best universities, including MIT, Harvard, Berkeley, University of Texas, and many others. edX is a non-profit online initiative created by founding partners Harvard and MIT.
kk_kz: {link_start}edX{link_end} Массачусетс технологиялық институты, Гарвард, Беркли, Техас университеті және басқаларын қоса, әлемдегі ең жақсы университеттердің интерактивті онлайн сыныптары мен MOOC ұсынады. edX-бұл Гарвард пен Массачусетс технологиялық институтының негізін қалаушы серіктестері құрған коммерциялық емес онлайн бастама.

source: Congratulations, {user_name}!
kk_kz: Құттықтаймыз,{user_name}!

source: You worked hard to earn your certificate from {accomplishment_copy_course_org} {dash} share it with colleagues, friends, and family to get the word out about what you mastered in {accomplishment_course_title}.
kk_kz: Сіз {accomplishment_copy_course_org} {dash} - ден сертификат алу үшін көп жұмыс жасадыңыз, оны әріптестеріңізбен, достарыңызбен және отбасыңызбен бөлісіңіз, {accomplishment_course_title} - де не игергеніңіз туралы сөйлесіңіз.

source: Share this certificate on Facebook (opens a new tab/window)
kk_kz: Бұл сертификатты Facebook-те бөлісіңіз (жаңа қойынды/терезе ашылады)

source: Tweet this certificate (opens a new tab/window)
kk_kz: Бұл куәлікті Twitter-ге жіберіңіз (жаңа қойынды/терезе ашылады)

source: Add this certificate to your LinkedIn profile (opens a new tab/window)
kk_kz: Бұл куәлікті LinkedIn профиліне қосыңыз (Жаңа қойынды/терезе ашылады)

source: Print
kk_kz: Шығару

source: Print this certificate
kk_kz: Осы сертификатты басып шығарыңыз

source: {b_start}Support our Mission: {b_end} EdX, a non-profit, relies on verified certificates to help fund free education for everyone globally
kk_kz: {b_start}Поддержите нашу миссию: {b_end} EdX – это некоммерческая организация, и поступления от оплаты подтверждённых сертификатов помогают нам финансировать бесплатное образование для людей по всему миру

source: Find Courses
kk_kz: Курстарды іздеу

source: Schools & Partners
kk_kz: Мектептер & Серіктестер

source: EdX, Open edX, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
kk_kz: EdX, Open edX, а также логотипы edX и Open edX являются зарегистрированными торговыми знаками или торговыми марками, принадлежащими {link_start}edX Inc.{link_end}

source: {tos_link_start}Terms of Service{tos_link_end} and {honor_link_start}Honor Code{honor_link_end}
kk_kz: {tos_link_start}Условия предоставления услуг{tos_link_end} и {honor_link_start}Кодекс чести{honor_link_end}

source: Copyright
kk_kz: Авторлық құқық

source: Copyright {year}. All rights reserved.
kk_kz: Авторлық құқық {year}. Барлық құқықтар қорғалған.

source: For anyone, anywhere, anytime
kk_kz: Балығы үшін, барлық жерде, әрқашан

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
kk_kz: Сіз белсендендіру үшін хат алдыңыз. Процесті аяқтау үшін, сіз одан алынған сілтеме бойынша өтуіңіз керек. Хатты көріп тұрған жоқсыз ба? Спаммен өз папкаңызды тексеріңіз және class.stanford.edu хаттарын 'спам емес' ретінде белгілеңіз, өйткені сіз қатысатын курстардың хат-хабарларын алғыңыз келетіні сөзсіз.

source: Need help in registering with {platform_name}?
kk_kz: {platform_name} тіркелуге көмек керек пе?

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
kk_kz: Сіз тіркелгеннен кейін, көптеген сұрақтарға жауаптарды жеке курстардың форумдарында немесе ЖҚС бөлімінде табуға болады.

source: Thank you for signing up for {platform_name}.
kk_kz: {Platform_name} - ге тіркелгеніңіз үшін рахмет.

source: Change your life and start learning today by activating your {platform_name} account. Click on the link below or copy and paste it into your browser's address bar.
kk_kz: Өміріңізді өзгертіңіз және бүгін {platform_name} есептік жазбаңызды іске қосу арқылы оқуды бастаңыз. Төмендегі сілтемені нұқыңыз немесе оны шолғыштың мекен-жай жолына көшіріп қойыңыз.

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
kk_kz: Егер Сіз осындай сұранысты істемесеңіз, бұдан әрі әрекеттер талап етілмейді; сіз бізден енді хабарлар алмайсыз. Осы хабарға жауап бермеуіңізді өтінеміз; егер Сізге көмек керек болса, {platform_name} курстар сайтында \"Біз туралы\" бетіне кіріңіз.

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us at
kk_kz: Бұл Сіздің есептік жазбаңызбен {new_email} {old_email} –мен {platform_name} байланысқан электрондық мекенжайды ауыстыруды растау. Егер Сіз осындай сұранысты істемесеңіз, бізбен мекенжай бойынша байланысыңыз.

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
kk_kz: Біз Сіздің есептік жазбаңызбен {new_email} {old_email} –мен {platform_name} байланысқан электрондық мекенжайды ауыстыруға сұраныс алдық. Егер бәрі дұрыс болса, өзіңіздің жаңа электрондық мекенжайыңызды растау үшін осы сілтеме бойынша өтіңіз.

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at {email}
kk_kz: Біз өте өкінеміз. Біздің курс қызметкерлері сіздің атыңызды {old_name} - ден {new_name} - ге өзгерту туралы сұрауыңызды мақұлдамады. Егер сізге қосымша көмек қажет болса, техникалық қолдау қызметіне {email}мекен-жайына жазыңыз

source: Put your Terms of Service here!
kk_kz: Добавьте сюда ваши Условия предоставления услуг.

source: Put your Privacy Policy here!
kk_kz: Добавьте сюда вашу Политику конфиденциальности.

source: Put your Honor Code here!
kk_kz: Добавьте сюда ваш Кодекс чести.

source: Put your Copyright Text here!
kk_kz: Добавьте сюда ваш текст об авторских правах.

source: The page that you were looking for was not found.
kk_kz: Страница, которую вы искали, не найдена.

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
kk_kz: Перейдите на {homepage} или сообщите нам о любых страницах, которые были перемещены, на {email}.

source: {studio_name} Server Error
kk_kz: {studio_name} Ошибка сервера

source: The {em_start}{studio_name}{em_end} servers encountered an error
kk_kz: На серверах {em_start}{studio_name}{em_end} произошла ошибка

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
kk_kz: Невозможно перезагрузить страницу из-за ошибки {studio_name}. Пожалуйста, повторите попытку через несколько минут.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
kk_kz: У нас возникли технические неполадки. Наши сотрудники уже работают над этим. В ближайшее время проблема будет устранена.

source: If the problem persists, please email us at {email_link}.
kk_kz: Если проблема не исправлена, пожалуйста, свяжитесь с нами по адресу {email_link}.

source: {studio_name} Account Activation
kk_kz: {studio_name} Активация учётной записи

source: Your account is already active
kk_kz: Эта учётная запись уже была активирована.

source: This account, set up using {email}, has already been activated. Please sign in to start working within {studio_name}.
kk_kz: Эта учётная запись, привязанная к адресу {email}, уже активирована. Пожалуйста, войдите в систему, чтобы начать работать в {studio_name}.

source: Sign into {studio_name}
kk_kz: Вход в {studio_name}

source: Your account activation is complete!
kk_kz: Активация вашей учётной записи завершена!

source: Thank you for activating your account. You may now sign in and start using {studio_name} to author courses.
kk_kz: Благодарим вас за активацию учётной записи. Теперь вы можете войти в систему и начать создавать курсы, используя {studio_name}.

source: Your account activation is invalid
kk_kz: Недействительная активация для вашей учётной записи

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct, as e-mail programs will sometimes split it into two lines.
kk_kz: Нам очень жаль, но что-то пошло не так при активации. Проверьте корректность ссылки, по которой вы перешли, – почтовые программы иногда разделяют ссылки на две части.

source: If you still have issues, contact {platform_name} Support. In the meantime, you can also return to {link_start}the {studio_name} homepage.{link_end}
kk_kz: Если у вас остались вопросы, свяжитесь с техподдержкой {platform_name}. А пока вы можете вернуться к {link_start} главной странице {studio_name}.{link_end}

source: Files & Uploads
kk_kz: Файлы и загрузки

source: Course Certificates
kk_kz: Сертификаты курса

source: This module is not enabled.
kk_kz: Данный модуль не активирован.

source: This course does not use a mode that offers certificates.
kk_kz: Этот курс не использует режим, предлагающий сертификаты.

source: Working with Certificates
kk_kz: Действия с сертификатами

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
kk_kz: Укажите название курса, которое будет отображаться на сертификатах, если официальное название курса слишком длинное.

source: For verified certificates, specify between one and four signatories and upload the associated images.
kk_kz: Для подтверждённых сертификатов укажите от одной до четырёх подписей и загрузите соответствующие изображения.

source: To edit or delete a certificate before it is activated, hover over the top right corner of the form and select {em_start}Edit{em_end} or the delete icon.
kk_kz: Чтобы отредактировать или удалить сертификат, пока он ещё не утверждён, наведите указатель мыши на верхний правый угол формы и выберите {em_start}«Редактировать»{em_end} или значок «Удалить».

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
kk_kz: Чтобы увидеть пример сертификата, выберите режим прохождения курса и нажмите {em_start}«Просмотреть сертификат»{em_end}.

source: Issuing Certificates to Learners
kk_kz: Выдача сертификатов

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
kk_kz: Чтобы начать выпуск сертификатов по курсу, член команды курса со статусом сотрудники или администратора курса нажимает кнопку {em_start}Активировать{em_end}. Только члены команды курса с перечисленными ролями могут изменять или удалять активированные сертификаты.

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
kk_kz: {em_start}Не{em_end} удаляйте сертификаты после начала курса, иначе слушатели больше не смогут получить доступ к уже выпущенным сертификатам.

source: Learn more about certificates
kk_kz: Узнать больше о сертификатах

source: Details &amp; Schedule
kk_kz: Обзор курса и расписание

source: Grading
kk_kz: Оценивание

source: Course Team
kk_kz: Команда курса

source: Advanced Settings
kk_kz: Расширенные настройки

source: Checklists
kk_kz: Контрольные списки

source: Tools
kk_kz: Инструменты

source: Duplicate
kk_kz: Копировать

source: Duplicate this component
kk_kz: Создать копию этого компонента

source: Move
kk_kz: Переместить

source: Delete this component
kk_kz: Удалить этот компонент

source: Drag to reorder
kk_kz: Перетащите для изменения порядка

source: Page Actions
kk_kz: Действия на странице

source: Open the courseware in the LMS
kk_kz: Перейти к курсу в LMS

source: View Live Version
kk_kz: Просмотр курса

source: Preview the courseware in the LMS
kk_kz: Предварительный просмотр курса в LMS

source: Adding components
kk_kz: Добавленные компоненты

source: Select a component type under {strong_start}Add New Component{strong_end}. Then select a template.
kk_kz: Выберите тип компонента, нажав {strong_start}«Добавить новый компонент»{strong_end}. Затем выберите шаблон.

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
kk_kz: Новый компонент добавлен в конец страницы или группы. Вы можете редактировать и перемещать его.

source: Editing components
kk_kz: Изменение компонентов

source: Click the {strong_start}Edit{strong_end} icon in a component to edit its content.
kk_kz: Нажмите {strong_start}«Редактировать»{strong_end}, чтобы отредактировать содержимое компонента.

source: Reorganizing components
kk_kz: Реорганизация компонентов

source: Drag components to new locations within this component.
kk_kz: Перетащите компоненты на новые места в пределах этого компонента

source: For content experiments, you can drag components to other groups.
kk_kz: Для экспериментов с содержимым курса вы можете перемещать компоненты в другие группы.

source: Working with content experiments
kk_kz: Работа с экспериментальным содержанием

source: Confirm that you have properly configured content in each of your experiment groups.
kk_kz: Подтвердите, если вы правильно настроили содержимое каждой из ваших экспериментальных групп.

source: Learn more about component containers
kk_kz: Дополнительная информация о компонентах модуля

source: Unit Location
kk_kz: Местонахождение блока

source: Location ID
kk_kz: Идентификатор местонахождения

source: To create a link to this unit from an HTML component in this course, enter "/jump_to_id/<location ID>" as the URL value.
kk_kz: Для создания ссылки из HTML-компонента на этот блок вставьте "/jump_to_id/<location ID>" в поле URL.

source: Location in Course Outline
kk_kz: Местонахождение в структуре курса

source: Create a Course Rerun of:
kk_kz: Перезапуск курса:

source: Create a re-run of a course
kk_kz: Перезапуск курса

source: You are creating a re-run from:
kk_kz: Вы перезапускаете курс:

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
kk_kz: Предоставьте идентифицирующую информацию для этого перезапуска курса. При перезапуске в первоначальный курс не будет внесено никаких изменений.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
kk_kz: Примечание: организация, номер курса и запуск курса все вместе должны уникальным образом идентифицировать этот новый вариант курса.

source: Required Information to Create a re-run of a course
kk_kz: Информация, необходимая для перезапуска курса.

source: e.g. Introduction to Computer Science
kk_kz: Например, «Введение в информатику».

source: The public display name for the new course. (This name is often the same as the original course name.)
kk_kz: Название нового курса, доступное пользователям (это название чаще всего совпадает с исходным названием курса).

source: Organization
kk_kz: Организация

source: e.g. UniversityX or OrganizationX
kk_kz: например: university_name или organization_name

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
kk_kz: Наименование организации-спонсора нового курса (это наименование чаще всего совпадает с исходным наименованием организации).

source: Note: No spaces or special characters are allowed.
kk_kz: Примечание: не разрешается использование пробелов и специальных символов.

source: e.g. CS101
kk_kz: например, CS101

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
kk_kz: Уникальный номер, присвоенный новому курсу организацией (этот номер чаще всего совпадает с исходным номером курса и впоследствии не может быть изменён).

source: Course Run
kk_kz: Запуск курса

source: e.g. 2014_T1
kk_kz: например: 2014_С1

source: The term in which the new course will run. (This value is often different than the original course run value.)
kk_kz: Семестр, в котором будет проходить курс (это значение обычно отличается от исходного времени проведения курса).

source: Create Re-run
kk_kz: Создать перезапуск

source: When will my course re-run start?
kk_kz: Когда начнётся перезапуск моего курса?

source: The new course is set to start on January 1, 2030 at midnight (UTC).
kk_kz: Дата начала нового курса установлена на 1 января 2030 года в полночь (UTC).

source: What transfers from the original course?
kk_kz: Что используется из исходного курса?

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
kk_kz: Структура и содержимое исходного курса будут использованы в новом курсе без изменений. Все задания, видеоматериалы, объявления и другие файлы будут скопированы при создании нового курса.

source: What does not transfer from the original course?
kk_kz: Что не переносится из исходного курса?

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
kk_kz: Вы – единственный сотрудник нового курса. На курсе ещё нет обучающихся, поэтому отсутствуют соответствующие данные. Нет тем для обсуждения и статей вики.

source: Learn more about Course Re-runs
kk_kz: Узнать больше о перезапусках курса

source: Course Updates
kk_kz: Новости курса

source: New Update
kk_kz: Создать новость

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
kk_kz: Используйте обновления курса для оповещения о важных датах и испытаниях, привлечения внимания к определенным обсуждениям, объявления об изменениях в расписании, для ответов на вопросы. Вы можете добавлять и редактировать новости в формате HTML.

source: This course was created as a re-run. Some manual configuration is needed.
kk_kz: Этот курс создан при перезапуске другого курса. Необходимо вручную изменить некоторые настройки.

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
kk_kz: В данный момент всё содержимое курса скрыто, на курс не зачислен ни один слушатель. Обязательно проверьте и обновите все даты, включая дату начала курса; создайте команду курса; проверьте раздел новостей и другие материалы на предмет дат; задайте базовые темы обсуждений и вики.

source: Warning
kk_kz: Предупреждение

source: This course uses features that are no longer supported.
kk_kz: В этом курсе использованы функции, которые уже не поддерживаются.

source: You must delete or replace the following components.
kk_kz: Необходимо удалить или заменить следующие компоненты:

source: Unsupported Components
kk_kz: Компоненты не поддерживаются

source: Deprecated Component
kk_kz: Устаревший компонент

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
kk_kz: Во избежание возникновения ошибок {platform_name} настоятельно рекомендует убрать функции, которые не поддерживаются, из расширенных настроек курса. Для этого перейдите к {link_start}странице «Расширенные настройки»{link_end}, найдите настройку «Список дополнительных модулей», а затем удалите из списка следующие модули.

source: Unsupported Advance Modules
kk_kz: Дополнительные модули, которые не поддерживаются

source: Click to add a new section
kk_kz: Нажмите, чтобы добавить новый раздел

source: New Section
kk_kz: Новый раздел

source: Reindex current course
kk_kz: Обновить поисковый индекс курса

source: Reindex
kk_kz: Обновить индекс

source: Collapse All Sections
kk_kz: Свернуть разделы
